-----------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\favero\Documents\GitHub\covid-underreporting\code\..\logs\7day_rolling_avg_with
> _coverage_adj.txt
  log type:  text
 opened on:  14 Jun 2020, 13:43:57

. 
. use "..\data\population.dta"

. 
. merge 1:m fips using "..\data\covidtracking.dta", keep(2 3)

    Result                           # of obs.
    -----------------------------------------
    not matched                           445
        from master                         0  (_merge==1)
        from using                        445  (_merge==2)

    matched                             5,116  (_merge==3)
    -----------------------------------------

. 
. order date fips

. sort fips state date

. 
. xtset fips date
       panel variable:  fips (unbalanced)
        time variable:  date, 20200122 to 20200612
                delta:  1 day

. 
. gen d_pos = d.positive
(71 missing values generated)

. gen d_neg = d.negative
(276 missing values generated)

. 
. // for negative values of new tests: create flag & replace negative values with zeros... cumulative
>  case counts can't truly drop, so these reflect some sort of reporting error
. gen smoothed_d_pos = d_pos
(71 missing values generated)

. replace smoothed_d_pos = d_pos + f.d_pos if f.d_pos < 0
(19 real changes made)

. replace smoothed_d_pos = 0 if d_pos < 0
(21 real changes made)

. gen smoothed_d_neg = d_neg
(276 missing values generated)

. replace smoothed_d_neg = d_neg + f.d_neg if f.d_neg < 0
(30 real changes made)

. replace smoothed_d_neg = 0 if d_neg < 0
(31 real changes made)

. // smoothing for 2nd time (allows for 2 consecutive days of artificially inflated reporting):
. gen doublesmoothed_d_pos = smoothed_d_pos
(71 missing values generated)

. replace doublesmoothed_d_pos = smoothed_d_pos + f.smoothed_d_pos if f.smoothed_d_pos < 0
(4 real changes made)

. replace doublesmoothed_d_pos = 0 if smoothed_d_pos < 0
(4 real changes made)

. gen doublesmoothed_d_neg = smoothed_d_neg
(276 missing values generated)

. replace doublesmoothed_d_neg = smoothed_d_neg + f.smoothed_d_neg if f.smoothed_d_neg < 0
(13 real changes made)

. replace doublesmoothed_d_neg = 0 if smoothed_d_neg < 0
(14 real changes made)

. // smoothing for 3rd time (allows for 3 consecutive days of artificially inflated reporting):
. gen new_pos = doublesmoothed_d_pos
(71 missing values generated)

. replace new_pos = doublesmoothed_d_pos + f.doublesmoothed_d_pos if f.doublesmoothed_d_pos < 0
(3 real changes made)

. replace new_pos = 0 if new_pos < 0
(5 real changes made)

. gen new_neg = doublesmoothed_d_neg
(276 missing values generated)

. replace new_neg = doublesmoothed_d_neg + f.doublesmoothed_d_neg if f.doublesmoothed_d_neg < 0
(8 real changes made)

. replace new_neg = 0 if new_neg < 0
(14 real changes made)

. 
. gen new_pos_7d = (new_pos + l.new_pos + l2.new_pos + l3.new_pos + l4.new_pos + l5.new_pos + l6.new_
> pos)/7
(407 missing values generated)

. gen new_neg_7d = (new_neg + l.new_neg + l2.new_neg + l3.new_neg + l4.new_neg + l5.new_neg + l6.new_
> neg)/7
(613 missing values generated)

. 
. gen p_pos_7d = new_pos_7d/(new_pos_7d+new_neg_7d)*100
(651 missing values generated)

. 
. gen problematic_data = (d_pos<-2|d_neg<-2)

. replace problematic_data = 1 if d_neg <= 0 & l.d_neg <= 0 & l2.d_neg <= 0 & d_pos >= 5 & l.d_pos >=
>  5 & l2.d_pos >= 5
(107 real changes made)

. replace problematic_data = 1 if p_pos_7d == 100
(5 real changes made)

. 
. gen adj_case_count_pc_7d = new_pos_7d*(1+.026213*p_pos_7d) / population * 100000 // adjustment base
> d on results from multilevel_and_nonlinear_models_of_covid_severity
(944 missing values generated)

. 
. order date fips state problematic_data adj_case_count_pc_7d new_pos_7d new_neg_7d p_pos_7d new_pos 
> new_neg positive negative population

. keep date-population

. 
. export delimited using "`dropbox'/covid_trendlines", replace
(note: file C:\Users\favero\Dropbox\covid-trendlines/covid_trendlines.csv not found)
file C:\Users\favero\Dropbox\covid-trendlines/covid_trendlines.csv saved

. 
. drop if population==.
(445 observations deleted)

. 
. format date %tdnn/dd

. la var adj_case_count_pc_7d "Estimated severity (relative to population size)"

.     //twoway (line adj_case_count_pc_7d date) (scatter adj_case_count_pc_7d date if problematic_dat
> a==1) if state_id==2, by(state, note("")) title("Relative prevalence of newly confirmed cases," "ad
> justed for testing volume (7-day rolling average)") xtitle("") ylabel(0 50 100) note("Data sources:
>  covidtracking.com, US Census Bureau (Social Explorer)") legend(order(2 "Inconsistent data reports"
> ))
.         
. gen cound_7d_available = (adj_case_count_pc_7d!=.)

. replace adj_case_count_pc_7d = 0 if problematic_data == 1 & adj_case_count_pc_7d == .
(18 real changes made)

. 
. local c_date = c(current_date)

. local c_date = subinstr("`c_date'", " ", "_", .)

. 
. encode state, gen(state_id)

. forvalues i = 1/51 {
  2.     local state : label state_id `i'
  3.         quietly sum problematic_data if state_id==`i'
  4.         if r(mean) == 0 {
  5.                 twoway (line adj_case_count_pc_7d date) if state_id==`i' & cound_7d_available==1
> , by(state, note("Estimates by covidtrendlines.com; data from covidtracking.com (CC BY-NC-4.0)")) t
> itle("Relative prevalence of newly confirmed cases, adjusted for" "testing volume (lags 2-4 weeks b
> ehind initial infections)") xtitle("") ylabel(0 50 100)
  6.                 graph export "`dropbox'/`state'`c_date'.png", replace width(1500)
  7.         }
  8.         else {
  9.                 twoway (line adj_case_count_pc_7d date if cound_7d_available==1) (scatter adj_ca
> se_count_pc_7d date if problematic_data==1) if state_id==`i', by(state, note("Estimates by covidtre
> ndlines.com; data from covidtracking.com (CC BY-NC-4.0)")) title("Relative prevalence of newly conf
> irmed cases, adjusted for" "testing volume (lags 2-4 weeks behind initial infections)") xtitle("") 
> ylabel(0 50 100) legend(order(2 "Inconsistent/suspect data reports"))
 10.                 graph export "`dropbox'/`state'`c_date'.png", replace width(1500)
 11.         }
 12. }
(note: file C:\Users\favero\Dropbox\covid-trendlines/Alabama14_Jun_2020.png not found)
(file C:\Users\favero\Dropbox\covid-trendlines/Alabama14_Jun_2020.png written in PNG format)
(note: file C:\Users\favero\Dropbox\covid-trendlines/Alaska14_Jun_2020.png not found)
(file C:\Users\favero\Dropbox\covid-trendlines/Alaska14_Jun_2020.png written in PNG format)
(note: file C:\Users\favero\Dropbox\covid-trendlines/Arizona14_Jun_2020.png not found)
(file C:\Users\favero\Dropbox\covid-trendlines/Arizona14_Jun_2020.png written in PNG format)
(note: file C:\Users\favero\Dropbox\covid-trendlines/Arkansas14_Jun_2020.png not found)
(file C:\Users\favero\Dropbox\covid-trendlines/Arkansas14_Jun_2020.png written in PNG format)
(note: file C:\Users\favero\Dropbox\covid-trendlines/California14_Jun_2020.png not found)
(file C:\Users\favero\Dropbox\covid-trendlines/California14_Jun_2020.png written in PNG format)
(note: file C:\Users\favero\Dropbox\covid-trendlines/Colorado14_Jun_2020.png not found)
(file C:\Users\favero\Dropbox\covid-trendlines/Colorado14_Jun_2020.png written in PNG format)
(note: file C:\Users\favero\Dropbox\covid-trendlines/Connecticut14_Jun_2020.png not found)
(file C:\Users\favero\Dropbox\covid-trendlines/Connecticut14_Jun_2020.png written in PNG format)
(note: file C:\Users\favero\Dropbox\covid-trendlines/Delaware14_Jun_2020.png not found)
(file C:\Users\favero\Dropbox\covid-trendlines/Delaware14_Jun_2020.png written in PNG format)
(note: file C:\Users\favero\Dropbox\covid-trendlines/District of Columbia14_Jun_2020.png not found)
(file C:\Users\favero\Dropbox\covid-trendlines/District of Columbia14_Jun_2020.png written in PNG for
> mat)
(note: file C:\Users\favero\Dropbox\covid-trendlines/Florida14_Jun_2020.png not found)
(file C:\Users\favero\Dropbox\covid-trendlines/Florida14_Jun_2020.png written in PNG format)
(note: file C:\Users\favero\Dropbox\covid-trendlines/Georgia14_Jun_2020.png not found)
(file C:\Users\favero\Dropbox\covid-trendlines/Georgia14_Jun_2020.png written in PNG format)
(note: file C:\Users\favero\Dropbox\covid-trendlines/Hawaii14_Jun_2020.png not found)
(file C:\Users\favero\Dropbox\covid-trendlines/Hawaii14_Jun_2020.png written in PNG format)
(note: file C:\Users\favero\Dropbox\covid-trendlines/Idaho14_Jun_2020.png not found)
(file C:\Users\favero\Dropbox\covid-trendlines/Idaho14_Jun_2020.png written in PNG format)
(note: file C:\Users\favero\Dropbox\covid-trendlines/Illinois14_Jun_2020.png not found)
(file C:\Users\favero\Dropbox\covid-trendlines/Illinois14_Jun_2020.png written in PNG format)
(note: file C:\Users\favero\Dropbox\covid-trendlines/Indiana14_Jun_2020.png not found)
(file C:\Users\favero\Dropbox\covid-trendlines/Indiana14_Jun_2020.png written in PNG format)
(note: file C:\Users\favero\Dropbox\covid-trendlines/Iowa14_Jun_2020.png not found)
(file C:\Users\favero\Dropbox\covid-trendlines/Iowa14_Jun_2020.png written in PNG format)
(note: file C:\Users\favero\Dropbox\covid-trendlines/Kansas14_Jun_2020.png not found)
(file C:\Users\favero\Dropbox\covid-trendlines/Kansas14_Jun_2020.png written in PNG format)
(note: file C:\Users\favero\Dropbox\covid-trendlines/Kentucky14_Jun_2020.png not found)
(file C:\Users\favero\Dropbox\covid-trendlines/Kentucky14_Jun_2020.png written in PNG format)
(note: file C:\Users\favero\Dropbox\covid-trendlines/Louisiana14_Jun_2020.png not found)
(file C:\Users\favero\Dropbox\covid-trendlines/Louisiana14_Jun_2020.png written in PNG format)
(note: file C:\Users\favero\Dropbox\covid-trendlines/Maine14_Jun_2020.png not found)
(file C:\Users\favero\Dropbox\covid-trendlines/Maine14_Jun_2020.png written in PNG format)
(note: file C:\Users\favero\Dropbox\covid-trendlines/Maryland14_Jun_2020.png not found)
(file C:\Users\favero\Dropbox\covid-trendlines/Maryland14_Jun_2020.png written in PNG format)
(note: file C:\Users\favero\Dropbox\covid-trendlines/Massachusetts14_Jun_2020.png not found)
(file C:\Users\favero\Dropbox\covid-trendlines/Massachusetts14_Jun_2020.png written in PNG format)
(note: file C:\Users\favero\Dropbox\covid-trendlines/Michigan14_Jun_2020.png not found)
(file C:\Users\favero\Dropbox\covid-trendlines/Michigan14_Jun_2020.png written in PNG format)
(note: file C:\Users\favero\Dropbox\covid-trendlines/Minnesota14_Jun_2020.png not found)
(file C:\Users\favero\Dropbox\covid-trendlines/Minnesota14_Jun_2020.png written in PNG format)
(note: file C:\Users\favero\Dropbox\covid-trendlines/Mississippi14_Jun_2020.png not found)
(file C:\Users\favero\Dropbox\covid-trendlines/Mississippi14_Jun_2020.png written in PNG format)
(note: file C:\Users\favero\Dropbox\covid-trendlines/Missouri14_Jun_2020.png not found)
(file C:\Users\favero\Dropbox\covid-trendlines/Missouri14_Jun_2020.png written in PNG format)
(note: file C:\Users\favero\Dropbox\covid-trendlines/Montana14_Jun_2020.png not found)
(file C:\Users\favero\Dropbox\covid-trendlines/Montana14_Jun_2020.png written in PNG format)
(note: file C:\Users\favero\Dropbox\covid-trendlines/Nebraska14_Jun_2020.png not found)
(file C:\Users\favero\Dropbox\covid-trendlines/Nebraska14_Jun_2020.png written in PNG format)
(note: file C:\Users\favero\Dropbox\covid-trendlines/Nevada14_Jun_2020.png not found)
(file C:\Users\favero\Dropbox\covid-trendlines/Nevada14_Jun_2020.png written in PNG format)
(note: file C:\Users\favero\Dropbox\covid-trendlines/New Hampshire14_Jun_2020.png not found)
(file C:\Users\favero\Dropbox\covid-trendlines/New Hampshire14_Jun_2020.png written in PNG format)
(note: file C:\Users\favero\Dropbox\covid-trendlines/New Jersey14_Jun_2020.png not found)
(file C:\Users\favero\Dropbox\covid-trendlines/New Jersey14_Jun_2020.png written in PNG format)
(note: file C:\Users\favero\Dropbox\covid-trendlines/New Mexico14_Jun_2020.png not found)
(file C:\Users\favero\Dropbox\covid-trendlines/New Mexico14_Jun_2020.png written in PNG format)
(note: file C:\Users\favero\Dropbox\covid-trendlines/New York14_Jun_2020.png not found)
(file C:\Users\favero\Dropbox\covid-trendlines/New York14_Jun_2020.png written in PNG format)
(note: file C:\Users\favero\Dropbox\covid-trendlines/North Carolina14_Jun_2020.png not found)
(file C:\Users\favero\Dropbox\covid-trendlines/North Carolina14_Jun_2020.png written in PNG format)
(note: file C:\Users\favero\Dropbox\covid-trendlines/North Dakota14_Jun_2020.png not found)
(file C:\Users\favero\Dropbox\covid-trendlines/North Dakota14_Jun_2020.png written in PNG format)
(note: file C:\Users\favero\Dropbox\covid-trendlines/Ohio14_Jun_2020.png not found)
(file C:\Users\favero\Dropbox\covid-trendlines/Ohio14_Jun_2020.png written in PNG format)
(note: file C:\Users\favero\Dropbox\covid-trendlines/Oklahoma14_Jun_2020.png not found)
(file C:\Users\favero\Dropbox\covid-trendlines/Oklahoma14_Jun_2020.png written in PNG format)
(note: file C:\Users\favero\Dropbox\covid-trendlines/Oregon14_Jun_2020.png not found)
(file C:\Users\favero\Dropbox\covid-trendlines/Oregon14_Jun_2020.png written in PNG format)
(note: file C:\Users\favero\Dropbox\covid-trendlines/Pennsylvania14_Jun_2020.png not found)
(file C:\Users\favero\Dropbox\covid-trendlines/Pennsylvania14_Jun_2020.png written in PNG format)
(note: file C:\Users\favero\Dropbox\covid-trendlines/Rhode Island14_Jun_2020.png not found)
(file C:\Users\favero\Dropbox\covid-trendlines/Rhode Island14_Jun_2020.png written in PNG format)
(note: file C:\Users\favero\Dropbox\covid-trendlines/South Carolina14_Jun_2020.png not found)
(file C:\Users\favero\Dropbox\covid-trendlines/South Carolina14_Jun_2020.png written in PNG format)
(note: file C:\Users\favero\Dropbox\covid-trendlines/South Dakota14_Jun_2020.png not found)
(file C:\Users\favero\Dropbox\covid-trendlines/South Dakota14_Jun_2020.png written in PNG format)
(note: file C:\Users\favero\Dropbox\covid-trendlines/Tennessee14_Jun_2020.png not found)
(file C:\Users\favero\Dropbox\covid-trendlines/Tennessee14_Jun_2020.png written in PNG format)
(note: file C:\Users\favero\Dropbox\covid-trendlines/Texas14_Jun_2020.png not found)
(file C:\Users\favero\Dropbox\covid-trendlines/Texas14_Jun_2020.png written in PNG format)
(note: file C:\Users\favero\Dropbox\covid-trendlines/Utah14_Jun_2020.png not found)
(file C:\Users\favero\Dropbox\covid-trendlines/Utah14_Jun_2020.png written in PNG format)
(note: file C:\Users\favero\Dropbox\covid-trendlines/Vermont14_Jun_2020.png not found)
(file C:\Users\favero\Dropbox\covid-trendlines/Vermont14_Jun_2020.png written in PNG format)
(note: file C:\Users\favero\Dropbox\covid-trendlines/Virginia14_Jun_2020.png not found)
(file C:\Users\favero\Dropbox\covid-trendlines/Virginia14_Jun_2020.png written in PNG format)
(note: file C:\Users\favero\Dropbox\covid-trendlines/Washington14_Jun_2020.png not found)
(file C:\Users\favero\Dropbox\covid-trendlines/Washington14_Jun_2020.png written in PNG format)
(note: file C:\Users\favero\Dropbox\covid-trendlines/West Virginia14_Jun_2020.png not found)
(file C:\Users\favero\Dropbox\covid-trendlines/West Virginia14_Jun_2020.png written in PNG format)
(note: file C:\Users\favero\Dropbox\covid-trendlines/Wisconsin14_Jun_2020.png not found)
(file C:\Users\favero\Dropbox\covid-trendlines/Wisconsin14_Jun_2020.png written in PNG format)
(note: file C:\Users\favero\Dropbox\covid-trendlines/Wyoming14_Jun_2020.png not found)
(file C:\Users\favero\Dropbox\covid-trendlines/Wyoming14_Jun_2020.png written in PNG format)

. 
. log close
      name:  <unnamed>
       log:  C:\Users\favero\Documents\GitHub\covid-underreporting\code\..\logs\7day_rolling_avg_with
> _coverage_adj.txt
  log type:  text
 closed on:  14 Jun 2020, 13:45:10
-----------------------------------------------------------------------------------------------------
