-----------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\favero\Documents\GitHub\covid-underreporting\code\..\logs\cleandata.txt
  log type:  text
 opened on:   5 Jun 2020, 16:19:07

. 
. use "..\data\population.dta" // start from this file because it has both fips codes and state names

. 
. merge 1:m fips using "..\data\covidtracking.dta", keep(2 3)

    Result                           # of obs.
    -----------------------------------------
    not matched                           405
        from master                         0  (_merge==1)
        from using                        405  (_merge==2)

    matched                             4,708  (_merge==3)
    -----------------------------------------

. drop _merge population // merge population back in later because want it merged to all observations
> , even those missing from the current dataset

. 
. merge 1:1 state date using "..\data\cdc_deaths.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                         4,733
        from master                     4,446  (_merge==1)
        from using                        287  (_merge==2)

    matched                               667  (_merge==3)
    -----------------------------------------

. drop _merge

. 
. merge 1:1 state date using "..\data\cdc_historical_deaths.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                        23,452
        from master                     4,634  (_merge==1)
        from using                     18,818  (_merge==2)

    matched                               766  (_merge==3)
    -----------------------------------------

. drop _merge

. 
. drop fips

. merge m:1 state using "..\data\population.dta", keep(1 3)

    Result                           # of obs.
    -----------------------------------------
    not matched                           441
        from master                       441  (_merge==1)
        from using                          0  (_merge==2)

    matched                            23,777  (_merge==3)
    -----------------------------------------

. drop _merge

. order date fips

. sort fips state date

. 
. drop if fips > 56
(441 observations deleted)

. 
. encode dataqualitygrade, gen(datagrade)

. order datagrade, after(dataqualitygrade)

. drop dataqualitygrade

. 
. gen end_week = date + mod(6 - dow(date), 7)

. format end_week %tdCCYYNNDD

. order end_week, after(date)

. 
. drop hash datechecked // new variables added to more recent versions of covidtracking's data that i
> nterfere with following code:

. foreach var of varlist positive-datagrade death-pneumon_influ_or_covid numinfluenzadeaths-percentco
> mplete {
  2.         gen `var'_mis = (`var'==.)
  3. }

. gen dayscollapsed = 1

. collapse (firstnm) state report_date epi_week (lastnm) positive-datagrade population death-posneg (
> sum) deathincrease-pneumon_influ_or_covid numinfluenzadeaths-percentcomplete *_mis dayscollapsed, b
> y(end_week fips)

. foreach var of varlist positive-datagrade {
  2.         replace `var' = . if `var'_mis > 0
  3. }
(0 real changes made)
(16 real changes made, 16 to missing)
(52 real changes made, 52 to missing)
(53 real changes made, 53 to missing)
(50 real changes made, 50 to missing)
(35 real changes made, 35 to missing)
(18 real changes made, 18 to missing)
(30 real changes made, 30 to missing)
(12 real changes made, 12 to missing)
(46 real changes made, 46 to missing)
(51 real changes made, 51 to missing)

. foreach var of varlist death-pneumon_influ_or_covid numinfluenzadeaths-percentcomplete {
  2.         replace `var' = . if `var'_mis == dayscollapsed
  3. }
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(19,069 real changes made, 19,069 to missing)
(19,069 real changes made, 19,069 to missing)
(19,069 real changes made, 19,069 to missing)
(19,069 real changes made, 19,069 to missing)
(19,069 real changes made, 19,069 to missing)
(19,069 real changes made, 19,069 to missing)
(19,069 real changes made, 19,069 to missing)
(19,788 real changes made, 19,788 to missing)
(18,870 real changes made, 18,870 to missing)
(18,870 real changes made, 18,870 to missing)
(18,870 real changes made, 18,870 to missing)
(18,870 real changes made, 18,870 to missing)
(18,870 real changes made, 18,870 to missing)
(18,870 real changes made, 18,870 to missing)
(18,870 real changes made, 18,870 to missing)
(204 real changes made, 204 to missing)
(204 real changes made, 204 to missing)
(204 real changes made, 204 to missing)
(204 real changes made, 204 to missing)

. drop *_mis

. 
. xtset fips end_week, delta(7)
       panel variable:  fips (strongly balanced)
        time variable:  end_week, 20130105 to 20200606
                delta:  7 days

. 
. gen new_pos = d.positive if d.positive>=0
(19,120 missing values generated)

. gen new_neg = d.negative if d.negative>=0
(19,165 missing values generated)

. gen p_pos = new_pos/(new_pos+new_neg)*100
(19,165 missing values generated)

. order new_pos-p_pos, after(negative)

. 
. // adjust expected deaths for reporting lag: https://www.cdc.gov/nchs/data/vsrr/report001.pdf
. // maybe also somehow adjust for how the individual state was doing relative to expectations pre-co
> vid
. gen days_to_report = report_date - end_week
(18,870 missing values generated)

. 
. drop if fips == 9 | fips == 37 // Connecticut and North Carolina's data look highly problematic, so
>  dropping them
(776 observations deleted)

. 
. /*
> gen allcause_minus_posscovid = total_deaths - pneumon_influ_or_covid
> gen allcause_minus_posscovid_pc  = allcause_minus_posscovid*100000/population
> bys days_to_report: sum allcause_minus_posscovid_pc
> gen adj_allcause_minus_posscovid_pc = allcause_minus_posscovid_pc
> replace adj_allcause_minus_posscovid_pc = allcause_minus_posscovid_pc * 212 / 93 if days_to_report 
> <= 7 & days_to_report != .
> replace adj_allcause_minus_posscovid_pc = allcause_minus_posscovid_pc * 212 / 159 if days_to_report
>  > 7 & days_to_report <= 14
> replace adj_allcause_minus_posscovid_pc = allcause_minus_posscovid_pc * 212 / 192 if days_to_report
>  > 14 & days_to_report <= 21
> */
. 
. //gen adj_expected_deaths = expected_deaths
. //replace adj_expected_deaths = expected_deaths * 93 / 212 if days_to_report <= 7 & days_to_report 
> != .
. //replace adj_expected_deaths = expected_deaths * 159 / 212 if days_to_report > 7 & days_to_report 
> <= 14
. //replace adj_expected_deaths = expected_deaths * 192 / 212 if days_to_report > 14 & days_to_report
>  <= 21
. gen adj_expected_deaths = expected_deaths * (1-exp(-.09246997*days_to_report))
(18,130 missing values generated)

. order adj_expected_deaths, after(expected_deaths)

. 
. gen pneumon_or_influ_fluview = numinfluenzadeaths + numpneumoniadeaths if end_week < date("20200201
> ","YMD")
(931 missing values generated)

. gen mmwrweek = substr(epi_week,-2,2)
(196 missing values generated)

. 
. //egen old_expected_influ_pneu_deaths = mean(pneumon_or_influ_fluview), by(fips mmwrweek)
. 
. // generate expected influenza/pneumonia deaths based on historical patterns
.         gen epi_year = substr(epi_week,1,4)
(196 missing values generated)

.         destring epi_year mmwrweek, replace
epi_year: all characters numeric; replaced as int
(196 missing values generated)
mmwrweek: all characters numeric; replaced as byte
(196 missing values generated)

.         replace epi_year = epi_year + 1 if mmwrweek >= 40
(4,508 real changes made)

. 
.         gen mmwrweek2 = mmwrweek - 39 if mmwrweek >= 40
(14,504 missing values generated)

.         replace mmwrweek2 = l.mmwrweek2 + 1 if mmwrweek < 40
(12,397 real changes made)

.         replace mmwrweek2 = mmwrweek + 13 if mmwrweek2 == .
(1,911 real changes made)

.         //gen pi_time = 2*_pi*mmwrweek2/52.1775
.         //gen sin_time = sin(pi_time)
.         //gen cos_time = cos(pi_time)
.         //gen halfsin_time = sin(pi_time/2)
.         //gen halfcos_time = cos(pi_time/2)
. 
.         gen pneumon_or_influ_fluview_pc = pneumon_or_influ_fluview * 100000 / population
(931 missing values generated)

.         gen allcause_fluview_pc = totaldeaths * 100000 / population if end_week < date("20200201","
> YMD")
(931 missing values generated)

.         
.         // most year-to-year variation in influenza severity seems to be from weeks 50 to 8; thus, 
> create a sin spike for this period with a year-varying coefficient
.         gen fluseason = 0 if mmwrweek != .
(196 missing values generated)

.         replace fluseason = 1 if (mmwrweek >= 50 | mmwrweek <= 8) & mmwrweek != .
(4,214 real changes made)

.         gen fluseason_sin_time = sin(fluseason*_pi*(mmwrweek2-10)/12)
(196 missing values generated)

.         
.         reg pneumon_or_influ_fluview_pc i.fips i.epi_year i.mmwrweek i.epi_year#c.fluseason_sin_tim
> e [aweight=population]
(sum of wgt is 115,934,690,088)

      Source |       SS           df       MS      Number of obs   =    18,081
-------------+----------------------------------   F(115, 17965)   =    521.03
       Model |  2010.13658       115  17.4794485   Prob > F        =    0.0000
    Residual |  602.682367    17,965  .033547585   R-squared       =    0.7693
-------------+----------------------------------   Adj R-squared   =    0.7679
       Total |  2612.81894    18,080  .144514322   Root MSE        =    .18316

-----------------------------------------------------------------------------------------------
  pneumon_or_influ_fluview_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                         fips |
                           2  |  -.5825264   .0302615   -19.25   0.000    -.6418418    -.523211
                           4  |  -.3205597    .014106   -22.73   0.000    -.3482088   -.2929106
                           5  |   .3051991   .0176652    17.28   0.000     .2705736    .3398245
                           6  |  -.2268413   .0115605   -19.62   0.000    -.2495009   -.2041817
                           8  |  -.4727203   .0148364   -31.86   0.000     -.501801   -.4436396
                          10  |  -.1437599   .0267869    -5.37   0.000    -.1962649    -.091255
                          11  |  -.4478159   .0307389   -14.57   0.000    -.5080672   -.3875647
                          12  |  -.2283191   .0120844   -18.89   0.000    -.2520057   -.2046326
                          13  |   -.412139   .0131831   -31.26   0.000    -.4379792   -.3862988
                          15  |    .276329    .023035    12.00   0.000     .2311783    .3214798
                          16  |  -.3940811   .0210972   -18.68   0.000    -.4354336   -.3527285
                          17  |  -.1206361   .0128411    -9.39   0.000    -.1458059   -.0954663
                          18  |   .0786389   .0143346     5.49   0.000     .0505417    .1067361
                          19  |   .1232256   .0174257     7.07   0.000     .0890695    .1573816
                          20  |   .0298226   .0178602     1.67   0.095    -.0051851    .0648303
                          21  |   .4487376   .0157915    28.42   0.000     .4177848    .4796904
                          22  |  -.2867302   .0156297   -18.35   0.000    -.3173659   -.2560945
                          23  |   .2510922   .0235066    10.68   0.000     .2050171    .2971674
                          24  |  -.1675401   .0146736   -11.42   0.000    -.1963017   -.1387785
                          25  |   .0308224   .0142642     2.16   0.031     .0028633    .0587816
                          26  |   -.053199    .013314    -4.00   0.000    -.0792956   -.0271023
                          27  |  -.2334791   .0149083   -15.66   0.000    -.2627007   -.2042575
                          28  |   .2135278   .0177415    12.04   0.000     .1787527    .2483029
                          29  |    .011761   .0146244     0.80   0.421    -.0169042    .0404262
                          30  |  -.1525114   .0257744    -5.92   0.000    -.2030317   -.1019911
                          31  |   .0210884   .0204999     1.03   0.304    -.0190934    .0612701
                          32  |  -.1912616   .0175541   -10.90   0.000    -.2256695   -.1568538
                          33  |  -.0829131   .0234012    -3.54   0.000    -.1287816   -.0370445
                          34  |  -.2831354   .0135839   -20.84   0.000    -.3097611   -.2565098
                          35  |  -.0679577   .0199224    -3.41   0.001    -.1070075   -.0289078
                          36  |   .0166138   .0122007     1.36   0.173    -.0073007    .0405283
                          38  |   .0977247   .0297295     3.29   0.001      .039452    .1559975
                          39  |  -.0025399   .0129908    -0.20   0.845    -.0280031    .0229233
                          40  |   .3447875    .016316    21.13   0.000     .3128066    .3767684
                          41  |  -.3377835   .0160344   -21.07   0.000    -.3692125   -.3063545
                          42  |  -.0007948   .0128229    -0.06   0.951    -.0259289    .0243392
                          44  |    .163297   .0258683     6.31   0.000     .1125927    .2140013
                          45  |  -.0202714   .0152352    -1.33   0.183    -.0501338    .0095911
                          46  |   .2430771   .0278897     8.72   0.000     .1884105    .2977436
                          47  |   .2196776   .0142916    15.37   0.000     .1916646    .2476906
                          48  |  -.3041931   .0117896   -25.80   0.000    -.3273018   -.2810843
                          49  |  -.5313371   .0173413   -30.64   0.000    -.5653278   -.4973465
                          50  |   .1005237   .0324517     3.10   0.002     .0369154    .1641321
                          51  |  -.3291503   .0136816   -24.06   0.000    -.3559676    -.302333
                          53  |  -.2774458   .0139801   -19.85   0.000    -.3048482   -.2500435
                          54  |   .7406933   .0210753    35.15   0.000     .6993837    .7820028
                          55  |  -.1767177    .014799   -11.94   0.000    -.2057252   -.1477102
                          56  |  -.0795715   .0335577    -2.37   0.018    -.1453478   -.0137952
                              |
                     epi_year |
                        2014  |  -.0286355   .0062144    -4.61   0.000    -.0408164   -.0164545
                        2015  |  -.0050376   .0062301    -0.81   0.419    -.0172493     .007174
                        2016  |  -.0136425   .0062144    -2.20   0.028    -.0258234   -.0014616
                        2017  |  -.0224213   .0062144    -3.61   0.000    -.0346023   -.0102404
                        2018  |  -.0496476   .0062144    -7.99   0.000    -.0618285   -.0374667
                        2019  |   -.057876   .0062144    -9.31   0.000    -.0700569   -.0456951
                        2020  |  -.0932328    .009971    -9.35   0.000    -.1127769   -.0736887
                              |
                     mmwrweek |
                           2  |   .0943287   .0143391     6.58   0.000     .0662228    .1224347
                           3  |   .0435352   .0150767     2.89   0.004     .0139834    .0730871
                           4  |  -.0046308   .0139235    -0.33   0.739    -.0319222    .0226606
                           5  |   .0089999    .013824     0.65   0.515    -.0180965    .0360963
                           6  |   .0616996   .0188315     3.28   0.001      .024788    .0986112
                           7  |   .1805674   .0299012     6.04   0.000     .1219583    .2391766
                           8  |   .2913603   .0444062     6.56   0.000     .2043198    .3784008
                           9  |   .3732969   .0580381     6.43   0.000     .2595366    .4870573
                          10  |   .3626572   .0580381     6.25   0.000     .2488969    .4764176
                          11  |   .3281918   .0580381     5.65   0.000     .2144314    .4419521
                          12  |   .2772211   .0580381     4.78   0.000     .1634607    .3909814
                          13  |   .2442106   .0580381     4.21   0.000     .1304502    .3579709
                          14  |    .220976   .0580381     3.81   0.000     .1072156    .3347363
                          15  |   .1877382   .0580381     3.23   0.001     .0739778    .3014985
                          16  |   .1300835   .0580381     2.24   0.025     .0163232    .2438439
                          17  |   .0777488   .0580381     1.34   0.180    -.0360116    .1915091
                          18  |    .046648   .0580381     0.80   0.422    -.0671123    .1604084
                          19  |   .0195485   .0580381     0.34   0.736    -.0942118    .1333089
                          20  |  -.0182816   .0580381    -0.31   0.753     -.132042    .0954787
                          21  |  -.0234196   .0580381    -0.40   0.687      -.13718    .0903407
                          22  |  -.0630231   .0580381    -1.09   0.278    -.1767834    .0507373
                          23  |  -.0398794   .0580381    -0.69   0.492    -.1536397    .0738809
                          24  |    -.06175   .0580381    -1.06   0.287    -.1755103    .0520104
                          25  |  -.0813471   .0580381    -1.40   0.161    -.1951074    .0324133
                          26  |  -.0945785   .0580381    -1.63   0.103    -.2083389    .0191818
                          27  |  -.1124478   .0580381    -1.94   0.053    -.2262082    .0013125
                          28  |     -.1049   .0580381    -1.81   0.071    -.2186603    .0088604
                          29  |     -.1335   .0580381    -2.30   0.021    -.2472603   -.0197396
                          30  |  -.1346367   .0580381    -2.32   0.020     -.248397   -.0208763
                          31  |  -.1411387   .0580381    -2.43   0.015    -.2548991   -.0273784
                          32  |   -.149596   .0580381    -2.58   0.010    -.2633563   -.0358356
                          33  |  -.1476863   .0580381    -2.54   0.011    -.2614466   -.0339259
                          34  |  -.1430939   .0580381    -2.47   0.014    -.2568543   -.0293336
                          35  |  -.1535518   .0580381    -2.65   0.008    -.2673121   -.0397914
                          36  |  -.1354097   .0580381    -2.33   0.020      -.24917   -.0216493
                          37  |  -.1162672   .0580381    -2.00   0.045    -.2300276   -.0025069
                          38  |  -.1041725   .0580381    -1.79   0.073    -.2179328    .0095879
                          39  |  -.1020354   .0580381    -1.76   0.079    -.2157958    .0117249
                          40  |  -.0629356   .0580304    -1.08   0.278    -.1766808    .0508096
                          41  |  -.0591617   .0580304    -1.02   0.308    -.1729069    .0545836
                          42  |  -.0302889   .0580304    -0.52   0.602    -.1440341    .0834564
                          43  |   -.022832   .0580304    -0.39   0.694    -.1365772    .0909133
                          44  |  -.0224228   .0580304    -0.39   0.699     -.136168    .0913225
                          45  |  -.0082819   .0580304    -0.14   0.887    -.1220271    .1054633
                          46  |   .0037674   .0580304     0.06   0.948    -.1099779    .1175126
                          47  |   .0109969   .0580304     0.19   0.850    -.1027483    .1247422
                          48  |   .0504185   .0580304     0.87   0.385    -.0633267    .1641637
                          49  |   .0999342   .0580304     1.72   0.085     -.013811    .2136794
                          50  |   .0123089   .0420319     0.29   0.770    -.0700777    .0946955
                          51  |  -.0901592   .0278144    -3.24   0.001    -.1446781   -.0356403
                          52  |  -.0969597   .0174602    -5.55   0.000    -.1311833   -.0627361
                          53  |   .0863107   .0292583     2.95   0.003     .0289616    .1436599
                              |
epi_year#c.fluseason_sin_time |
                        2013  |   .7851516   .0648531    12.11   0.000     .6580334    .9122698
                        2014  |   .5757474   .0647532     8.89   0.000     .4488249    .7026699
                        2015  |   .8378202   .0674693    12.42   0.000     .7055739    .9700665
                        2016  |   .2471254   .0647532     3.82   0.000     .1202028    .3740479
                        2017  |    .506053   .0647532     7.82   0.000     .3791305    .6329755
                        2018  |   1.079833   .0647532    16.68   0.000     .9529101    1.206755
                        2019  |   .3367439   .0647532     5.20   0.000     .2098213    .4636664
                        2020  |   .4147721   .0662991     6.26   0.000     .2848196    .5447246
                              |
                        _cons |   1.155233   .0585024    19.75   0.000     1.040563    1.269903
-----------------------------------------------------------------------------------------------

.         predict expected_influ_pneu_deaths_pc
(option xb assumed; fitted values)
(196 missing values generated)

.         gen expected_influ_pneu_deaths = expected_influ_pneu_deaths_pc * population / 100000
(196 missing values generated)

.         
.         reg allcause_fluview_pc i.fips i.epi_year i.mmwrweek i.epi_year#c.fluseason_sin_time [aweig
> ht=population]
(sum of wgt is 115,934,690,088)

      Source |       SS           df       MS      Number of obs   =    18,081
-------------+----------------------------------   F(115, 17965)   =   2276.69
       Model |   149866.33       115  1303.18548   Prob > F        =    0.0000
    Residual |  10283.2181    17,965    .5724029   R-squared       =    0.9358
-------------+----------------------------------   Adj R-squared   =    0.9354
       Total |  160149.548    18,080  8.85782899   Root MSE        =    .75657

-----------------------------------------------------------------------------------------------
          allcause_fluview_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                         fips |
                           2  |  -8.874645       .125   -71.00   0.000    -9.119657   -8.629633
                           4  |  -5.536307   .0582672   -95.02   0.000    -5.650516   -5.422098
                           5  |  -.1086311    .072969    -1.49   0.137    -.2516573    .0343951
                           6  |  -7.591295   .0477524  -158.97   0.000    -7.684895   -7.497696
                           8  |  -7.914249   .0612842  -129.14   0.000    -8.034372   -7.794126
                          10  |  -2.913749   .1106479   -26.33   0.000     -3.13063   -2.696869
                          11  |  -6.942693   .1269723   -54.68   0.000    -7.191571   -6.693815
                          12  |   -2.74074   .0499166   -54.91   0.000    -2.838581   -2.642898
                          13  |  -5.606151   .0544551  -102.95   0.000    -5.712888   -5.499414
                          15  |  -5.229157   .0951499   -54.96   0.000     -5.41566   -5.042654
                          16  |  -5.804115   .0871455   -66.60   0.000    -5.974928   -5.633301
                          17  |  -3.990156   .0530423   -75.23   0.000    -4.094124   -3.886188
                          18  |   -2.11648   .0592114   -35.74   0.000     -2.23254    -2.00042
                          19  |  -2.087934   .0719797   -29.01   0.000    -2.229021   -1.946847
                          20  |  -2.710415   .0737745   -36.74   0.000     -2.85502   -2.565809
                          21  |  -.0643001   .0652294    -0.99   0.324    -.1921559    .0635556
                          22  |  -1.815128   .0645611   -28.11   0.000    -1.941674   -1.688582
                          23  |   .1897438   .0970979     1.95   0.051    -.0005774    .3800649
                          24  |  -4.906743   .0606116   -80.95   0.000    -5.025547   -4.787938
                          25  |  -4.361143   .0589206   -74.02   0.000    -4.476633   -4.245653
                          26  |  -1.771473   .0549956   -32.21   0.000    -1.879269   -1.663676
                          27  |  -5.555015    .061581   -90.21   0.000     -5.67572   -5.434311
                          28  |   .2136535   .0732844     2.92   0.004     .0700091     .357298
                          29  |  -1.368934   .0604084   -22.66   0.000     -1.48734   -1.250528
                          30  |  -2.537289   .1064655   -23.83   0.000    -2.745972   -2.328606
                          31  |  -3.887907   .0846782   -45.91   0.000    -4.053884   -3.721929
                          32  |  -5.547178   .0725104   -76.50   0.000    -5.689305    -5.40505
                          33  |  -3.201506   .0966626   -33.12   0.000    -3.390974   -3.012038
                          34  |  -4.397227   .0561104   -78.37   0.000    -4.507209   -4.287246
                          35  |  -3.561364   .0822928   -43.28   0.000    -3.722666   -3.400062
                          36  |  -5.084633   .0503969  -100.89   0.000    -5.183416    -4.98585
                          38  |  -4.263738   .1228028   -34.72   0.000    -4.504444   -4.023033
                          39  |  -.7523835   .0536607   -14.02   0.000    -.8575637   -.6472033
                          40  |  -1.024522   .0673959   -15.20   0.000    -1.156624   -.8924194
                          41  |  -4.017647   .0662329   -60.66   0.000     -4.14747   -3.887824
                          42  |  -.4512408    .052967    -8.52   0.000    -.5550612   -.3474204
                          44  |  -2.164328   .1068533   -20.26   0.000    -2.373771   -1.954885
                          45  |   -2.32534   .0629316   -36.95   0.000    -2.448692   -2.201988
                          46  |  -3.381317   .1152032   -29.35   0.000    -3.607126   -3.155507
                          47  |  -1.150658   .0590341   -19.49   0.000     -1.26637   -1.034945
                          48  |  -7.489888    .048699  -153.80   0.000    -7.585343   -7.394434
                          49  |  -9.711723   .0716313  -135.58   0.000    -9.852127   -9.571319
                          50  |  -2.565858    .134047   -19.14   0.000    -2.828603   -2.303113
                          51  |  -5.257939   .0565142   -93.04   0.000    -5.368713   -5.147166
                          53  |   -6.39679   .0577472  -110.77   0.000     -6.50998     -6.2836
                          54  |   4.141778   .0870549    47.58   0.000     3.971142    4.312414
                          55  |  -3.336058   .0611298   -54.57   0.000    -3.455878   -3.216238
                          56  |  -4.299452   .1386157   -31.02   0.000    -4.571152   -4.027751
                              |
                     epi_year |
                        2014  |   .1686245   .0256698     6.57   0.000     .1183091    .2189398
                        2015  |   .6933838   .0257345    26.94   0.000     .6429416     .743826
                        2016  |   .9312337   .0256698    36.28   0.000     .8809183     .981549
                        2017  |   1.318514   .0256698    51.36   0.000     1.268199    1.368829
                        2018  |   1.379636   .0256698    53.75   0.000      1.32932    1.429951
                        2019  |   1.665335   .0256698    64.88   0.000      1.61502    1.715651
                        2020  |   1.981964   .0411869    48.12   0.000     1.901234    2.062694
                              |
                     mmwrweek |
                           2  |   .7510854     .05923    12.68   0.000      .634989    .8671818
                           3  |   .2909362    .062277     4.67   0.000     .1688673     .413005
                           4  |   .0755576   .0575134     1.31   0.189    -.0371742    .1882894
                           5  |   .1132406   .0571025     1.98   0.047     .0013142     .225167
                           6  |   .3030404   .0777868     3.90   0.000     .1505707      .45551
                           7  |   .4924717   .1235118     3.99   0.000     .2503768    .7345666
                           8  |   .5767422   .1834274     3.14   0.002     .2172069    .9362776
                           9  |    .760545   .2397363     3.17   0.002     .2906388    1.230451
                          10  |   .8427983   .2397363     3.52   0.000     .3728921    1.312704
                          11  |   .6166811   .2397363     2.57   0.010     .1467749    1.086587
                          12  |   .4575853   .2397363     1.91   0.056    -.0123209    .9274915
                          13  |   .2760733   .2397363     1.15   0.250    -.1938329    .7459795
                          14  |    .233287   .2397363     0.97   0.331    -.2366192    .7031932
                          15  |   .1186597   .2397363     0.49   0.621    -.3512465     .588566
                          16  |  -.1960309   .2397363    -0.82   0.414    -.6659371    .2738753
                          17  |  -.3918656   .2397363    -1.63   0.102    -.8617718    .0780407
                          18  |  -.3984586   .2397363    -1.66   0.097    -.8683648    .0714476
                          19  |  -.5627379   .2397363    -2.35   0.019    -1.032644   -.0928317
                          20  |  -.7990855   .2397363    -3.33   0.001    -1.268992   -.3291793
                          21  |  -.8135901   .2397363    -3.39   0.001    -1.283496   -.3436839
                          22  |  -.9493604   .2397363    -3.96   0.000    -1.419267   -.4794542
                          23  |   -.853239   .2397363    -3.56   0.000    -1.323145   -.3833328
                          24  |  -.9735954   .2397363    -4.06   0.000    -1.443502   -.5036892
                          25  |  -1.002923   .2397363    -4.18   0.000    -1.472829   -.5330166
                          26  |  -1.046164   .2397363    -4.36   0.000     -1.51607   -.5762576
                          27  |  -1.008561   .2397363    -4.21   0.000    -1.478467   -.5386548
                          28  |   -1.09618   .2397363    -4.57   0.000    -1.566086   -.6262734
                          29  |  -1.167293   .2397363    -4.87   0.000    -1.637199   -.6973869
                          30  |  -1.200167   .2397363    -5.01   0.000    -1.670073   -.7302609
                          31  |  -1.208852   .2397363    -5.04   0.000    -1.678758   -.7389455
                          32  |  -1.162155   .2397363    -4.85   0.000    -1.632061   -.6922489
                          33  |  -1.227403   .2397363    -5.12   0.000    -1.697309   -.7574968
                          34  |  -1.245318   .2397363    -5.19   0.000    -1.715224   -.7754115
                          35  |  -1.171567   .2397363    -4.89   0.000    -1.641473   -.7016609
                          36  |  -1.111775   .2397363    -4.64   0.000    -1.581682   -.6418692
                          37  |  -1.041662   .2397363    -4.35   0.000    -1.511569   -.5717561
                          38  |  -.9753231   .2397363    -4.07   0.000    -1.445229   -.5054169
                          39  |  -.9337645   .2397363    -3.89   0.000    -1.403671   -.4638583
                          40  |  -.9553649   .2397045    -3.99   0.000    -1.425209   -.4855211
                          41  |  -.9576838   .2397045    -4.00   0.000    -1.427528     -.48784
                          42  |  -.8090912   .2397045    -3.38   0.001    -1.278935   -.3392475
                          43  |  -.7621218   .2397045    -3.18   0.001    -1.231966    -.292278
                          44  |  -.6664551   .2397045    -2.78   0.005    -1.136299   -.1966113
                          45  |  -.5058133   .2397045    -2.11   0.035    -.9756571   -.0359695
                          46  |  -.3625407   .2397045    -1.51   0.130    -.8323845    .1073031
                          47  |  -.2459584   .2397045    -1.03   0.305    -.7158021    .2238854
                          48  |  -.1792099   .2397045    -0.75   0.455    -.6490537    .2906339
                          49  |   .1645353   .2397045     0.69   0.492    -.3053084    .6343791
                          50  |   .0067743   .1736199     0.04   0.969    -.3335374     .347086
                          51  |  -.0571436    .114892    -0.50   0.619     -.282343    .1680558
                          52  |  -.1598643   .0721221    -2.22   0.027    -.3012306   -.0184979
                          53  |   .3886875   .1208565     3.22   0.001     .1517971    .6255779
                              |
epi_year#c.fluseason_sin_time |
                        2013  |    1.61474   .2678864     6.03   0.000     1.089657    2.139823
                        2014  |   .9498287    .267474     3.55   0.000     .4255539    1.474104
                        2015  |   2.011456   .2786933     7.22   0.000     1.465191    2.557722
                        2016  |   .3764468    .267474     1.41   0.159     -.147828    .9007216
                        2017  |   1.427717    .267474     5.34   0.000     .9034422    1.951992
                        2018  |   2.878731    .267474    10.76   0.000     2.354456    3.403006
                        2019  |   .5963451    .267474     2.23   0.026     .0720703     1.12062
                        2020  |   .5455987   .2738594     1.99   0.046     .0088079    1.082389
                              |
                        _cons |   19.48393   .2416538    80.63   0.000     19.01026    19.95759
-----------------------------------------------------------------------------------------------

.         predict expected_allcause_deaths_pc
(option xb assumed; fitted values)
(196 missing values generated)

.         gen expected_allcause_deaths = expected_allcause_deaths_pc * population / 100000
(196 missing values generated)

. 
. //gen adj_expected_influ_pneu_deaths = expected_influ_pneu_deaths
. //replace adj_expected_influ_pneu_deaths = expected_influ_pneu_deaths * 93 / 212 if days_to_report 
> <= 7 & days_to_report != .
. //replace adj_expected_influ_pneu_deaths = expected_influ_pneu_deaths * 159 / 212 if days_to_report
>  > 7 & days_to_report <= 14
. //replace adj_expected_influ_pneu_deaths = expected_influ_pneu_deaths * 192 / 212 if days_to_report
>  > 14 & days_to_report <= 21
. gen adj_expected_influ_pneu_deaths = expected_influ_pneu_deaths * (1-exp(-.09246997*days_to_report)
> )
(18,277 missing values generated)

. order adj_expected_influ_pneu_deaths, after(expected_influ_pneu_deaths)

. 
. replace covid_deaths = 5 if covid_deaths == . & total_deaths != . //rough imputation for where data
>  is supressed for 1-9 deaths
(0 real changes made)

. 
. 
. gen cumulative_covid_death = covid_deaths
(18,130 missing values generated)

. replace cumulative_covid_death = cumulative_covid_death + l.cumulative_covid_death if l.cumulative_
> covid_death != .
(503 real changes made)

. 
. //gen adj_covid_deaths = covid_deaths
. //replace adj_covid_deaths = covid_deaths * 212 / 93 if days_to_report <= 7 & days_to_report != .
. //replace adj_covid_deaths = covid_deaths * 212 / 159 if days_to_report > 7 & days_to_report <= 14
. //replace adj_covid_deaths = covid_deaths * 212 / 192 if days_to_report > 14 & days_to_report <= 21
. 
. gen adj_covid_deaths = covid_deaths / (1-exp(-.09246997*days_to_report))
(18,130 missing values generated)

. gen adj_cumulative_covid_death = adj_covid_deaths
(18,130 missing values generated)

. replace adj_cumulative_covid_death = adj_cumulative_covid_death + l.adj_cumulative_covid_death if l
> .adj_cumulative_covid_death != .
(503 real changes made)

. 
. gen adj_total_deaths = total_deaths / (1-exp(-.09246997*days_to_report))
(18,130 missing values generated)

. gen adj_pneumon_influ_or_covid = pneumon_influ_or_covid / (1-exp(-.09246997*days_to_report))
(18,130 missing values generated)

. 
. 
. gen covid_deaths_pc = covid_deaths*100000/population
(18,130 missing values generated)

. gen excess_deaths_pc = (total_deaths-adj_expected_deaths)*100000/population
(18,130 missing values generated)

. gen excess_respir_deaths_pc = (pneumon_influ_or_covid-adj_expected_influ_pneu_deaths)*100000/popula
> tion
(18,277 missing values generated)

. gen adj_excess_deaths_pc = (adj_total_deaths-expected_deaths)*100000/population
(18,130 missing values generated)

. gen adj_excess_deaths_fluview_pc = (adj_total_deaths-expected_allcause_deaths)*100000/population
(18,277 missing values generated)

. gen adj_excess_respir_deaths_pc = (adj_pneumon_influ_or_covid-expected_influ_pneu_deaths)*100000/po
> pulation
(18,277 missing values generated)

. gen new_pos_pc = new_pos*100000/population
(18,370 missing values generated)

. gen new_neg_pc = new_neg*100000/population
(18,412 missing values generated)

. gen new_tests_pc = new_pos_pc + new_neg_pc
(18,412 missing values generated)

. gen deathincrease_pc = deathincrease*100000/population
(18,321 missing values generated)

. gen adj_covid_deaths_pc = adj_covid_deaths*100000/population
(18,130 missing values generated)

. 
. /*
> gen log_covid_death = log(covid_deaths)
>         //replace log_covid_death = 2 if covid_deaths==0
> gen log_allcause = log(total_deaths)
> gen log_expected = log(adj_expected_deaths)
> gen excess_deaths = log_allcause-log_expected
> */
. 
. save "..\data\weeklydata.dta", replace
file ..\data\weeklydata.dta saved

. 
. 
. reg excess_deaths_pc covid_deaths_pc [aweight=population] if days_to_report > 14, cluster(fips) noc
> ons
(sum of wgt is 5,026,978,432)

Linear regression                               Number of obs     =        784
                                                F(1, 48)          =      15.92
                                                Prob > F          =     0.0002
                                                R-squared         =     0.1516
                                                Root MSE          =     10.216

                                     (Std. Err. adjusted for 49 clusters in fips)
---------------------------------------------------------------------------------
                |               Robust
excess_deaths~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
covid_deaths_pc |   .9483279   .2376656     3.99   0.000     .4704692    1.426187
---------------------------------------------------------------------------------

. margins, dydx(covid_deaths_pc)

Average marginal effects                        Number of obs     =        784
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : covid_deaths_pc

---------------------------------------------------------------------------------
                |            Delta-method
                |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
covid_deaths_pc |   .9483279   .2376656     3.99   0.000     .4704692    1.426187
---------------------------------------------------------------------------------

. 
. twoway (scatter excess_deaths_pc covid_deaths_pc if days_to_report > 14, mcolor(%30) yline(0)) (fun
> ction y=x, range(0 40))

. 
. reg excess_deaths_pc covid_deaths_pc [aweight=population] if days_to_report > 14, cluster(fips)
(sum of wgt is 5,026,978,432)

Linear regression                               Number of obs     =        784
                                                F(1, 48)          =      14.67
                                                Prob > F          =     0.0004
                                                R-squared         =     0.1369
                                                Root MSE          =     10.222

                                     (Std. Err. adjusted for 49 clusters in fips)
---------------------------------------------------------------------------------
                |               Robust
excess_deaths~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
covid_deaths_pc |   .9607164   .2508164     3.83   0.000     .4564163    1.465017
          _cons |  -.1531792   .3563327    -0.43   0.669    -.8696342    .5632757
---------------------------------------------------------------------------------

. reg excess_deaths_pc c.covid_deaths_pc c.p_pos [aweight=population] if days_to_report > 14, cluster
> (fips)
(sum of wgt is 2,882,897,538)

Linear regression                               Number of obs     =        456
                                                F(2, 48)          =       7.65
                                                Prob > F          =     0.0013
                                                R-squared         =     0.5558
                                                Root MSE          =     4.6577

                                     (Std. Err. adjusted for 49 clusters in fips)
---------------------------------------------------------------------------------
                |               Robust
excess_deaths~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
covid_deaths_pc |   .9939362   .2567377     3.87   0.000     .4777304    1.510142
          p_pos |  -.0056138   .0241088    -0.23   0.817    -.0540878    .0428602
          _cons |  -.4125398   .4861501    -0.85   0.400     -1.39001    .5649304
---------------------------------------------------------------------------------

. reg excess_deaths_pc c.covid_deaths_pc##c.p_pos [aweight=population] if days_to_report > 14, cluste
> r(fips)
(sum of wgt is 2,882,897,538)

Linear regression                               Number of obs     =        456
                                                F(3, 48)          =       5.10
                                                Prob > F          =     0.0038
                                                R-squared         =     0.5609
                                                Root MSE          =      4.636

                                               (Std. Err. adjusted for 49 clusters in fips)
-------------------------------------------------------------------------------------------
                          |               Robust
         excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------------+----------------------------------------------------------------
          covid_deaths_pc |   .7303334   .6190825     1.18   0.244    -.5144153    1.975082
                    p_pos |    -.01957    .025718    -0.76   0.450    -.0712795    .0321396
                          |
c.covid_deaths_pc#c.p_pos |   .0072196   .0153042     0.47   0.639    -.0235516    .0379908
                          |
                    _cons |   .0237143   .6789269     0.03   0.972     -1.34136    1.388788
-------------------------------------------------------------------------------------------

. reg excess_deaths_pc c.covid_deaths_pc c.new_pos_pc c.new_neg_pc [aweight=population] if days_to_re
> port > 14, cluster(fips)
(sum of wgt is 2,882,897,538)

Linear regression                               Number of obs     =        456
                                                F(3, 48)          =      10.11
                                                Prob > F          =     0.0000
                                                R-squared         =     0.5642
                                                Root MSE          =     4.6184

                                     (Std. Err. adjusted for 49 clusters in fips)
---------------------------------------------------------------------------------
                |               Robust
excess_deaths~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
covid_deaths_pc |   .6899809   .4327837     1.59   0.117    -.1801891    1.560151
     new_pos_pc |   .0260361   .0212239     1.23   0.226    -.0166373    .0687096
     new_neg_pc |   .0004774   .0017595     0.27   0.787    -.0030604    .0040152
          _cons |  -1.020327   .7146671    -1.43   0.160    -2.457261    .4166079
---------------------------------------------------------------------------------

. reg excess_deaths_pc c.covid_deaths_pc##c.new_pos_pc c.covid_deaths_pc##c.new_neg_pc [aweight=popul
> ation] if days_to_report > 14, cluster(fips)
(sum of wgt is 2,882,897,538)
note: covid_deaths_pc omitted because of collinearity

Linear regression                               Number of obs     =        456
                                                F(5, 48)          =      52.36
                                                Prob > F          =     0.0000
                                                R-squared         =     0.6978
                                                Root MSE          =     3.8546

                                                    (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------------------------
                               |               Robust
              excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------------------+----------------------------------------------------------------
               covid_deaths_pc |  -1.335408   .5788573    -2.31   0.025    -2.499279   -.1715378
                    new_pos_pc |     .03219   .0131114     2.46   0.018     .0058278    .0585523
                               |
c.covid_deaths_pc#c.new_pos_pc |   .0053576   .0013063     4.10   0.000      .002731    .0079842
                               |
               covid_deaths_pc |          0  (omitted)
                    new_neg_pc |   .0001654   .0015359     0.11   0.915    -.0029227    .0032535
                               |
c.covid_deaths_pc#c.new_neg_pc |    .001039   .0006253     1.66   0.103    -.0002182    .0022962
                               |
                         _cons |   .8743182   .3401901     2.57   0.013     .1903201    1.558316
------------------------------------------------------------------------------------------------

. reg excess_deaths_pc c.covid_deaths_pc c.new_tests_pc [aweight=population] if days_to_report > 14, 
> cluster(fips)
(sum of wgt is 2,882,897,538)

Linear regression                               Number of obs     =        456
                                                F(2, 48)          =      10.24
                                                Prob > F          =     0.0002
                                                R-squared         =     0.5581
                                                Root MSE          =     4.6457

                                     (Std. Err. adjusted for 49 clusters in fips)
---------------------------------------------------------------------------------
                |               Robust
excess_deaths~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
covid_deaths_pc |   .9531367   .2744519     3.47   0.001     .4013142    1.504959
   new_tests_pc |    .001333   .0016952     0.79   0.436    -.0020754    .0047415
          _cons |  -.8644759   .6530034    -1.32   0.192    -2.177427    .4484754
---------------------------------------------------------------------------------

. reg excess_deaths_pc c.covid_deaths_pc##c.new_tests_pc [aweight=population] if days_to_report > 14,
>  cluster(fips)
(sum of wgt is 2,882,897,538)

Linear regression                               Number of obs     =        456
                                                F(3, 48)          =      11.30
                                                Prob > F          =     0.0000
                                                R-squared         =     0.6198
                                                Root MSE          =     4.3137

                                                      (Std. Err. adjusted for 49 clusters in fips)
--------------------------------------------------------------------------------------------------
                                 |               Robust
                excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------------------+----------------------------------------------------------------
                 covid_deaths_pc |   -.070662   .4715487    -0.15   0.882    -1.018774    .8774503
                    new_tests_pc |  -.0026993   .0013516    -2.00   0.051    -.0054169    .0000182
                                 |
c.covid_deaths_pc#c.new_tests_pc |   .0014992   .0006692     2.24   0.030     .0001536    .0028448
                                 |
                           _cons |   .9197695   .4166161     2.21   0.032     .0821067    1.757432
--------------------------------------------------------------------------------------------------

. reg excess_deaths_pc c.covid_deaths_pc##c.new_tests_pc c.covid_deaths_pc##c.p_pos [aweight=populati
> on] if days_to_report > 14, cluster(fips)
(sum of wgt is 2,882,897,538)
note: covid_deaths_pc omitted because of collinearity

Linear regression                               Number of obs     =        456
                                                F(5, 48)          =       9.01
                                                Prob > F          =     0.0000
                                                R-squared         =     0.6626
                                                Root MSE          =     4.0731

                                                      (Std. Err. adjusted for 49 clusters in fips)
--------------------------------------------------------------------------------------------------
                                 |               Robust
                excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------------------+----------------------------------------------------------------
                 covid_deaths_pc |  -1.463964   .8902601    -1.64   0.107    -3.253952     .326024
                    new_tests_pc |   .0000851   .0019317     0.04   0.965    -.0037988    .0039691
                                 |
c.covid_deaths_pc#c.new_tests_pc |   .0019637   .0006221     3.16   0.003      .000713    .0032145
                                 |
                 covid_deaths_pc |          0  (omitted)
                           p_pos |   .0167071   .0150609     1.11   0.273    -.0135748     .046989
                                 |
       c.covid_deaths_pc#c.p_pos |   .0246141   .0148464     1.66   0.104    -.0052366    .0544648
                                 |
                           _cons |   1.063636   .4724723     2.25   0.029     .1136664    2.013605
--------------------------------------------------------------------------------------------------

. reg excess_deaths_pc c.covid_deaths_pc##c.new_tests_pc##c.p_pos [aweight=population] if days_to_rep
> ort > 14, cluster(fips)
(sum of wgt is 2,882,897,538)

Linear regression                               Number of obs     =        456
                                                F(7, 48)          =     278.45
                                                Prob > F          =     0.0000
                                                R-squared         =     0.7028
                                                Root MSE          =     3.8312

                                                       (Std. Err. adjusted for 49 clusters in fips)
---------------------------------------------------------------------------------------------------
                                  |               Robust
                 excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------------------+----------------------------------------------------------------
                  covid_deaths_pc |  -.8345088    .902842    -0.92   0.360    -2.649794    .9807767
                     new_tests_pc |   .0015116   .0017774     0.85   0.399    -.0020621    .0050852
                                  |
 c.covid_deaths_pc#c.new_tests_pc |     .00042   .0008042     0.52   0.604     -.001197    .0020371
                                  |
                            p_pos |   .0338171   .0166689     2.03   0.048     .0003019    .0673322
                                  |
        c.covid_deaths_pc#c.p_pos |  -.0174531    .010064    -1.73   0.089    -.0376881    .0027818
                                  |
           c.new_tests_pc#c.p_pos |   .0002647   .0001557     1.70   0.095    -.0000482    .0005777
                                  |
 c.covid_deaths_pc#c.new_tests_pc#|
                          c.p_pos |   .0000662   .0000134     4.93   0.000     .0000392    .0000932
                                  |
                            _cons |   .0556243    .609227     0.09   0.928    -1.169309    1.280557
---------------------------------------------------------------------------------------------------

. 
. gen covid_deaths_pcXp_pos = covid_deaths_pc * p_pos
(18,460 missing values generated)

. reghv excess_deaths_pc covid_deaths_pc p_pos covid_deaths_pcXp_pos if days_to_report > 14, var( new
> _tests_pc covid_deaths_pc population) twostage cluster(fips)

Multiplicative heteroscedastic regression             Number of obs  =     456
Estimator: 2sls                                       Model chi2(6)  =-248.612
                                                      Prob > chi2    =   1.000
Log Likelihood              = -1597.120               Pseudo R2      = -0.0844
                                                      VWLS R2        =  0.0136
                                  (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
excess_dea~c |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
lp_mean      |
covid_deat~c |   .4946588   .3384953     1.46   0.144    -.1687798    1.158097
       p_pos |   -.000788   .0172964    -0.05   0.964    -.0346882    .0331122
covid_dea~os |   .0082258   .0105146     0.78   0.434    -.0123824     .028834
       _cons |   -.510603   .4501895    -1.13   0.257    -1.392958    .3717522
-------------+----------------------------------------------------------------
lp_lnvar     |
new_tests_pc |   .0005845   .0039448     0.15   0.882    -.0071472    .0083162
covid_deat~c |   .2043757    .191686     1.07   0.286    -.1713219    .5800734
  population |  -1.67e-08   3.44e-07    -0.05   0.961    -6.91e-07    6.57e-07
       _cons |   1.452861   6.588122     0.22   0.825    -11.45962    14.36534
------------------------------------------------------------------------------

. reghv excess_deaths_pc covid_deaths_pc p_pos covid_deaths_pcXp_pos if days_to_report > 14, var( new
> _tests_pc covid_deaths_pc population) cluster(fips)

iteration 1:  Log-likelihood =     -1344  |delta-b|     2.113 [step half]
iteration 2:  Log-likelihood =     -1329  |delta-b|     .7089 
iteration 3:  Log-likelihood =     -1325  |delta-b|     .2842 
iteration 4:  Log-likelihood =     -1324  |delta-b|     .1887 
iteration 5:  Log-likelihood =     -1324  |delta-b|     .0574 
iteration 6:  Log-likelihood =     -1324  |delta-b|    .03561 
iteration 7:  Log-likelihood =     -1324  |delta-b|    .01987 
iteration 8:  Log-likelihood =     -1324  |delta-b|    .01094 
iteration 9:  Log-likelihood =     -1324  |delta-b|   .006423 
iteration 10:  Log-likelihood =     -1324  |delta-b|   .003497 
iteration 11:  Log-likelihood =     -1324  |delta-b|   .002073 
iteration 12:  Log-likelihood =     -1324  |delta-b|   .001127 
iteration 13:  Log-likelihood =     -1324  |delta-b|  .0006686 
iteration 14:  Log-likelihood =     -1324  |delta-b|  .0003639 
iteration 15:  Log-likelihood =     -1324  |delta-b|  .0002157 
iteration 16:  Log-likelihood =     -1324  |delta-b|  .0001176 

Multiplicative heteroscedastic regression             Number of obs  =     456
Estimator: mle                                        Model chi2(6)  = 298.477
                                                      Prob > chi2    =   0.000
Log Likelihood              = -1323.575               Pseudo R2      =  0.1013
                                                      VWLS R2        =  0.0353
                                  (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
excess_dea~c |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
lp_mean      |
covid_deat~c |   .6272543   .2690377     2.33   0.020       .09995    1.154559
       p_pos |   .0297542   .0153848     1.93   0.053    -.0003994    .0599079
covid_dea~os |  -.0108331   .0092406    -1.17   0.241    -.0289443    .0072781
       _cons |  -.0330868   .3809289    -0.09   0.931    -.7796937      .71352
-------------+----------------------------------------------------------------
lp_lnvar     |
new_tests_pc |   -.000368   .0006502    -0.57   0.571    -.0016425    .0009064
covid_deat~c |   .2325598   .0476402     4.88   0.000     .1391866    .3259329
  population |  -9.07e-08   3.83e-08    -2.37   0.018    -1.66e-07   -1.57e-08
       _cons |   3.176091   .7570462     4.20   0.000     1.692307    4.659874
------------------------------------------------------------------------------

. drop covid_deaths_pcXp_pos

. 
. 
. 
. reg deathincrease_pc adj_covid_deaths_pc [aweight=population] if days_to_report > 7, cluster(fips)
(sum of wgt is 3,801,415,786)

Linear regression                               Number of obs     =        592
                                                F(1, 48)          =     867.50
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9323
                                                Root MSE          =     1.0838

                                         (Std. Err. adjusted for 49 clusters in fips)
-------------------------------------------------------------------------------------
                    |               Robust
   deathincrease_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
adj_covid_deaths_pc |   .8315796   .0282337    29.45   0.000     .7748119    .8883473
              _cons |   .2429756   .0588505     4.13   0.000     .1246488    .3613024
-------------------------------------------------------------------------------------

. reg deathincrease_pc adj_covid_deaths_pc l.adj_covid_deaths_pc [aweight=population] if days_to_repo
> rt > 7, cluster(fips)
(sum of wgt is 3,793,800,893)

Linear regression                               Number of obs     =        591
                                                F(2, 48)          =    1208.18
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9564
                                                Root MSE          =     .87142

                                         (Std. Err. adjusted for 49 clusters in fips)
-------------------------------------------------------------------------------------
                    |               Robust
   deathincrease_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
adj_covid_deaths_pc |
                --. |   .5535269   .0933377     5.93   0.000     .3658589     .741195
                L1. |   .3074855   .1236656     2.49   0.016     .0588393    .5561318
                    |
              _cons |   .2176105   .0456799     4.76   0.000     .1257649    .3094561
-------------------------------------------------------------------------------------

. reg deathincrease_pc c.adj_covid_deaths_pc##c.p_pos [aweight=population] if days_to_report > 7, clu
> ster(fips)
(sum of wgt is 3,197,083,690)

Linear regression                               Number of obs     =        505
                                                F(3, 48)          =     309.34
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9493
                                                Root MSE          =     .99465

                                                   (Std. Err. adjusted for 49 clusters in fips)
-----------------------------------------------------------------------------------------------
                              |               Robust
             deathincrease_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
          adj_covid_deaths_pc |   1.131566   .0503184    22.49   0.000     1.030395    1.232738
                        p_pos |  -.0051762   .0033421    -1.55   0.128     -.011896    .0015436
                              |
c.adj_covid_deaths_pc#c.p_pos |  -.0079359   .0006094   -13.02   0.000    -.0091612   -.0067105
                              |
                        _cons |   .0366908   .0606787     0.60   0.548    -.0853119    .1586934
-----------------------------------------------------------------------------------------------

. reg deathincrease_pc c.adj_covid_deaths_pc##c.new_tests_pc [aweight=population] if days_to_report >
>  7, cluster(fips)
(sum of wgt is 3,197,083,690)

Linear regression                               Number of obs     =        505
                                                F(3, 48)          =     340.41
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9400
                                                Root MSE          =      1.083

                                            (Std. Err. adjusted for 49 clusters in fips)
----------------------------------------------------------------------------------------
                       |               Robust
      deathincrease_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------+----------------------------------------------------------------
   adj_covid_deaths_pc |   .7645615   .0473192    16.16   0.000     .6694199    .8597031
          new_tests_pc |   .0013985   .0002622     5.33   0.000     .0008713    .0019257
                       |
 c.adj_covid_deaths_pc#|
        c.new_tests_pc |   .0000345   .0000586     0.59   0.559    -.0000833    .0001523
                       |
                 _cons |  -.1584676   .0657871    -2.41   0.020    -.2907415   -.0261936
----------------------------------------------------------------------------------------

. reg deathincrease_pc c.adj_covid_deaths_pc##c.new_tests_pc c.l.adj_covid_deaths_pc##c.new_tests_pc 
> [aweight=population] if days_to_report > 7, cluster(fips)
(sum of wgt is 3,197,083,690)
note: new_tests_pc omitted because of collinearity

Linear regression                               Number of obs     =        505
                                                F(5, 48)          =    1298.52
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9607
                                                Root MSE          =     .87841

                                             (Std. Err. adjusted for 49 clusters in fips)
-----------------------------------------------------------------------------------------
                        |               Robust
       deathincrease_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
    adj_covid_deaths_pc |   .3292689   .1288008     2.56   0.014     .0702976    .5882402
           new_tests_pc |   .0012299   .0002757     4.46   0.000     .0006755    .0017843
                        |
  c.adj_covid_deaths_pc#|
         c.new_tests_pc |   .0003066   .0001815     1.69   0.098    -.0000584    .0006716
                        |
    adj_covid_deaths_pc |
                    L1. |   .5668507   .1053604     5.38   0.000     .3550094     .778692
                        |
           new_tests_pc |          0  (omitted)
                        |
 cL.adj_covid_deaths_pc#|
         c.new_tests_pc |  -.0003913   .0001863    -2.10   0.041    -.0007659   -.0000167
                        |
                  _cons |  -.1274681   .0605897    -2.10   0.041    -.2492918   -.0056444
-----------------------------------------------------------------------------------------

. reg deathincrease_pc c.excess_deaths_pc##c.new_tests_pc c.l.excess_deaths_pc##c.new_tests_pc [aweig
> ht=population] if days_to_report > 7, cluster(fips)
(sum of wgt is 3,197,083,690)
note: new_tests_pc omitted because of collinearity

Linear regression                               Number of obs     =        505
                                                F(5, 48)          =      93.27
                                                Prob > F          =     0.0000
                                                R-squared         =     0.6048
                                                Root MSE          =      2.784

                                                        (Std. Err. adjusted for 49 clusters in fips)
----------------------------------------------------------------------------------------------------
                                   |               Robust
                  deathincrease_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------------------+----------------------------------------------------------------
                  excess_deaths_pc |   .0241034   .2008804     0.12   0.905    -.3797937    .4280006
                      new_tests_pc |   .0016687   .0013487     1.24   0.222     -.001043    .0043805
                                   |
 c.excess_deaths_pc#c.new_tests_pc |   .0005104    .000273     1.87   0.068    -.0000385    .0010593
                                   |
                  excess_deaths_pc |
                               L1. |   .1224029   .1797987     0.68   0.499    -.2391066    .4839123
                                   |
                      new_tests_pc |          0  (omitted)
                                   |
cL.excess_deaths_pc#c.new_tests_pc |  -.0000789   .0001693    -0.47   0.643    -.0004194    .0002615
                                   |
                             _cons |   .8377148   .5492799     1.53   0.134    -.2666866    1.942116
----------------------------------------------------------------------------------------------------

. 
. 
. reg excess_deaths_pc covid_deaths_pc [aweight=population] if days_to_report > 14, cluster(fips)
(sum of wgt is 5,026,978,432)

Linear regression                               Number of obs     =        784
                                                F(1, 48)          =      14.67
                                                Prob > F          =     0.0004
                                                R-squared         =     0.1369
                                                Root MSE          =     10.222

                                     (Std. Err. adjusted for 49 clusters in fips)
---------------------------------------------------------------------------------
                |               Robust
excess_deaths~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
covid_deaths_pc |   .9607164   .2508164     3.83   0.000     .4564163    1.465017
          _cons |  -.1531792   .3563327    -0.43   0.669    -.8696342    .5632757
---------------------------------------------------------------------------------

. reg excess_respir_deaths_pc covid_deaths_pc [aweight=population] if days_to_report > 14, cluster(fi
> ps)
(sum of wgt is 4,712,792,280)

Linear regression                               Number of obs     =        735
                                                F(1, 48)          >   99999.00
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9962
                                                Root MSE          =     .27845

                                     (Std. Err. adjusted for 49 clusters in fips)
---------------------------------------------------------------------------------
                |               Robust
excess_respir~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
covid_deaths_pc |   1.047836   .0032665   320.78   0.000     1.041268    1.054403
          _cons |   .0492644   .0255496     1.93   0.060    -.0021065    .1006353
---------------------------------------------------------------------------------

. 
. reg excess_deaths_pc c.covid_deaths_pc##c.p_pos [aweight=population] if days_to_report > 14, cluste
> r(fips)
(sum of wgt is 2,882,897,538)

Linear regression                               Number of obs     =        456
                                                F(3, 48)          =       5.10
                                                Prob > F          =     0.0038
                                                R-squared         =     0.5609
                                                Root MSE          =      4.636

                                               (Std. Err. adjusted for 49 clusters in fips)
-------------------------------------------------------------------------------------------
                          |               Robust
         excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------------+----------------------------------------------------------------
          covid_deaths_pc |   .7303334   .6190825     1.18   0.244    -.5144153    1.975082
                    p_pos |    -.01957    .025718    -0.76   0.450    -.0712795    .0321396
                          |
c.covid_deaths_pc#c.p_pos |   .0072196   .0153042     0.47   0.639    -.0235516    .0379908
                          |
                    _cons |   .0237143   .6789269     0.03   0.972     -1.34136    1.388788
-------------------------------------------------------------------------------------------

. reg excess_deaths_pc c.covid_deaths_pc##c.p_pos c.covid_deaths_pc##c.end_week [aweight=population] 
> if days_to_report > 14, cluster(fips)
(sum of wgt is 2,882,897,538)
note: covid_deaths_pc omitted because of collinearity

Linear regression                               Number of obs     =        456
                                                F(5, 48)          =       8.26
                                                Prob > F          =     0.0000
                                                R-squared         =     0.5626
                                                Root MSE          =     4.6375

                                                  (Std. Err. adjusted for 49 clusters in fips)
----------------------------------------------------------------------------------------------
                             |               Robust
            excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
             covid_deaths_pc |   95.44357   244.4706     0.39   0.698    -396.0974    586.9846
                       p_pos |  -.0257852   .0295182    -0.87   0.387    -.0851354     .033565
                             |
   c.covid_deaths_pc#c.p_pos |   .0038481   .0139476     0.28   0.784    -.0241955    .0318917
                             |
             covid_deaths_pc |          0  (omitted)
                    end_week |  -.0093685   .0192148    -0.49   0.628    -.0480024    .0292655
                             |
c.covid_deaths_pc#c.end_week |  -.0042943   .0110924    -0.39   0.700    -.0265971    .0180086
                             |
                       _cons |   206.3151   422.8286     0.49   0.628    -643.8388    1056.469
----------------------------------------------------------------------------------------------

. reg excess_respir_deaths_pc c.covid_deaths_pc##c.p_pos [aweight=population] if days_to_report > 14,
>  cluster(fips)
(sum of wgt is 2,568,711,386)

Linear regression                               Number of obs     =        407
                                                F(3, 48)          =   33863.60
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9977
                                                Root MSE          =     .27937

                                               (Std. Err. adjusted for 49 clusters in fips)
-------------------------------------------------------------------------------------------
                          |               Robust
  excess_respir_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------------+----------------------------------------------------------------
          covid_deaths_pc |   .9633784    .017732    54.33   0.000     .9277258    .9990309
                    p_pos |   .0043545    .002018     2.16   0.036      .000297    .0084121
                          |
c.covid_deaths_pc#c.p_pos |   .0019455   .0004914     3.96   0.000     .0009574    .0029336
                          |
                    _cons |   .1095424   .0455237     2.41   0.020     .0180109    .2010739
-------------------------------------------------------------------------------------------

. reg excess_respir_deaths_pc c.covid_deaths_pc##c.p_pos c.covid_deaths_pc##c.end_week [aweight=popul
> ation] if days_to_report > 14, cluster(fips)
(sum of wgt is 2,568,711,386)
note: covid_deaths_pc omitted because of collinearity

Linear regression                               Number of obs     =        407
                                                F(5, 48)          =   59662.02
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9982
                                                Root MSE          =      .2474

                                                  (Std. Err. adjusted for 49 clusters in fips)
----------------------------------------------------------------------------------------------
                             |               Robust
     excess_respir_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
             covid_deaths_pc |   55.34647   12.93803     4.28   0.000     29.33282    81.36011
                       p_pos |   .0026587   .0021609     1.23   0.225     -.001686    .0070034
                             |
   c.covid_deaths_pc#c.p_pos |   .0003331   .0003336     1.00   0.323    -.0003376    .0010038
                             |
             covid_deaths_pc |          0  (omitted)
                    end_week |  -.0031117   .0012575    -2.47   0.017      -.00564   -.0005834
                             |
c.covid_deaths_pc#c.end_week |  -.0024664   .0005873    -4.20   0.000    -.0036473   -.0012856
                             |
                       _cons |   68.59965   27.69741     2.48   0.017     12.91029     124.289
----------------------------------------------------------------------------------------------

. reg excess_deaths_pc c.excess_respir_deaths_pc##c.p_pos [aweight=population] if days_to_report > 14
> , cluster(fips)
(sum of wgt is 2,568,711,386)

Linear regression                               Number of obs     =        407
                                                F(3, 48)          =       5.53
                                                Prob > F          =     0.0024
                                                R-squared         =     0.5838
                                                Root MSE          =      4.704

                                                       (Std. Err. adjusted for 49 clusters in fips)
---------------------------------------------------------------------------------------------------
                                  |               Robust
                 excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------------------+----------------------------------------------------------------
          excess_respir_deaths_pc |   .7550562    .626946     1.20   0.234    -.5055033    2.015616
                            p_pos |  -.0130169   .0268876    -0.48   0.631     -.067078    .0410443
                                  |
c.excess_respir_deaths_pc#c.p_pos |   .0054978   .0148778     0.37   0.713     -.024416    .0354115
                                  |
                            _cons |  -.4203856   .7354355    -0.57   0.570    -1.899078    1.058307
---------------------------------------------------------------------------------------------------

. reg excess_deaths_pc c.excess_respir_deaths_pc##c.p_pos c.covid_deaths_pc##c.end_week [aweight=popu
> lation] if days_to_report > 14, cluster(fips)
(sum of wgt is 2,568,711,386)

Linear regression                               Number of obs     =        407
                                                F(6, 48)          =      13.49
                                                Prob > F          =     0.0000
                                                R-squared         =     0.5912
                                                Root MSE          =     4.6793

                                                       (Std. Err. adjusted for 49 clusters in fips)
---------------------------------------------------------------------------------------------------
                                  |               Robust
                 excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------------------+----------------------------------------------------------------
          excess_respir_deaths_pc |   1.363931   1.178393     1.16   0.253    -1.005388    3.733249
                            p_pos |  -.0300183   .0318969    -0.94   0.351    -.0941512    .0341147
                                  |
c.excess_respir_deaths_pc#c.p_pos |   .0015009   .0129177     0.12   0.908    -.0244718    .0274736
                                  |
                  covid_deaths_pc |   37.99566   265.9897     0.14   0.887    -496.8124    572.8038
                         end_week |  -.0357799    .024106    -1.48   0.144    -.0842483    .0126885
                                  |
     c.covid_deaths_pc#c.end_week |   -.001745   .0120461    -0.14   0.885    -.0259654    .0224754
                                  |
                            _cons |    787.349     530.41     1.48   0.144    -279.1119     1853.81
---------------------------------------------------------------------------------------------------

. 
. reg f.adj_excess_deaths_pc c.new_pos_pc##c.p_pos [aweight=population] if days_to_report > 14, clust
> er(fips)
(sum of wgt is 2,882,897,538)

Linear regression                               Number of obs     =        456
                                                F(3, 48)          =       8.78
                                                Prob > F          =     0.0001
                                                R-squared         =     0.5726
                                                Root MSE          =     4.7487

                                          (Std. Err. adjusted for 49 clusters in fips)
--------------------------------------------------------------------------------------
F.                   |               Robust
adj_excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
          new_pos_pc |   .0265282   .0271625     0.98   0.334    -.0280856    .0811421
               p_pos |  -.0662421   .0380718    -1.74   0.088    -.1427906    .0103064
                     |
c.new_pos_pc#c.p_pos |   .0016673   .0008759     1.90   0.063    -.0000939    .0034284
                     |
               _cons |   .9477745   .6768085     1.40   0.168    -.4130403    2.308589
--------------------------------------------------------------------------------------

. reg f.adj_excess_respir_deaths_pc c.new_pos_pc##c.p_pos [aweight=population] if days_to_report > 14
> , cluster(fips)
(sum of wgt is 2,254,525,234)

Linear regression                               Number of obs     =        358
                                                F(3, 48)          =     319.10
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9268
                                                Root MSE          =     1.6693

                                          (Std. Err. adjusted for 49 clusters in fips)
--------------------------------------------------------------------------------------
F.                   |               Robust
adj_excess_respir_~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
          new_pos_pc |   .0337343   .0118064     2.86   0.006     .0099959    .0574727
               p_pos |   .0140555   .0093179     1.51   0.138    -.0046793    .0327904
                     |
c.new_pos_pc#c.p_pos |   .0012325   .0003729     3.30   0.002     .0004827    .0019824
                     |
               _cons |   .3148185   .2555957     1.23   0.224    -.1990912    .8287281
--------------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  C:\Users\favero\Documents\GitHub\covid-underreporting\code\..\logs\cleandata.txt
  log type:  text
 closed on:   5 Jun 2020, 16:19:25
-----------------------------------------------------------------------------------------------------
