--------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\favero\Documents\GitHub\covid-underreporting\code\..\logs\cleandata.txt
  log type:  text
 opened on:   9 May 2020, 14:35:32

. 
. use "..\data\population.dta" // start from this file because it has both fips codes and state names

. 
. merge 1:m fips using "..\data\covidtracking.dta", keep(2 3)

    Result                           # of obs.
    -----------------------------------------
    not matched                           270
        from master                         0  (_merge==1)
        from using                        270  (_merge==2)

    matched                             3,331  (_merge==3)
    -----------------------------------------

. drop _merge population // merge population back in later because want it merged to all observations, even those missing 
> from the current dataset

. 
. merge 1:1 state date using "..\data\cdc_deaths.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                         3,417
        from master                     3,138  (_merge==1)
        from using                        279  (_merge==2)

    matched                               463  (_merge==3)
    -----------------------------------------

. drop _merge

. 
. drop fips

. merge m:1 state using "..\data\population.dta", keep(1 3)

    Result                           # of obs.
    -----------------------------------------
    not matched                           298
        from master                       298  (_merge==1)
        from using                          0  (_merge==2)

    matched                             3,582  (_merge==3)
    -----------------------------------------

. drop _merge

. order date fips

. sort fips state date

. 
. drop if fips > 56
(298 observations deleted)

. 
. encode dataqualitygrade, gen(datagrade)

. order datagrade, after(dataqualitygrade)

. drop dataqualitygrade

. 
. gen end_week = date + mod(6 - dow(date), 7)

. format end_week %tdCCYYNNDD

. order end_week, after(date)

. 
. foreach var of varlist positive-datagrade death-pneumon_influ_and_covid {
  2.         gen `var'_mis = (`var'==.)
  3. }

. collapse (firstnm) state report_date (lastnm) positive-datagrade (sum) death-pneumon_influ_and_covid population *_mis, b
> y(end_week fips)

. foreach var of varlist positive-datagrade {
  2.         replace `var' = . if `var'_mis > 0
  3. }
(0 real changes made)
(16 real changes made, 16 to missing)
(50 real changes made, 50 to missing)
(46 real changes made, 46 to missing)
(47 real changes made, 47 to missing)
(29 real changes made, 29 to missing)
(17 real changes made, 17 to missing)
(26 real changes made, 26 to missing)
(12 real changes made, 12 to missing)
(42 real changes made, 42 to missing)
(51 real changes made, 51 to missing)

. foreach var of varlist death-pneumon_influ_and_covid {
  2.         replace `var' = . if `var'_mis > 6 | report_date == .
  3. }
(109 real changes made, 109 to missing)
(269 real changes made, 269 to missing)
(52 real changes made, 52 to missing)
(52 real changes made, 52 to missing)
(52 real changes made, 52 to missing)
(52 real changes made, 52 to missing)
(52 real changes made, 52 to missing)
(52 real changes made, 52 to missing)
(52 real changes made, 52 to missing)
(52 real changes made, 52 to missing)
(168 real changes made, 168 to missing)
(53 real changes made, 53 to missing)
(61 real changes made, 61 to missing)
(100 real changes made, 100 to missing)
(196 real changes made, 196 to missing)
(269 real changes made, 269 to missing)
(88 real changes made, 88 to missing)

. drop *_mis

. 
. xtset fips end_week, delta(7)
       panel variable:  fips (unbalanced)
        time variable:  end_week, 20200125 to 20200509
                delta:  7 days

. 
. gen new_pos = d.positive if d.positive>=0
(302 missing values generated)

. gen new_neg = d.negative if d.negative>=0
(344 missing values generated)

. gen p_pos = new_pos/(new_pos+new_neg)*100
(344 missing values generated)

. order new_pos-p_pos, after(negative)

. 
. // adjust expected deaths for reporting lag: https://www.cdc.gov/nchs/data/vsrr/report001.pdf
. // maybe also somehow adjust for how the individual state was doing relative to expectations pre-covid
. gen days_to_report = report_date - end_week
(52 missing values generated)

. 
. gen feb_adj_expected_deaths = .
(766 missing values generated)

. replace feb_adj_expected_deaths = expected_deaths * 79.7 / 100 if days_to_report > 9*7+3 & days_to_report <= 10*7+3 & mo
> nth(end_week)==2
(51 real changes made)

. replace feb_adj_expected_deaths = expected_deaths * 81.4 / 100 if days_to_report > 10*7+3 & days_to_report <= 11*7+3 & m
> onth(end_week)==2
(51 real changes made)

. replace feb_adj_expected_deaths = expected_deaths * 82.8 / 100 if days_to_report > 11*7+3 & days_to_report <= 12*7+3 & m
> onth(end_week)==2
(51 real changes made)

. replace feb_adj_expected_deaths = expected_deaths * 83.9 / 100 if days_to_report > 12*7+3 & days_to_report <= 13*7+3 & m
> onth(end_week)==2
(51 real changes made)

. replace feb_adj_expected_deaths = expected_deaths * 84.9 / 100 if days_to_report > 13*7+3 & days_to_report <= 14*7+3 & m
> onth(end_week)==2
(51 real changes made)

. replace feb_adj_expected_deaths = expected_deaths * 86.0 / 100 if days_to_report > 14*7+3 & days_to_report <= 15*7+3 & m
> onth(end_week)==2
(0 real changes made)

. replace feb_adj_expected_deaths = expected_deaths * 86.9 / 100 if days_to_report > 15*7+3 & days_to_report <= 16*7+3 & m
> onth(end_week)==2
(0 real changes made)

. replace feb_adj_expected_deaths = expected_deaths * 88.0 / 100 if days_to_report > 16*7+3 & days_to_report <= 17*7+3 & m
> onth(end_week)==2
(0 real changes made)

. replace feb_adj_expected_deaths = expected_deaths * 89.3 / 100 if days_to_report > 17*7+3 & days_to_report <= 18*7+3 & m
> onth(end_week)==2
(0 real changes made)

. replace feb_adj_expected_deaths = expected_deaths * 90.3 / 100 if days_to_report > 18*7+3 & days_to_report <= 19*7+3 & m
> onth(end_week)==2
(0 real changes made)

. replace feb_adj_expected_deaths = expected_deaths * 91.3 / 100 if days_to_report > 19*7+3 & days_to_report <= 20*7+3 & m
> onth(end_week)==2
(0 real changes made)

. replace feb_adj_expected_deaths = expected_deaths * 92.2 / 100 if days_to_report > 20*7+3 & days_to_report <= 21*7+3 & m
> onth(end_week)==2
(0 real changes made)

. replace feb_adj_expected_deaths = expected_deaths * 93.1 / 100 if days_to_report > 21*7+3 & days_to_report <= 22*7+3 & m
> onth(end_week)==2
(0 real changes made)

. replace feb_adj_expected_deaths = expected_deaths * 93.8 / 100 if days_to_report > 22*7+3 & days_to_report <= 23*7+3 & m
> onth(end_week)==2
(0 real changes made)

. 
. gen relative_st_deaths = total_deaths / feb_adj_expected_deaths if month(end_week)==2
(511 missing values generated)

. egen st_expected_death_adj = mean(relative_st_deaths), by(fips)

. 
. gen adj_expected_deaths = .
(766 missing values generated)

. replace adj_expected_deaths = expected_deaths * st_expected_death_adj * 4.8 / 100 if days_to_report <= 1*7+3 & days_to_r
> eport != .
(48 real changes made)

. replace adj_expected_deaths = expected_deaths * st_expected_death_adj * 27.2 / 100 if days_to_report > 1*7+3 & days_to_r
> eport <= 2*7+3
(49 real changes made)

. replace adj_expected_deaths = expected_deaths * st_expected_death_adj * 43.8 / 100 if days_to_report > 2*7+3 & days_to_r
> eport <= 3*7+3
(50 real changes made)

. replace adj_expected_deaths = expected_deaths * st_expected_death_adj * 54.1 / 100 if days_to_report > 3*7+3 & days_to_r
> eport <= 4*7+3
(50 real changes made)

. replace adj_expected_deaths = expected_deaths * st_expected_death_adj * 61.9 / 100 if days_to_report > 4*7+3 & days_to_r
> eport <= 5*7+3
(51 real changes made)

. replace adj_expected_deaths = expected_deaths * st_expected_death_adj * 67.0 / 100 if days_to_report > 5*7+3 & days_to_r
> eport <= 6*7+3
(51 real changes made)

. replace adj_expected_deaths = expected_deaths * st_expected_death_adj * 71.0 / 100 if days_to_report > 6*7+3 & days_to_r
> eport <= 7*7+3
(50 real changes made)

. replace adj_expected_deaths = expected_deaths * st_expected_death_adj * 74.5 / 100 if days_to_report > 7*7+3 & days_to_r
> eport <= 8*7+3
(50 real changes made)

. replace adj_expected_deaths = expected_deaths * st_expected_death_adj * 77.4 / 100 if days_to_report > 8*7+3 & days_to_r
> eport <= 9*7+3
(51 real changes made)

. replace adj_expected_deaths = expected_deaths * st_expected_death_adj * 79.7 / 100 if days_to_report > 9*7+3 & days_to_r
> eport <= 10*7+3
(51 real changes made)

. replace adj_expected_deaths = expected_deaths * st_expected_death_adj * 81.4 / 100 if days_to_report > 10*7+3 & days_to_
> report <= 11*7+3
(51 real changes made)

. replace adj_expected_deaths = expected_deaths * st_expected_death_adj * 82.8 / 100 if days_to_report > 11*7+3 & days_to_
> report <= 12*7+3
(51 real changes made)

. replace adj_expected_deaths = expected_deaths * st_expected_death_adj * 83.9 / 100 if days_to_report > 12*7+3 & days_to_
> report <= 13*7+3
(51 real changes made)

. replace adj_expected_deaths = expected_deaths * st_expected_death_adj * 84.9 / 100 if days_to_report > 13*7+3 & days_to_
> report <= 14*7+3
(51 real changes made)

. replace adj_expected_deaths = expected_deaths * st_expected_death_adj * 86.0 / 100 if days_to_report > 14*7+3 & days_to_
> report <= 15*7+3
(0 real changes made)

. replace adj_expected_deaths = expected_deaths * st_expected_death_adj * 86.9 / 100 if days_to_report > 15*7+3 & days_to_
> report <= 16*7+3
(0 real changes made)

. replace adj_expected_deaths = expected_deaths * st_expected_death_adj * 88.0 / 100 if days_to_report > 16*7+3 & days_to_
> report <= 17*7+3
(0 real changes made)

. replace adj_expected_deaths = expected_deaths * st_expected_death_adj * 89.3 / 100 if days_to_report > 17*7+3 & days_to_
> report <= 18*7+3
(0 real changes made)

. replace adj_expected_deaths = expected_deaths * st_expected_death_adj * 90.3 / 100 if days_to_report > 18*7+3 & days_to_
> report <= 19*7+3
(0 real changes made)

. replace adj_expected_deaths = expected_deaths * st_expected_death_adj * 91.3 / 100 if days_to_report > 19*7+3 & days_to_
> report <= 20*7+3
(0 real changes made)

. replace adj_expected_deaths = expected_deaths * st_expected_death_adj * 92.2 / 100 if days_to_report > 20*7+3 & days_to_
> report <= 21*7+3
(0 real changes made)

. replace adj_expected_deaths = expected_deaths * st_expected_death_adj * 93.1 / 100 if days_to_report > 21*7+3 & days_to_
> report <= 22*7+3
(0 real changes made)

. replace adj_expected_deaths = expected_deaths * st_expected_death_adj * 93.8 / 100 if days_to_report > 22*7+3 & days_to_
> report <= 23*7+3
(0 real changes made)

. 
. egen cumulative_covdeath = sum(covid_deaths), by(fips)

. 
. gen covdeath_pc = covid_deaths*1000000/population
(168 missing values generated)

. gen excess_deaths_pc = (total_deaths-adj_expected_deaths)*1000000/population
(61 missing values generated)

. 
. gen log_covdeath = log(covid_deaths)
(555 missing values generated)

.         //replace log_covdeath = 2 if covid_deaths==0
. gen log_allcause = log(total_deaths)
(62 missing values generated)

. gen log_expected = log(adj_expected_deaths)
(62 missing values generated)

. gen excess_deaths = log_allcause-log_expected
(62 missing values generated)

. 
. 
. reg excess_deaths c.log_covdeath c.p_pos if days_to_report > 14

      Source |       SS           df       MS      Number of obs   =       150
-------------+----------------------------------   F(2, 147)       =     28.18
       Model |  7.38986277         2  3.69493139   Prob > F        =    0.0000
    Residual |  19.2767358       147  .131134257   R-squared       =    0.2771
-------------+----------------------------------   Adj R-squared   =    0.2673
       Total |  26.6665986       149   .17897046   Root MSE        =    .36212

------------------------------------------------------------------------------
excess_dea~s |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
log_covdeath |   .1624941   .0242116     6.71   0.000     .1146462    .2103419
       p_pos |   .0000707   .0025042     0.03   0.978    -.0048781    .0050195
       _cons |  -.2658119   .1021055    -2.60   0.010    -.4675962   -.0640276
------------------------------------------------------------------------------

. reg excess_deaths c.log_covdeath##c.p_pos if days_to_report > 14

      Source |       SS           df       MS      Number of obs   =       150
-------------+----------------------------------   F(3, 146)       =     30.04
       Model |  10.1782217         3  3.39274058   Prob > F        =    0.0000
    Residual |  16.4883769       146  .112934088   R-squared       =    0.3817
-------------+----------------------------------   Adj R-squared   =    0.3690
       Total |  26.6665986       149   .17897046   Root MSE        =    .33606

----------------------------------------------------------------------------------------
         excess_deaths |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------+----------------------------------------------------------------
          log_covdeath |   .0011985   .0394785     0.03   0.976    -.0768248    .0792217
                 p_pos |  -.0285257   .0062065    -4.60   0.000    -.0407919   -.0162594
                       |
c.log_covdeath#c.p_pos |   .0064656   .0013012     4.97   0.000      .003894    .0090372
                       |
                 _cons |   .3997491   .1640725     2.44   0.016      .075485    .7240131
----------------------------------------------------------------------------------------

. 
. reg excess_deaths c.log_covdeath c.p_pos if days_to_report > 14 & excess_deaths > 0

      Source |       SS           df       MS      Number of obs   =       146
-------------+----------------------------------   F(2, 143)       =     80.78
       Model |  7.64423331         2  3.82211666   Prob > F        =    0.0000
    Residual |  6.76646568       143  .047317942   R-squared       =    0.5305
-------------+----------------------------------   Adj R-squared   =    0.5239
       Total |   14.410699       145  .099384131   Root MSE        =    .21753

------------------------------------------------------------------------------
excess_dea~s |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
log_covdeath |   .1474358   .0146255    10.08   0.000     .1185258    .1763459
       p_pos |   .0036843    .001529     2.41   0.017     .0006618    .0067067
       _cons |  -.2139745   .0615717    -3.48   0.001    -.3356829   -.0922661
------------------------------------------------------------------------------

. reg excess_deaths c.log_covdeath##c.p_pos if days_to_report > 14 & excess_deaths > 0

      Source |       SS           df       MS      Number of obs   =       146
-------------+----------------------------------   F(3, 142)       =    102.54
       Model |  9.85935499         3  3.28645166   Prob > F        =    0.0000
    Residual |    4.551344       142  .032051718   R-squared       =    0.6842
-------------+----------------------------------   Adj R-squared   =    0.6775
       Total |   14.410699       145  .099384131   Root MSE        =    .17903

----------------------------------------------------------------------------------------
         excess_deaths |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------+----------------------------------------------------------------
          log_covdeath |   .0039579   .0210419     0.19   0.851    -.0376379    .0455537
                 p_pos |  -.0219321   .0033284    -6.59   0.000    -.0285118   -.0153524
                       |
c.log_covdeath#c.p_pos |    .005774   .0006945     8.31   0.000      .004401     .007147
                       |
                 _cons |   .3783545   .0874336     4.33   0.000     .2055148    .5511943
----------------------------------------------------------------------------------------

. 
. reg excess_deaths c.log_covdeath c.p_pos [aweight=population] if days_to_report > 14
(sum of wgt is 8,942,683,309)

      Source |       SS           df       MS      Number of obs   =       150
-------------+----------------------------------   F(2, 147)       =     69.26
       Model |  12.3663301         2  6.18316504   Prob > F        =    0.0000
    Residual |    13.12357       147  .089275987   R-squared       =    0.4851
-------------+----------------------------------   Adj R-squared   =    0.4781
       Total |  25.4899001       149  .171073155   Root MSE        =    .29879

------------------------------------------------------------------------------
excess_dea~s |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
log_covdeath |   .1752015   .0190563     9.19   0.000     .1375419    .2128611
       p_pos |   .0053102     .00205     2.59   0.011      .001259    .0093615
       _cons |   -.474531   .0917513    -5.17   0.000    -.6558529   -.2932092
------------------------------------------------------------------------------

. reg excess_deaths c.log_covdeath##c.p_pos [aweight=population] if days_to_report > 14
(sum of wgt is 8,942,683,309)

      Source |       SS           df       MS      Number of obs   =       150
-------------+----------------------------------   F(3, 146)       =     77.64
       Model |  15.6687516         3   5.2229172   Prob > F        =    0.0000
    Residual |  9.82114852       146  .067268141   R-squared       =    0.6147
-------------+----------------------------------   Adj R-squared   =    0.6068
       Total |  25.4899001       149  .171073155   Root MSE        =    .25936

----------------------------------------------------------------------------------------
         excess_deaths |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------+----------------------------------------------------------------
          log_covdeath |   .0244745   .0271364     0.90   0.369    -.0291565    .0781054
                 p_pos |  -.0262879   .0048481    -5.42   0.000    -.0358694   -.0167064
                       |
c.log_covdeath#c.p_pos |   .0061974   .0008845     7.01   0.000     .0044493    .0079454
                       |
                 _cons |   .2449163   .1299474     1.88   0.061    -.0119046    .5017372
----------------------------------------------------------------------------------------

. 
. reg excess_deaths_pc c.covdeath_pc c.p_pos [aweight=population] if days_to_report > 14
(sum of wgt is 9,674,155,568)

      Source |       SS           df       MS      Number of obs   =       190
-------------+----------------------------------   F(2, 187)       =    375.76
       Model |  28751.6967         2  14375.8483   Prob > F        =    0.0000
    Residual |  7154.25087       187   38.258026   R-squared       =    0.8008
-------------+----------------------------------   Adj R-squared   =    0.7986
       Total |  35905.9475       189  189.978558   Root MSE        =    6.1853

------------------------------------------------------------------------------
excess_dea~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 covdeath_pc |   1.595977   .0705136    22.63   0.000     1.456873    1.735082
       p_pos |  -.0320125   .0417699    -0.77   0.444    -.1144132    .0503883
       _cons |   8.333648   .7475174    11.15   0.000     6.858997    9.808299
------------------------------------------------------------------------------

. reg excess_deaths_pc c.covdeath_pc##c.p_pos [aweight=population] if days_to_report > 14
(sum of wgt is 9,674,155,568)

      Source |       SS           df       MS      Number of obs   =       190
-------------+----------------------------------   F(3, 186)       =    267.11
       Model |  29141.6427         3  9713.88091   Prob > F        =    0.0000
    Residual |  6764.30482       186  36.3672302   R-squared       =    0.8116
-------------+----------------------------------   Adj R-squared   =    0.8086
       Total |  35905.9475       189  189.978558   Root MSE        =    6.0305

---------------------------------------------------------------------------------------
     excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
          covdeath_pc |   2.389158   .2517956     9.49   0.000     1.892416    2.885901
                p_pos |   .0038715   .0421733     0.09   0.927    -.0793279     .087071
                      |
c.covdeath_pc#c.p_pos |  -.0191771   .0058565    -3.27   0.001    -.0307308   -.0076235
                      |
                _cons |   6.864594   .8558253     8.02   0.000     5.176222    8.552966
---------------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  C:\Users\favero\Documents\GitHub\covid-underreporting\code\..\logs\cleandata.txt
  log type:  text
 closed on:   9 May 2020, 14:35:34
--------------------------------------------------------------------------------------------------------------------------
