-----------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\favero\Documents\GitHub\covid-underreporting\code\..\logs\cleandata.txt
  log type:  text
 opened on:  10 Jun 2020, 14:41:36

. 
. use "..\data\population.dta" // start from this file because it has both fips codes and state names

. 
. merge 1:m fips using "..\data\covidtracking.dta", keep(2 3)

    Result                           # of obs.
    -----------------------------------------
    not matched                           430
        from master                         0  (_merge==1)
        from using                        430  (_merge==2)

    matched                             4,963  (_merge==3)
    -----------------------------------------

. drop _merge population risk_standardized_population // merge population back in later because want 
> it merged to all observations, even those missing from the current dataset

. 
. merge 1:1 state date using "..\data\past_reports\ 6 Jun 2020 cdc_deaths.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                         5,013
        from master                     4,726  (_merge==1)
        from using                        287  (_merge==2)

    matched                               667  (_merge==3)
    -----------------------------------------

. drop _merge

. 
. merge 1:1 state date using "..\data\cdc_historical_deaths.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                        23,732
        from master                     4,914  (_merge==1)
        from using                     18,818  (_merge==2)

    matched                               766  (_merge==3)
    -----------------------------------------

. drop _merge

. 
. drop fips

. merge m:1 state using "..\data\population.dta", keep(1 3)

    Result                           # of obs.
    -----------------------------------------
    not matched                           466
        from master                       466  (_merge==1)
        from using                          0  (_merge==2)

    matched                            24,032  (_merge==3)
    -----------------------------------------

. drop _merge

. order date fips

. sort fips state date

. 
. // adjust expected deaths for reporting lag: https://www.cdc.gov/nchs/data/vsrr/report001.pdf
. // maybe also somehow adjust for how the individual state was doing relative to expectations pre-co
> vid
. gen end_week = date + mod(6 - dow(date), 7)

. format end_week %tdCCYYNNDD

. order end_week, after(date)

. gen days_to_report = report_date - end_week
(23,544 missing values generated)

. merge m:1 state days_to_report using "..\data\delay_multipliers.dta", keep(1 3)

    Result                           # of obs.
    -----------------------------------------
    not matched                        23,748
        from master                    23,748  (_merge==1)
        from using                          0  (_merge==2)

    matched                               750  (_merge==3)
    -----------------------------------------

. drop _merge

. 
. drop if fips > 56
(466 observations deleted)

. 
. drop if fips == 9 | fips == 37 // Connecticut and North Carolina's data look highly problematic, so
>  dropping them
(941 observations deleted)

. 
. encode dataqualitygrade, gen(datagrade)

. order datagrade, after(dataqualitygrade)

. drop dataqualitygrade

. 
. drop hash datechecked // new variables added to more recent versions of covidtracking's data that i
> nterfere with following code:

. foreach var of varlist positive-datagrade death-pneumon_influ_or_covid numinfluenzadeaths-percentco
> mplete {
  2.         gen `var'_mis = (`var'==.)
  3. }

. gen dayscollapsed = 1

. sort fips state date

. collapse (firstnm) state report_date epi_week (lastnm) positive-datagrade population risk_standardi
> zed_population delay_multiplier days_to_report death-posneg (sum) deathincrease-pneumon_influ_or_co
> vid numinfluenzadeaths-percentcomplete *_mis dayscollapsed, by(end_week fips)

. foreach var of varlist positive-datagrade {
  2.         replace `var' = . if `var'_mis > 0
  3. }
(0 real changes made)
(15 real changes made, 15 to missing)
(51 real changes made, 51 to missing)
(53 real changes made, 53 to missing)
(50 real changes made, 50 to missing)
(35 real changes made, 35 to missing)
(18 real changes made, 18 to missing)
(30 real changes made, 30 to missing)
(12 real changes made, 12 to missing)
(44 real changes made, 44 to missing)
(49 real changes made, 49 to missing)

. foreach var of varlist death-pneumon_influ_or_covid numinfluenzadeaths-percentcomplete {
  2.         replace `var' = . if `var'_mis == dayscollapsed
  3. }
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(18,321 real changes made, 18,321 to missing)
(18,321 real changes made, 18,321 to missing)
(18,321 real changes made, 18,321 to missing)
(18,321 real changes made, 18,321 to missing)
(18,321 real changes made, 18,321 to missing)
(18,321 real changes made, 18,321 to missing)
(18,321 real changes made, 18,321 to missing)
(19,061 real changes made, 19,061 to missing)
(18,179 real changes made, 18,179 to missing)
(18,179 real changes made, 18,179 to missing)
(18,179 real changes made, 18,179 to missing)
(18,179 real changes made, 18,179 to missing)
(18,179 real changes made, 18,179 to missing)
(18,179 real changes made, 18,179 to missing)
(18,179 real changes made, 18,179 to missing)
(245 real changes made, 245 to missing)
(245 real changes made, 245 to missing)
(245 real changes made, 245 to missing)
(245 real changes made, 245 to missing)

. drop *_mis

. 
. xtset fips end_week, delta(7)
       panel variable:  fips (strongly balanced)
        time variable:  end_week, 20130105 to 20200613
                delta:  7 days

. 
. gen new_pos = d.positive if d.positive>=0
(18,370 missing values generated)

. gen new_neg = d.negative if d.negative>=0
(18,412 missing values generated)

. gen p_pos = new_pos/(new_pos+new_neg)*100
(18,412 missing values generated)

. order new_pos-p_pos, after(negative)

. 
. /*
> gen allcause_minus_posscovid = total_deaths - pneumon_influ_or_covid
> gen allcause_minus_posscovid_pc  = allcause_minus_posscovid*100000/population
> bys days_to_report: sum allcause_minus_posscovid_pc
> gen adj_allcause_minus_posscovid_pc = allcause_minus_posscovid_pc
> replace adj_allcause_minus_posscovid_pc = allcause_minus_posscovid_pc * 212 / 93 if days_to_report 
> <= 7 & days_to_report != .
> replace adj_allcause_minus_posscovid_pc = allcause_minus_posscovid_pc * 212 / 159 if days_to_report
>  > 7 & days_to_report <= 14
> replace adj_allcause_minus_posscovid_pc = allcause_minus_posscovid_pc * 212 / 192 if days_to_report
>  > 14 & days_to_report <= 21
> */
. 
. //gen adj_expected_deaths = expected_deaths
. //replace adj_expected_deaths = expected_deaths * 93 / 212 if days_to_report <= 7 & days_to_report 
> != .
. //replace adj_expected_deaths = expected_deaths * 159 / 212 if days_to_report > 7 & days_to_report 
> <= 14
. //replace adj_expected_deaths = expected_deaths * 192 / 212 if days_to_report > 14 & days_to_report
>  <= 21
. gen adj_expected_deaths = expected_deaths / delay_multiplier
(18,326 missing values generated)

. order adj_expected_deaths, after(expected_deaths)

. 
. gen pneumon_or_influ_fluview = numinfluenzadeaths + numpneumoniadeaths if end_week < date("20200201
> ","YMD")
(980 missing values generated)

. gen mmwrweek = substr(epi_week,-2,2)
(245 missing values generated)

. 
. //egen old_expected_influ_pneu_deaths = mean(pneumon_or_influ_fluview), by(fips mmwrweek)
. 
. // generate expected influenza/pneumonia deaths based on historical patterns
.         gen epi_year = substr(epi_week,1,4)
(245 missing values generated)

.         destring epi_year mmwrweek, replace
epi_year: all characters numeric; replaced as int
(245 missing values generated)
mmwrweek: all characters numeric; replaced as byte
(245 missing values generated)

.         replace epi_year = epi_year + 1 if mmwrweek >= 40
(4,508 real changes made)

. 
.         gen mmwrweek2 = mmwrweek - 39 if mmwrweek >= 40
(14,553 missing values generated)

.         replace mmwrweek2 = l.mmwrweek2 + 1 if mmwrweek < 40
(12,397 real changes made)

.         replace mmwrweek2 = mmwrweek + 13 if mmwrweek2 == .
(1,911 real changes made)

.         //gen pi_time = 2*_pi*mmwrweek2/52.1775
.         //gen sin_time = sin(pi_time)
.         //gen cos_time = cos(pi_time)
.         //gen halfsin_time = sin(pi_time/2)
.         //gen halfcos_time = cos(pi_time/2)
. 
.         gen pneumon_or_influ_fluview_pc = pneumon_or_influ_fluview * 100000 / population
(980 missing values generated)

.         gen allcause_fluview_pc = totaldeaths * 100000 / population if end_week < date("20200201","
> YMD")
(980 missing values generated)

.         
.         // most year-to-year variation in influenza severity seems to be from weeks 50 to 8; thus, 
> create a sin spike for this period with a year-varying coefficient
.         gen fluseason = 0 if mmwrweek != .
(245 missing values generated)

.         replace fluseason = 1 if (mmwrweek >= 50 | mmwrweek <= 8) & mmwrweek != .
(4,214 real changes made)

.         gen fluseason_sin_time = sin(fluseason*_pi*(mmwrweek2-10)/12)
(245 missing values generated)

.         
.         reg pneumon_or_influ_fluview_pc i.fips i.epi_year i.mmwrweek i.epi_year#c.fluseason_sin_tim
> e [aweight=population]
(sum of wgt is 115,574,913,981)

      Source |       SS           df       MS      Number of obs   =    18,081
-------------+----------------------------------   F(115, 17965)   =    517.14
       Model |  2002.90884       115  17.4165986   Prob > F        =    0.0000
    Residual |  605.035549    17,965  .033678572   R-squared       =    0.7680
-------------+----------------------------------   Adj R-squared   =    0.7665
       Total |  2607.94439    18,080  .144244712   Root MSE        =    .18352

-----------------------------------------------------------------------------------------------
  pneumon_or_influ_fluview_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                         fips |
                           2  |  -.5915756   .0301741   -19.61   0.000    -.6507198   -.5324314
                           4  |  -.3108129   .0141671   -21.94   0.000    -.3385817   -.2830441
                           5  |   .3033687   .0176899    17.15   0.000     .2686948    .3380426
                           6  |  -.2318399   .0115804   -20.02   0.000    -.2545386   -.2091412
                           8  |  -.4681593   .0148926   -31.44   0.000    -.4973501   -.4389684
                          10  |  -.1402018   .0268805    -5.22   0.000    -.1928902   -.0875134
                          11  |  -.4479987   .0308201   -14.54   0.000     -.508409   -.3875884
                          12  |  -.2237722    .012114   -18.47   0.000    -.2475167   -.2000277
                          13  |  -.4083655   .0132218   -30.89   0.000    -.4342816   -.3824495
                          15  |   .2675649   .0230231    11.62   0.000     .2224375    .3126924
                          16  |  -.3822476   .0212587   -17.98   0.000    -.4239166   -.3405786
                          17  |  -.1305367   .0128509   -10.16   0.000    -.1557257   -.1053476
                          18  |   .0826798   .0143714     5.75   0.000     .0545104    .1108492
                          19  |   .1189043   .0174414     6.82   0.000     .0847174    .1530911
                          20  |   .0267469   .0178812     1.50   0.135    -.0083019    .0617956
                          21  |   .4446037   .0158088    28.12   0.000     .4136169    .4755905
                          22  |  -.2928584   .0156381   -18.73   0.000    -.3235107   -.2622061
                          23  |   .2536681   .0235638    10.77   0.000     .2074808    .2998553
                          24  |   -.170878   .0146937   -11.63   0.000     -.199679   -.1420771
                          25  |    .025198   .0142787     1.76   0.078    -.0027897    .0531856
                          26  |  -.0581268   .0133312    -4.36   0.000    -.0842573   -.0319963
                          27  |  -.2322759   .0149442   -15.54   0.000    -.2615679   -.2029838
                          28  |   .2046438   .0177398    11.54   0.000      .169872    .2394156
                          29  |   .0101295   .0146487     0.69   0.489    -.0185834    .0388423
                          30  |  -.1497938   .0258562    -5.79   0.000    -.2004745   -.0991132
                          31  |    .020567   .0205366     1.00   0.317    -.0196868    .0608207
                          32  |  -.1794262   .0176528   -10.16   0.000    -.2140274   -.1448251
                          33  |  -.0840172   .0234403    -3.58   0.000    -.1299626   -.0380719
                          34  |  -.2897994   .0135958   -21.32   0.000    -.3164484   -.2631504
                          35  |  -.0710391   .0199443    -3.56   0.000    -.1101318   -.0319464
                          36  |   .0070904   .0122152     0.58   0.562    -.0168525    .0310333
                          38  |   .0973375   .0297811     3.27   0.001     .0389637    .1557113
                          39  |  -.0064356   .0130102    -0.49   0.621    -.0319369    .0190657
                          40  |   .3464828   .0163497    21.19   0.000     .3144358    .3785298
                          41  |  -.3358773   .0160801   -20.89   0.000    -.3673959   -.3043587
                          42  |   -.005142   .0128417    -0.40   0.689    -.0303131     .020029
                          44  |   .1621372   .0259063     6.26   0.000     .1113584    .2129159
                          45  |  -.0087386   .0153006    -0.57   0.568    -.0387292     .021252
                          46  |     .24327   .0279399     8.71   0.000     .1885052    .2980348
                          47  |   .2285037   .0143364    15.94   0.000      .200403    .2566044
                          48  |  -.2985486   .0118188   -25.26   0.000    -.3217145   -.2753826
                          49  |  -.5252561   .0174331   -30.13   0.000    -.5594267   -.4910855
                          50  |   .0917495   .0324171     2.83   0.005      .028209      .15529
                          51  |  -.3311198   .0137059   -24.16   0.000    -.3579846    -.304255
                          53  |  -.2712609   .0140277   -19.34   0.000    -.2987566   -.2437652
                          54  |   .7218845   .0210339    34.32   0.000     .6806562    .7631129
                          55  |  -.1789682   .0148226   -12.07   0.000    -.2080219   -.1499145
                          56  |  -.0813928    .033603    -2.42   0.015    -.1472579   -.0155276
                              |
                     epi_year |
                        2014  |  -.0287246   .0062266    -4.61   0.000    -.0409293   -.0165199
                        2015  |  -.0050533   .0062423    -0.81   0.418    -.0172888    .0071821
                        2016  |   -.013685   .0062266    -2.20   0.028    -.0258896   -.0014803
                        2017  |  -.0224911   .0062266    -3.61   0.000    -.0346958   -.0102865
                        2018  |  -.0498022   .0062266    -8.00   0.000    -.0620068   -.0375975
                        2019  |  -.0580562   .0062266    -9.32   0.000    -.0702608   -.0458515
                        2020  |   -.093523   .0099904    -9.36   0.000    -.1131052   -.0739408
                              |
                     mmwrweek |
                           2  |   .0946224    .014367     6.59   0.000     .0664616    .1227831
                           3  |   .0436707   .0151061     2.89   0.004     .0140613    .0732802
                           4  |  -.0046452   .0139507    -0.33   0.739    -.0319899    .0226994
                           5  |   .0090279    .013851     0.65   0.515    -.0181214    .0361772
                           6  |   .0618917   .0188683     3.28   0.001     .0249081    .0988753
                           7  |   .1811295   .0299595     6.05   0.000     .1224061     .239853
                           8  |   .2922673   .0444928     6.57   0.000      .205057    .3794775
                           9  |    .374459   .0581513     6.44   0.000     .2604767    .4884412
                          10  |   .3637861   .0581513     6.26   0.000     .2498039    .4777683
                          11  |   .3292134   .0581513     5.66   0.000     .2152311    .4431956
                          12  |    .278084   .0581513     4.78   0.000     .1641018    .3920662
                          13  |   .2449708   .0581513     4.21   0.000     .1309886     .358953
                          14  |   .2216638   .0581513     3.81   0.000     .1076816     .335646
                          15  |   .1883226   .0581513     3.24   0.001     .0743403    .3023048
                          16  |   .1304885   .0581513     2.24   0.025     .0165062    .2444707
                          17  |   .0779908   .0581513     1.34   0.180    -.0359914     .191973
                          18  |   .0467932   .0581513     0.80   0.421     -.067189    .1607754
                          19  |   .0196093   .0581513     0.34   0.736    -.0943729    .1335916
                          20  |  -.0183386   .0581513    -0.32   0.752    -.1323208    .0956436
                          21  |  -.0234926   .0581513    -0.40   0.686    -.1374748    .0904897
                          22  |  -.0632193   .0581513    -1.09   0.277    -.1772015    .0507629
                          23  |  -.0400036   .0581513    -0.69   0.492    -.1539858    .0739787
                          24  |  -.0619422   .0581513    -1.07   0.287    -.1759244      .05204
                          25  |  -.0816003   .0581513    -1.40   0.161    -.1955826    .0323819
                          26  |   -.094873   .0581513    -1.63   0.103    -.2088552    .0191092
                          27  |  -.1127979   .0581513    -1.94   0.052    -.2267801    .0011843
                          28  |  -.1052266   .0581513    -1.81   0.070    -.2192088    .0087557
                          29  |  -.1339156   .0581513    -2.30   0.021    -.2478978   -.0199333
                          30  |  -.1350558   .0581513    -2.32   0.020     -.249038   -.0210736
                          31  |  -.1415781   .0581513    -2.43   0.015    -.2555603   -.0275959
                          32  |  -.1500617   .0581513    -2.58   0.010    -.2640439   -.0360795
                          33  |   -.148146   .0581513    -2.55   0.011    -.2621283   -.0341638
                          34  |  -.1435394   .0581513    -2.47   0.014    -.2575216   -.0295572
                          35  |  -.1540298   .0581513    -2.65   0.008     -.268012   -.0400476
                          36  |  -.1358312   .0581513    -2.34   0.020    -.2498134    -.021849
                          37  |  -.1166292   .0581513    -2.01   0.045    -.2306114    -.002647
                          38  |  -.1044968   .0581513    -1.80   0.072     -.218479    .0094854
                          39  |  -.1023531   .0581513    -1.76   0.078    -.2163353    .0116291
                          40  |  -.0631315   .0581436    -1.09   0.278    -.1770986    .0508356
                          41  |  -.0593459   .0581436    -1.02   0.307    -.1733129    .0546212
                          42  |  -.0303832   .0581436    -0.52   0.601    -.1443503    .0835839
                          43  |  -.0229031   .0581436    -0.39   0.694    -.1368702     .091064
                          44  |  -.0224926   .0581436    -0.39   0.699    -.1364597    .0914745
                          45  |  -.0083077   .0581436    -0.14   0.886    -.1222748    .1056594
                          46  |   .0037791   .0581436     0.06   0.948     -.110188    .1177461
                          47  |   .0110311   .0581436     0.19   0.850    -.1029359    .1249982
                          48  |   .0505754   .0581436     0.87   0.384    -.0633917    .1645425
                          49  |   .1002453   .0581436     1.72   0.085    -.0137218    .2142123
                          50  |   .0123472   .0421139     0.29   0.769    -.0702001    .0948945
                          51  |  -.0904399   .0278686    -3.25   0.001    -.1450651   -.0358147
                          52  |  -.0972615   .0174942    -5.56   0.000    -.1315519   -.0629712
                          53  |   .0865794   .0293154     2.95   0.003     .0291184    .1440404
                              |
epi_year#c.fluseason_sin_time |
                        2013  |   .7875957   .0649795    12.12   0.000     .6602295    .9149618
                        2014  |   .5775396   .0648795     8.90   0.000     .4503696    .7047097
                        2015  |   .8404282   .0676009    12.43   0.000      .707924    .9729325
                        2016  |   .2478946   .0648795     3.82   0.000     .1207246    .3750647
                        2017  |   .5076283   .0648795     7.82   0.000     .3804582    .6347984
                        2018  |   1.083194   .0648795    16.70   0.000     .9560239    1.210364
                        2019  |   .3377921   .0648795     5.21   0.000      .210622    .4649622
                        2020  |   .4160632   .0664284     6.26   0.000     .2858572    .5462692
                              |
                        _cons |   1.158854   .0586165    19.77   0.000      1.04396    1.273748
-----------------------------------------------------------------------------------------------

.         predict expected_influ_pneu_deaths_pc
(option xb assumed; fitted values)
(245 missing values generated)

.         gen expected_influ_pneu_deaths = expected_influ_pneu_deaths_pc * population / 100000
(245 missing values generated)

.         
.         reg allcause_fluview_pc i.fips i.epi_year i.mmwrweek i.epi_year#c.fluseason_sin_time [aweig
> ht=population]
(sum of wgt is 115,574,913,981)

      Source |       SS           df       MS      Number of obs   =    18,081
-------------+----------------------------------   F(115, 17965)   =   2248.55
       Model |  148814.312       115  1294.03749   Prob > F        =    0.0000
    Residual |  10338.8431    17,965  .575499198   R-squared       =    0.9350
-------------+----------------------------------   Adj R-squared   =    0.9346
       Total |  159153.155    18,080  8.80271874   Root MSE        =    .75862

-----------------------------------------------------------------------------------------------
          allcause_fluview_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                         fips |
                           2  |  -9.028808   .1247327   -72.39   0.000    -9.273296    -8.78432
                           4  |  -5.380275   .0585633   -91.87   0.000    -5.495064   -5.265485
                           5  |   -.145454   .0731259    -1.99   0.047    -.2887878   -.0021203
                           6  |  -7.669013   .0478706  -160.20   0.000    -7.762844   -7.575182
                           8  |  -7.841004   .0615623  -127.37   0.000    -7.961672   -7.720336
                          10  |  -2.859077   .1111177   -25.73   0.000    -3.076878   -2.641276
                          11  |  -6.943762   .1274029   -54.50   0.000    -7.193484    -6.69404
                          12  |  -2.657606   .0500762   -53.07   0.000     -2.75576   -2.559452
                          13  |  -5.533347   .0546559  -101.24   0.000    -5.640478   -5.426216
                          15  |  -5.341339   .0951719   -56.12   0.000    -5.527885   -5.154793
                          16  |   -5.59724   .0878782   -63.69   0.000     -5.76949   -5.424991
                          17  |  -4.141845   .0531227   -77.97   0.000    -4.245971    -4.03772
                          18  |  -2.070657   .0594081   -34.85   0.000    -2.187103   -1.954212
                          19  |  -2.157507   .0720988   -29.92   0.000    -2.298828   -2.016187
                          20  |   -2.76292   .0739164   -37.38   0.000    -2.907803   -2.618036
                          21  |  -.1309834   .0653499    -2.00   0.045    -.2590755   -.0028912
                          22  |  -1.922725   .0646444   -29.74   0.000    -2.049434   -1.796016
                          23  |   .2149775   .0974071     2.21   0.027     .0240503    .4059047
                          24  |  -4.962622   .0607401   -81.70   0.000    -5.081679   -4.843566
                          25  |  -4.446717   .0590249   -75.34   0.000    -4.562412   -4.331023
                          26  |  -1.851595   .0551081   -33.60   0.000    -1.959612   -1.743578
                          27  |  -5.543977   .0617757   -89.74   0.000    -5.665063   -5.422891
                          28  |   .0791879   .0733323     1.08   0.280    -.0645505    .2229262
                          29  |  -1.398529   .0605542   -23.10   0.000    -1.517221   -1.279837
                          30  |  -2.492853   .1068834   -23.32   0.000    -2.702354   -2.283351
                          31  |  -3.907751   .0848935   -46.03   0.000    -4.074151   -3.741352
                          32  |  -5.389075   .0729724   -73.85   0.000    -5.532108   -5.246042
                          33  |  -3.224053   .0968968   -33.27   0.000     -3.41398   -3.034126
                          34  |  -4.507426   .0562018   -80.20   0.000    -4.617586   -4.397265
                          35  |  -3.613609   .0824449   -43.83   0.000    -3.775209   -3.452009
                          36  |  -5.216744   .0504947  -103.31   0.000    -5.315719    -5.11777
                          38  |  -4.285425    .123108   -34.81   0.000    -4.526728   -4.044121
                          39  |  -.8163461   .0537811   -15.18   0.000    -.9217623   -.7109299
                          40  |  -1.020239   .0675859   -15.10   0.000    -1.152714    -.887764
                          41  |  -3.976471   .0664714   -59.82   0.000    -4.106762   -3.846181
                          42  |  -.5224663   .0530847    -9.84   0.000    -.6265175   -.4184152
                          44  |  -2.192755   .1070904   -20.48   0.000    -2.402663   -1.982848
                          45  |  -2.161234   .0632489   -34.17   0.000    -2.285207    -2.03726
                          46  |  -3.398407   .1154967   -29.42   0.000    -3.624791   -3.172022
                          47  |  -1.047283   .0592632   -17.67   0.000    -1.163445   -.9311216
                          48  |  -7.422729    .048856  -151.93   0.000    -7.518492   -7.326967
                          49  |  -9.625822   .0720644  -133.57   0.000    -9.767076   -9.484569
                          50  |  -2.694414   .1340044   -20.11   0.000    -2.957075   -2.431752
                          51  |  -5.289977   .0566567   -93.37   0.000    -5.401029   -5.178924
                          53  |   -6.31457   .0579873  -108.90   0.000    -6.428231   -6.200909
                          54  |   3.893664    .086949    44.78   0.000     3.723236    4.064093
                          55  |  -3.373681   .0612731   -55.06   0.000    -3.493783    -3.25358
                          56  |  -4.334657    .138907   -31.21   0.000    -4.606928   -4.062386
                              |
                     epi_year |
                        2014  |   .1691494   .0257392     6.57   0.000     .1186982    .2196006
                        2015  |   .6955422    .025804    26.95   0.000     .6449638    .7461207
                        2016  |   .9341325   .0257392    36.29   0.000     .8836813    .9845838
                        2017  |   1.322619   .0257392    51.39   0.000     1.272167     1.37307
                        2018  |    1.38393   .0257392    53.77   0.000     1.333479    1.434381
                        2019  |   1.670519   .0257392    64.90   0.000     1.620068    1.720971
                        2020  |   1.988134   .0412981    48.14   0.000     1.907185    2.069082
                              |
                     mmwrweek |
                           2  |   .7534234   .0593899    12.69   0.000     .6370134    .8698334
                           3  |   .2918417   .0624452     4.67   0.000     .1694432    .4142403
                           4  |   .0757928   .0576687     1.31   0.189    -.0372435     .188829
                           5  |   .1135931   .0572567     1.98   0.047     .0013644    .2258219
                           6  |   .3039838   .0779969     3.90   0.000     .1511023    .4568653
                           7  |   .4940049   .1238454     3.99   0.000     .2512561    .7367537
                           8  |    .578538   .1839229     3.15   0.002     .2180315    .9390445
                           9  |    .762913   .2403838     3.17   0.002     .2917376    1.234088
                          10  |   .8454224   .2403838     3.52   0.000      .374247    1.316598
                          11  |   .6186014   .2403838     2.57   0.010      .147426    1.089777
                          12  |   .4590103   .2403838     1.91   0.056    -.0121652    .9301857
                          13  |   .2769332   .2403838     1.15   0.249    -.1942422    .7481087
                          14  |   .2340137   .2403838     0.97   0.330    -.2371617    .7051891
                          15  |   .1190297   .2403838     0.50   0.620    -.3521458    .5902051
                          16  |  -.1966405   .2403838    -0.82   0.413     -.667816    .2745349
                          17  |  -.3930849   .2403838    -1.64   0.102    -.8642603    .0780905
                          18  |  -.3996984   .2403838    -1.66   0.096    -.8708738     .071477
                          19  |  -.5644892   .2403838    -2.35   0.019    -1.035665   -.0933137
                          20  |  -.8015725   .2403838    -3.33   0.001    -1.272748    -.330397
                          21  |  -.8161222   .2403838    -3.40   0.001    -1.287298   -.3449468
                          22  |  -.9523151   .2403838    -3.96   0.000    -1.423491   -.4811397
                          23  |  -.8558945   .2403838    -3.56   0.000     -1.32707   -.3847191
                          24  |  -.9766256   .2403838    -4.06   0.000    -1.447801   -.5054501
                          25  |  -1.006044   .2403838    -4.19   0.000     -1.47722   -.5348689
                          26  |   -1.04942   .2403838    -4.37   0.000    -1.520595   -.5782444
                          27  |    -1.0117   .2403838    -4.21   0.000    -1.482875   -.5405245
                          28  |  -1.099591   .2403838    -4.57   0.000    -1.570767    -.628416
                          29  |  -1.170926   .2403838    -4.87   0.000    -1.642102   -.6997508
                          30  |  -1.203903   .2403838    -5.01   0.000    -1.675078   -.7327272
                          31  |  -1.212614   .2403838    -5.04   0.000     -1.68379   -.7414388
                          32  |  -1.165772   .2403838    -4.85   0.000    -1.636948   -.6945968
                          33  |  -1.231223   .2403838    -5.12   0.000    -1.702399   -.7600479
                          34  |  -1.249194   .2403838    -5.20   0.000    -1.720369   -.7780183
                          35  |  -1.175214   .2403838    -4.89   0.000    -1.646389   -.7040382
                          36  |  -1.115236   .2403838    -4.64   0.000    -1.586411   -.6440603
                          37  |  -1.044904   .2403838    -4.35   0.000     -1.51608   -.5737291
                          38  |  -.9783587   .2403838    -4.07   0.000    -1.449534   -.5071833
                          39  |  -.9366707   .2403838    -3.90   0.000    -1.407846   -.4654953
                          40  |  -.9583383   .2403519    -3.99   0.000    -1.429451   -.4872254
                          41  |  -.9606644   .2403519    -4.00   0.000    -1.431777   -.4895516
                          42  |  -.8116093   .2403519    -3.38   0.001    -1.282722   -.3404965
                          43  |  -.7644937   .2403519    -3.18   0.001    -1.235607   -.2933808
                          44  |  -.6685292   .2403519    -2.78   0.005    -1.139642   -.1974164
                          45  |  -.5073873   .2403519    -2.11   0.035    -.9785002   -.0362745
                          46  |  -.3636686   .2403519    -1.51   0.130    -.8347815    .1074442
                          47  |  -.2467234   .2403519    -1.03   0.305    -.7178362    .2243894
                          48  |  -.1797672   .2403519    -0.75   0.455      -.65088    .2913456
                          49  |   .1650481   .2403519     0.69   0.492    -.3060648    .6361609
                          50  |   .0067958   .1740889     0.04   0.969    -.3344351    .3480267
                          51  |  -.0573213   .1152023    -0.50   0.619    -.2831289    .1684864
                          52  |  -.1603618   .0723169    -2.22   0.027    -.3021099   -.0186136
                          53  |   .3898973    .121183     3.22   0.001      .152367    .6274275
                              |
epi_year#c.fluseason_sin_time |
                        2013  |   1.619767     .26861     6.03   0.000     1.093266    2.146269
                        2014  |   .9527861   .2681965     3.55   0.000     .4270952    1.478477
                        2015  |   2.017718    .279446     7.22   0.000     1.469977    2.565459
                        2016  |   .3776192   .2681965     1.41   0.159    -.1480717    .9033101
                        2017  |   1.432162   .2681965     5.34   0.000      .906471    1.957853
                        2018  |   2.887693   .2681965    10.77   0.000     2.362002    3.413384
                        2019  |    .598202   .2681965     2.23   0.026     .0725111    1.123893
                        2020  |   .5472977   .2745991     1.99   0.046     .0090571    1.085538
                              |
                        _cons |   19.54499   .2423066    80.66   0.000     19.07004    20.01993
-----------------------------------------------------------------------------------------------

.         predict expected_allcause_deaths_pc
(option xb assumed; fitted values)
(245 missing values generated)

.         gen expected_allcause_deaths = expected_allcause_deaths_pc * population / 100000
(245 missing values generated)

. 
. //gen adj_expected_influ_pneu_deaths = expected_influ_pneu_deaths
. //replace adj_expected_influ_pneu_deaths = expected_influ_pneu_deaths * 93 / 212 if days_to_report 
> <= 7 & days_to_report != .
. //replace adj_expected_influ_pneu_deaths = expected_influ_pneu_deaths * 159 / 212 if days_to_report
>  > 7 & days_to_report <= 14
. //replace adj_expected_influ_pneu_deaths = expected_influ_pneu_deaths * 192 / 212 if days_to_report
>  > 14 & days_to_report <= 21
. gen adj_expected_influ_pneu_deaths = expected_influ_pneu_deaths / delay_multiplier
(18,424 missing values generated)

. order adj_expected_influ_pneu_deaths, after(expected_influ_pneu_deaths)

. 
. replace covid_deaths = 5 if covid_deaths == . & total_deaths != . //rough imputation for where data
>  is supressed for 1-9 deaths
(0 real changes made)

. 
. 
. gen cumulative_covid_death = covid_deaths
(18,179 missing values generated)

. replace cumulative_covid_death = cumulative_covid_death + l.cumulative_covid_death if l.cumulative_
> covid_death != .
(503 real changes made)

. 
. //gen adj_covid_deaths = covid_deaths
. //replace adj_covid_deaths = covid_deaths * 212 / 93 if days_to_report <= 7 & days_to_report != .
. //replace adj_covid_deaths = covid_deaths * 212 / 159 if days_to_report > 7 & days_to_report <= 14
. //replace adj_covid_deaths = covid_deaths * 212 / 192 if days_to_report > 14 & days_to_report <= 21
. 
. gen adj_covid_deaths = covid_deaths * delay_multiplier
(18,326 missing values generated)

. gen adj_cumulative_covid_death = adj_covid_deaths
(18,326 missing values generated)

. replace adj_cumulative_covid_death = adj_cumulative_covid_death + l.adj_cumulative_covid_death if l
> .adj_cumulative_covid_death != .
(452 real changes made)

. 
. gen adj_total_deaths = total_deaths * delay_multiplier
(18,326 missing values generated)

. gen adj_pneumon_influ_or_covid = pneumon_influ_or_covid * delay_multiplier
(18,326 missing values generated)

. 
. 
. gen covid_deaths_pc = covid_deaths*100000/risk_standardized_population
(18,179 missing values generated)

. gen excess_deaths_pc = (total_deaths-adj_expected_deaths)*100000/population
(18,326 missing values generated)

. gen excess_respir_deaths_pc = (pneumon_influ_or_covid-adj_expected_influ_pneu_deaths)*100000/risk_s
> tandardized_population
(18,424 missing values generated)

. gen adj_covid_deaths_pc = adj_covid_deaths*100000/risk_standardized_population
(18,326 missing values generated)

. gen adj_excess_deaths_pc = (adj_total_deaths-expected_deaths)*100000/population
(18,326 missing values generated)

. gen adj_excess_deaths_fluview_pc = (adj_total_deaths-expected_allcause_deaths)*100000/population
(18,424 missing values generated)

. gen adj_excess_respir_deaths_pc = (adj_pneumon_influ_or_covid-expected_influ_pneu_deaths)*100000/ri
> sk_standardized_population
(18,424 missing values generated)

. gen new_pos_pc = new_pos*100000/population
(18,370 missing values generated)

. gen new_neg_pc = new_neg*100000/population
(18,412 missing values generated)

. gen new_tests_pc = new_pos_pc + new_neg_pc
(18,412 missing values generated)

. gen deathincrease_pc = deathincrease*100000/risk_standardized_population
(18,321 missing values generated)

. 
. /*
> gen log_covid_death = log(covid_deaths)
>         //replace log_covid_death = 2 if covid_deaths==0
> gen log_allcause = log(total_deaths)
> gen log_expected = log(adj_expected_deaths)
> gen excess_deaths = log_allcause-log_expected
> */
. 
. save "..\data\weeklydata.dta", replace
file ..\data\weeklydata.dta saved

. 
. 
. reg excess_deaths_pc covid_deaths_pc [aweight=population] if days_to_report > 14, cluster(fips) noc
> ons
(sum of wgt is 4,384,956,086)

Linear regression                               Number of obs     =        686
                                                F(1, 48)          =      20.79
                                                Prob > F          =     0.0000
                                                R-squared         =     0.6167
                                                Root MSE          =     3.8534

                                     (Std. Err. adjusted for 49 clusters in fips)
---------------------------------------------------------------------------------
                |               Robust
excess_deaths~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
covid_deaths_pc |   1.042404   .2285964     4.56   0.000     .5827801    1.502028
---------------------------------------------------------------------------------

. margins, dydx(covid_deaths_pc)

Average marginal effects                        Number of obs     =        686
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : covid_deaths_pc

---------------------------------------------------------------------------------
                |            Delta-method
                |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
covid_deaths_pc |   1.042404   .2285964     4.56   0.000     .5827801    1.502028
---------------------------------------------------------------------------------

. 
. twoway (scatter excess_deaths_pc covid_deaths_pc if days_to_report > 14, mcolor(%30) yline(0)) (fun
> ction y=x, range(0 40))

. 
. reg excess_deaths_pc covid_deaths_pc [aweight=population] if days_to_report > 14, cluster(fips)
(sum of wgt is 4,384,956,086)

Linear regression                               Number of obs     =        686
                                                F(1, 48)          =      16.29
                                                Prob > F          =     0.0002
                                                R-squared         =     0.5670
                                                Root MSE          =     3.8516

                                     (Std. Err. adjusted for 49 clusters in fips)
---------------------------------------------------------------------------------
                |               Robust
excess_deaths~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
covid_deaths_pc |   1.025005   .2539611     4.04   0.000     .5143821    1.535628
          _cons |   .2035905   .2867401     0.71   0.481    -.3729391    .7801201
---------------------------------------------------------------------------------

. reg excess_deaths_pc c.covid_deaths_pc c.p_pos [aweight=population] if days_to_report > 14, cluster
> (fips)
(sum of wgt is 2,874,561,951)

Linear regression                               Number of obs     =        456
                                                F(2, 48)          =       8.60
                                                Prob > F          =     0.0006
                                                R-squared         =     0.5988
                                                Root MSE          =      4.349

                                     (Std. Err. adjusted for 49 clusters in fips)
---------------------------------------------------------------------------------
                |               Robust
excess_deaths~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
covid_deaths_pc |   1.070316   .2584213     4.14   0.000     .5507249    1.589906
          p_pos |  -.0162707   .0249401    -0.65   0.517    -.0664161    .0338746
          _cons |   .0808657   .4745736     0.17   0.865    -.8733286     1.03506
---------------------------------------------------------------------------------

. reg excess_deaths_pc c.covid_deaths_pc##c.p_pos [aweight=population] if days_to_report > 14, cluste
> r(fips)
(sum of wgt is 2,874,561,951)

Linear regression                               Number of obs     =        456
                                                F(3, 48)          =       5.69
                                                Prob > F          =     0.0020
                                                R-squared         =     0.6010
                                                Root MSE          =     4.3421

                                               (Std. Err. adjusted for 49 clusters in fips)
-------------------------------------------------------------------------------------------
                          |               Robust
         excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------------+----------------------------------------------------------------
          covid_deaths_pc |   .8950727   .6105204     1.47   0.149    -.3324608    2.122606
                    p_pos |  -.0253018    .023297    -1.09   0.283    -.0721435    .0215399
                          |
c.covid_deaths_pc#c.p_pos |   .0047928   .0153224     0.31   0.756    -.0260149    .0356005
                          |
                    _cons |   .3675855   .6857982     0.54   0.594    -1.011304    1.746475
-------------------------------------------------------------------------------------------

. reg excess_deaths_pc c.covid_deaths_pc c.new_pos_pc c.new_neg_pc [aweight=population] if days_to_re
> port > 14, cluster(fips)
(sum of wgt is 2,874,561,951)

Linear regression                               Number of obs     =        456
                                                F(3, 48)          =      10.85
                                                Prob > F          =     0.0000
                                                R-squared         =     0.6060
                                                Root MSE          =      4.315

                                     (Std. Err. adjusted for 49 clusters in fips)
---------------------------------------------------------------------------------
                |               Robust
excess_deaths~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
covid_deaths_pc |   .8356389   .3656495     2.29   0.027     .1004513    1.570827
     new_pos_pc |   .0164062   .0141377     1.16   0.252    -.0120195    .0448319
     new_neg_pc |   .0015657   .0017206     0.91   0.367    -.0018938    .0050252
          _cons |  -.7831741   .5910881    -1.32   0.191    -1.971636    .4052882
---------------------------------------------------------------------------------

. reg excess_deaths_pc c.covid_deaths_pc##c.new_pos_pc c.covid_deaths_pc##c.new_neg_pc [aweight=popul
> ation] if days_to_report > 14, cluster(fips)
(sum of wgt is 2,874,561,951)
note: covid_deaths_pc omitted because of collinearity

Linear regression                               Number of obs     =        456
                                                F(5, 48)          =      33.78
                                                Prob > F          =     0.0000
                                                R-squared         =     0.7114
                                                Root MSE          =     3.7008

                                                    (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------------------------
                               |               Robust
              excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------------------+----------------------------------------------------------------
               covid_deaths_pc |  -1.018581   .3936366    -2.59   0.013     -1.81004    -.227121
                    new_pos_pc |    .022199   .0089604     2.48   0.017     .0041829     .040215
                               |
c.covid_deaths_pc#c.new_pos_pc |   .0050836   .0010236     4.97   0.000     .0030255    .0071417
                               |
               covid_deaths_pc |          0  (omitted)
                    new_neg_pc |   .0018365   .0017581     1.04   0.301    -.0016984    .0053715
                               |
c.covid_deaths_pc#c.new_neg_pc |   .0008295   .0006954     1.19   0.239    -.0005688    .0022278
                               |
                         _cons |   .8393333   .3619965     2.32   0.025     .1114905    1.567176
------------------------------------------------------------------------------------------------

. reg excess_deaths_pc c.covid_deaths_pc c.new_tests_pc [aweight=population] if days_to_report > 14, 
> cluster(fips)
(sum of wgt is 2,874,561,951)

Linear regression                               Number of obs     =        456
                                                F(2, 48)          =      11.97
                                                Prob > F          =     0.0001
                                                R-squared         =     0.6039
                                                Root MSE          =     4.3216

                                     (Std. Err. adjusted for 49 clusters in fips)
---------------------------------------------------------------------------------
                |               Robust
excess_deaths~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
covid_deaths_pc |   .9958147   .2769662     3.60   0.001     .4389368    1.552693
   new_tests_pc |   .0020436    .001617     1.26   0.212    -.0012075    .0052947
          _cons |   -.695938    .567869    -1.23   0.226    -1.837715    .4458391
---------------------------------------------------------------------------------

. reg excess_deaths_pc c.covid_deaths_pc##c.new_tests_pc [aweight=population] if days_to_report > 14,
>  cluster(fips)
(sum of wgt is 2,874,561,951)

Linear regression                               Number of obs     =        456
                                                F(3, 48)          =      14.02
                                                Prob > F          =     0.0000
                                                R-squared         =     0.6479
                                                Root MSE          =     4.0786

                                                      (Std. Err. adjusted for 49 clusters in fips)
--------------------------------------------------------------------------------------------------
                                 |               Robust
                excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------------------+----------------------------------------------------------------
                 covid_deaths_pc |   .1054058   .4147903     0.25   0.800     -.728586    .9393976
                    new_tests_pc |  -.0013513   .0013029    -1.04   0.305    -.0039708    .0012683
                                 |
c.covid_deaths_pc#c.new_tests_pc |   .0013087   .0006428     2.04   0.047     .0000162    .0026013
                                 |
                           _cons |   .8191158   .4099307     2.00   0.051    -.0051052    1.643337
--------------------------------------------------------------------------------------------------

. reg excess_deaths_pc c.covid_deaths_pc##c.new_tests_pc c.covid_deaths_pc##c.p_pos [aweight=populati
> on] if days_to_report > 14, cluster(fips)
(sum of wgt is 2,874,561,951)
note: covid_deaths_pc omitted because of collinearity

Linear regression                               Number of obs     =        456
                                                F(5, 48)          =       8.35
                                                Prob > F          =     0.0000
                                                R-squared         =     0.6790
                                                Root MSE          =     3.9032

                                                      (Std. Err. adjusted for 49 clusters in fips)
--------------------------------------------------------------------------------------------------
                                 |               Robust
                excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------------------+----------------------------------------------------------------
                 covid_deaths_pc |  -1.125115   .7074895    -1.59   0.118    -2.547618    .2973885
                    new_tests_pc |   .0009803   .0019621     0.50   0.620    -.0029647    .0049252
                                 |
c.covid_deaths_pc#c.new_tests_pc |   .0017253   .0005478     3.15   0.003     .0006238    .0028268
                                 |
                 covid_deaths_pc |          0  (omitted)
                           p_pos |   .0110937    .013473     0.82   0.414    -.0159956    .0381829
                                 |
       c.covid_deaths_pc#c.p_pos |   .0216933   .0145875     1.49   0.144    -.0076368    .0510234
                                 |
                           _cons |   1.026092   .4438888     2.31   0.025     .1335938     1.91859
--------------------------------------------------------------------------------------------------

. reg excess_deaths_pc c.covid_deaths_pc##c.new_tests_pc##c.p_pos [aweight=population] if days_to_rep
> ort > 14, cluster(fips)
(sum of wgt is 2,874,561,951)

Linear regression                               Number of obs     =        456
                                                F(7, 48)          =     408.06
                                                Prob > F          =     0.0000
                                                R-squared         =     0.7211
                                                Root MSE          =     3.6462

                                                       (Std. Err. adjusted for 49 clusters in fips)
---------------------------------------------------------------------------------------------------
                                  |               Robust
                 excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------------------+----------------------------------------------------------------
                  covid_deaths_pc |  -.2785489   .6449854    -0.43   0.668    -1.575379    1.018281
                     new_tests_pc |   .0035844   .0019822     1.81   0.077    -.0004011    .0075698
                                  |
 c.covid_deaths_pc#c.new_tests_pc |    -.00008   .0007595    -0.11   0.917    -.0016072    .0014471
                                  |
                            p_pos |   .0421312   .0160427     2.63   0.012     .0098753    .0743872
                                  |
        c.covid_deaths_pc#c.p_pos |  -.0255117   .0074436    -3.43   0.001    -.0404781   -.0105453
                                  |
           c.new_tests_pc#c.p_pos |   .0001337   .0001252     1.07   0.291     -.000118    .0003855
                                  |
 c.covid_deaths_pc#c.new_tests_pc#|
                          c.p_pos |   .0000762   .0000144     5.28   0.000     .0000472    .0001051
                                  |
                            _cons |  -.2407818   .5656944    -0.43   0.672    -1.378187     .896623
---------------------------------------------------------------------------------------------------

. 
. gen covid_deaths_pcXp_pos = covid_deaths_pc * p_pos
(18,509 missing values generated)

. reghv excess_deaths_pc covid_deaths_pc p_pos covid_deaths_pcXp_pos if days_to_report > 14, var( new
> _tests_pc covid_deaths_pc population) twostage cluster(fips)

Multiplicative heteroscedastic regression             Number of obs  =     456
Estimator: 2sls                                       Model chi2(6)  =-165.134
                                                      Prob > chi2    =   1.000
Log Likelihood              = -1549.345               Pseudo R2      = -0.0563
                                                      VWLS R2        =  0.0218
                                  (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
excess_dea~c |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
lp_mean      |
covid_deat~c |   .7255649   .3237378     2.24   0.025     .0910505    1.360079
       p_pos |  -.0094229    .017272    -0.55   0.585    -.0432754    .0244295
covid_dea~os |    .004083   .0106902     0.38   0.703    -.0168695    .0250355
       _cons |  -.0435581   .4408827    -0.10   0.921    -.9076722    .8205561
-------------+----------------------------------------------------------------
lp_lnvar     |
new_tests_pc |   .0010502   .0037524     0.28   0.780    -.0063043    .0084047
covid_deat~c |   .2196119   .1473125     1.49   0.136    -.0691154    .5083391
  population |  -4.42e-08   2.94e-07    -0.15   0.880    -6.20e-07    5.31e-07
       _cons |   1.422667   5.831779     0.24   0.807    -10.00741    12.85274
------------------------------------------------------------------------------

. reghv excess_deaths_pc covid_deaths_pc p_pos covid_deaths_pcXp_pos if days_to_report > 14, var( new
> _tests_pc covid_deaths_pc population) cluster(fips)

iteration 1:  Log-likelihood =     -1331  |delta-b|     1.968 [step half]
iteration 2:  Log-likelihood =     -1327  |delta-b|     .6951 
iteration 3:  Log-likelihood =     -1315  |delta-b|     .5171 
iteration 4:  Log-likelihood =     -1313  |delta-b|     .2654 
iteration 5:  Log-likelihood =     -1313  |delta-b|    .03653 
iteration 6:  Log-likelihood =     -1313  |delta-b|    .03073 
iteration 7:  Log-likelihood =     -1313  |delta-b|    .01944 
iteration 8:  Log-likelihood =     -1313  |delta-b|    .01225 
iteration 9:  Log-likelihood =     -1313  |delta-b|   .007883 
iteration 10:  Log-likelihood =     -1313  |delta-b|   .004988 
iteration 11:  Log-likelihood =     -1313  |delta-b|   .003202 
iteration 12:  Log-likelihood =     -1313  |delta-b|   .002032 
iteration 13:  Log-likelihood =     -1313  |delta-b|   .001302 
iteration 14:  Log-likelihood =     -1313  |delta-b|  .0008278 
iteration 15:  Log-likelihood =     -1313  |delta-b|  .0005293 
iteration 16:  Log-likelihood =     -1313  |delta-b|  .0003371 
iteration 17:  Log-likelihood =     -1313  |delta-b|  .0002154 
iteration 18:  Log-likelihood =     -1313  |delta-b|  .0001373 

Multiplicative heteroscedastic regression             Number of obs  =     456
Estimator: mle                                        Model chi2(6)  = 307.705
                                                      Prob > chi2    =   0.000
Log Likelihood              = -1312.926               Pseudo R2      =  0.1049
                                                      VWLS R2        =  0.0697
                                  (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
excess_dea~c |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
lp_mean      |
covid_deat~c |   .7748943   .2607458     2.97   0.003      .263842    1.285947
       p_pos |   .0186469   .0153022     1.22   0.223     -.011345    .0486387
covid_dea~os |  -.0074128   .0085111    -0.87   0.384    -.0240943    .0092686
       _cons |   .2222601   .3550537     0.63   0.531    -.4736323    .9181525
-------------+----------------------------------------------------------------
lp_lnvar     |
new_tests_pc |  -.0001783   .0005935    -0.30   0.764    -.0013415    .0009849
covid_deat~c |   .1951494   .0436556     4.47   0.000      .109586    .2807128
  population |  -9.09e-08   3.86e-08    -2.35   0.019    -1.67e-07   -1.52e-08
       _cons |   3.143189   .7481773     4.20   0.000     1.676788     4.60959
------------------------------------------------------------------------------

. drop covid_deaths_pcXp_pos

. 
. 
. 
. reg deathincrease_pc adj_covid_deaths_pc [aweight=population] if days_to_report > 7, cluster(fips)
(sum of wgt is 3,774,238,412)

Linear regression                               Number of obs     =        590
                                                F(1, 48)          =     630.20
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9363
                                                Root MSE          =     1.0115

                                         (Std. Err. adjusted for 49 clusters in fips)
-------------------------------------------------------------------------------------
                    |               Robust
   deathincrease_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
adj_covid_deaths_pc |   .8103539   .0322802    25.10   0.000     .7454503    .8752575
              _cons |   .2171188   .0569709     3.81   0.000     .1025712    .3316664
-------------------------------------------------------------------------------------

. reg deathincrease_pc adj_covid_deaths_pc l.adj_covid_deaths_pc [aweight=population] if days_to_repo
> rt > 7, cluster(fips)
(sum of wgt is 3,766,702,821)

Linear regression                               Number of obs     =        589
                                                F(2, 48)          =    1029.79
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9576
                                                Root MSE          =     .82658

                                         (Std. Err. adjusted for 49 clusters in fips)
-------------------------------------------------------------------------------------
                    |               Robust
   deathincrease_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
adj_covid_deaths_pc |
                --. |    .555301   .0837179     6.63   0.000     .3869749    .7236271
                L1. |    .281532   .1177631     2.39   0.021     .0447534    .5183106
                    |
              _cons |   .1962416    .045574     4.31   0.000     .1046089    .2878744
-------------------------------------------------------------------------------------

. reg deathincrease_pc c.adj_covid_deaths_pc##c.p_pos [aweight=population] if days_to_report > 7, clu
> ster(fips)
(sum of wgt is 3,187,773,100)

Linear regression                               Number of obs     =        505
                                                F(3, 48)          =     250.38
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9509
                                                Root MSE          =     .93896

                                                   (Std. Err. adjusted for 49 clusters in fips)
-----------------------------------------------------------------------------------------------
                              |               Robust
             deathincrease_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
          adj_covid_deaths_pc |   1.082306   .0503937    21.48   0.000     .9809825    1.183629
                        p_pos |  -.0032348    .003359    -0.96   0.340    -.0099886    .0035189
                              |
c.adj_covid_deaths_pc#c.p_pos |  -.0072793    .000662   -11.00   0.000    -.0086104   -.0059481
                              |
                        _cons |    .001452   .0614842     0.02   0.981    -.1221703    .1250743
-----------------------------------------------------------------------------------------------

. reg deathincrease_pc c.adj_covid_deaths_pc##c.new_tests_pc [aweight=population] if days_to_report >
>  7, cluster(fips)
(sum of wgt is 3,187,773,100)

Linear regression                               Number of obs     =        505
                                                F(3, 48)          =     253.68
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9422
                                                Root MSE          =     1.0192

                                            (Std. Err. adjusted for 49 clusters in fips)
----------------------------------------------------------------------------------------
                       |               Robust
      deathincrease_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------+----------------------------------------------------------------
   adj_covid_deaths_pc |   .7463596   .0458501    16.28   0.000     .6541718    .8385474
          new_tests_pc |   .0012311   .0002322     5.30   0.000     .0007642    .0016979
                       |
 c.adj_covid_deaths_pc#|
        c.new_tests_pc |   .0000349   .0000608     0.57   0.568    -.0000872    .0001571
                       |
                 _cons |  -.1297593   .0586646    -2.21   0.032    -.2477124   -.0118062
----------------------------------------------------------------------------------------

. reg deathincrease_pc c.adj_covid_deaths_pc##c.new_tests_pc c.l.adj_covid_deaths_pc##c.new_tests_pc 
> [aweight=population] if days_to_report > 7, cluster(fips)
(sum of wgt is 3,187,773,100)
note: new_tests_pc omitted because of collinearity

Linear regression                               Number of obs     =        505
                                                F(5, 48)          =    1105.19
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9610
                                                Root MSE          =     .83892

                                             (Std. Err. adjusted for 49 clusters in fips)
-----------------------------------------------------------------------------------------
                        |               Robust
       deathincrease_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
    adj_covid_deaths_pc |    .312257   .1450875     2.15   0.036     .0205391     .603975
           new_tests_pc |   .0010739    .000282     3.81   0.000     .0005069    .0016409
                        |
  c.adj_covid_deaths_pc#|
         c.new_tests_pc |   .0003347   .0001915     1.75   0.087    -.0000503    .0007197
                        |
    adj_covid_deaths_pc |
                    L1. |   .5497571   .1192846     4.61   0.000     .3099193    .7895949
                        |
           new_tests_pc |          0  (omitted)
                        |
 cL.adj_covid_deaths_pc#|
         c.new_tests_pc |  -.0004014    .000178    -2.25   0.029    -.0007594   -.0000435
                        |
                  _cons |  -.0908117   .0580324    -1.56   0.124    -.2074937    .0258702
-----------------------------------------------------------------------------------------

. reg deathincrease_pc c.excess_deaths_pc##c.new_tests_pc c.l.excess_deaths_pc##c.new_tests_pc [aweig
> ht=population] if days_to_report > 7, cluster(fips)
(sum of wgt is 3,187,773,100)
note: new_tests_pc omitted because of collinearity

Linear regression                               Number of obs     =        505
                                                F(5, 48)          =     139.89
                                                Prob > F          =     0.0000
                                                R-squared         =     0.6268
                                                Root MSE          =     2.5944

                                                        (Std. Err. adjusted for 49 clusters in fips)
----------------------------------------------------------------------------------------------------
                                   |               Robust
                  deathincrease_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------------------+----------------------------------------------------------------
                  excess_deaths_pc |   .0989637    .184892     0.54   0.595    -.2727865    .4707139
                      new_tests_pc |   .0015345   .0014593     1.05   0.298    -.0013996    .0044685
                                   |
 c.excess_deaths_pc#c.new_tests_pc |   .0003853   .0002509     1.54   0.131    -.0001191    .0008897
                                   |
                  excess_deaths_pc |
                               L1. |   .1803305   .1338777     1.35   0.184    -.0888486    .4495096
                                   |
                      new_tests_pc |          0  (omitted)
                                   |
cL.excess_deaths_pc#c.new_tests_pc |  -.0001224    .000135    -0.91   0.369    -.0003938    .0001491
                                   |
                             _cons |   .6301902   .5167179     1.22   0.229    -.4087407    1.669121
----------------------------------------------------------------------------------------------------

. 
. 
. reg excess_deaths_pc covid_deaths_pc [aweight=population] if days_to_report > 14, cluster(fips)
(sum of wgt is 4,384,956,086)

Linear regression                               Number of obs     =        686
                                                F(1, 48)          =      16.29
                                                Prob > F          =     0.0002
                                                R-squared         =     0.5670
                                                Root MSE          =     3.8516

                                     (Std. Err. adjusted for 49 clusters in fips)
---------------------------------------------------------------------------------
                |               Robust
excess_deaths~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
covid_deaths_pc |   1.025005   .2539611     4.04   0.000     .5143821    1.535628
          _cons |   .2035905   .2867401     0.71   0.481    -.3729391    .7801201
---------------------------------------------------------------------------------

. reg excess_respir_deaths_pc covid_deaths_pc [aweight=population] if days_to_report > 14, cluster(fi
> ps)
(sum of wgt is 4,071,744,937)

Linear regression                               Number of obs     =        637
                                                F(1, 48)          >   99999.00
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9966
                                                Root MSE          =     .27092

                                     (Std. Err. adjusted for 49 clusters in fips)
---------------------------------------------------------------------------------
                |               Robust
excess_respir~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
covid_deaths_pc |   1.048469   .0030877   339.57   0.000     1.042261    1.054677
          _cons |   .0742556   .0201948     3.68   0.001     .0336512    .1148599
---------------------------------------------------------------------------------

. 
. reg excess_deaths_pc c.covid_deaths_pc##c.p_pos [aweight=population] if days_to_report > 14, cluste
> r(fips)
(sum of wgt is 2,874,561,951)

Linear regression                               Number of obs     =        456
                                                F(3, 48)          =       5.69
                                                Prob > F          =     0.0020
                                                R-squared         =     0.6010
                                                Root MSE          =     4.3421

                                               (Std. Err. adjusted for 49 clusters in fips)
-------------------------------------------------------------------------------------------
                          |               Robust
         excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------------+----------------------------------------------------------------
          covid_deaths_pc |   .8950727   .6105204     1.47   0.149    -.3324608    2.122606
                    p_pos |  -.0253018    .023297    -1.09   0.283    -.0721435    .0215399
                          |
c.covid_deaths_pc#c.p_pos |   .0047928   .0153224     0.31   0.756    -.0260149    .0356005
                          |
                    _cons |   .3675855   .6857982     0.54   0.594    -1.011304    1.746475
-------------------------------------------------------------------------------------------

. reg excess_deaths_pc c.covid_deaths_pc##c.p_pos c.covid_deaths_pc##c.end_week [aweight=population] 
> if days_to_report > 14, cluster(fips)
(sum of wgt is 2,874,561,951)
note: covid_deaths_pc omitted because of collinearity

Linear regression                               Number of obs     =        456
                                                F(5, 48)          =       8.53
                                                Prob > F          =     0.0000
                                                R-squared         =     0.6025
                                                Root MSE          =     4.3433

                                                  (Std. Err. adjusted for 49 clusters in fips)
----------------------------------------------------------------------------------------------
                             |               Robust
            excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
             covid_deaths_pc |   138.2403   261.6405     0.53   0.600    -387.8233    664.3039
                       p_pos |  -.0268777   .0260718    -1.03   0.308    -.0792987    .0255432
                             |
   c.covid_deaths_pc#c.p_pos |   .0009637   .0135407     0.07   0.944    -.0262618    .0281892
                             |
             covid_deaths_pc |          0  (omitted)
                    end_week |   .0000147   .0204581     0.00   0.999    -.0411191    .0411484
                             |
c.covid_deaths_pc#c.end_week |  -.0062298   .0118743    -0.52   0.602    -.0301046     .017645
                             |
                       _cons |    -.00489   450.1501    -0.00   1.000    -905.0923    905.0825
----------------------------------------------------------------------------------------------

. reg excess_respir_deaths_pc c.covid_deaths_pc##c.p_pos [aweight=population] if days_to_report > 14,
>  cluster(fips)
(sum of wgt is 2,561,350,802)

Linear regression                               Number of obs     =        407
                                                F(3, 48)          =   43105.57
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9978
                                                Root MSE          =      .2626

                                               (Std. Err. adjusted for 49 clusters in fips)
-------------------------------------------------------------------------------------------
                          |               Robust
  excess_respir_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------------+----------------------------------------------------------------
          covid_deaths_pc |   .9688624   .0173486    55.85   0.000     .9339808    1.003744
                    p_pos |   .0040016   .0018218     2.20   0.033     .0003387    .0076645
                          |
c.covid_deaths_pc#c.p_pos |   .0018287    .000482     3.79   0.000     .0008595    .0027979
                          |
                    _cons |   .1294966   .0330805     3.91   0.000     .0629839    .1960093
-------------------------------------------------------------------------------------------

. reg excess_respir_deaths_pc c.covid_deaths_pc##c.p_pos c.covid_deaths_pc##c.end_week [aweight=popul
> ation] if days_to_report > 14, cluster(fips)
(sum of wgt is 2,561,350,802)
note: covid_deaths_pc omitted because of collinearity

Linear regression                               Number of obs     =        407
                                                F(5, 48)          =   77448.79
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9983
                                                Root MSE          =     .23228

                                                  (Std. Err. adjusted for 49 clusters in fips)
----------------------------------------------------------------------------------------------
                             |               Robust
     excess_respir_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
             covid_deaths_pc |    56.9695   12.38844     4.60   0.000     32.06088    81.87812
                       p_pos |   .0026651   .0019717     1.35   0.183    -.0012994    .0066296
                             |
   c.covid_deaths_pc#c.p_pos |   .0002441    .000297     0.82   0.415    -.0003531    .0008413
                             |
             covid_deaths_pc |          0  (omitted)
                    end_week |  -.0022282   .0012132    -1.84   0.072    -.0046675     .000211
                             |
c.covid_deaths_pc#c.end_week |    -.00254   .0005624    -4.52   0.000    -.0036707   -.0014093
                             |
                       _cons |   49.16544   26.71856     1.84   0.072    -4.555828    102.8867
----------------------------------------------------------------------------------------------

. reg excess_deaths_pc c.excess_respir_deaths_pc##c.p_pos [aweight=population] if days_to_report > 14
> , cluster(fips)
(sum of wgt is 2,561,350,802)

Linear regression                               Number of obs     =        407
                                                F(3, 48)          =       6.10
                                                Prob > F          =     0.0013
                                                R-squared         =     0.6232
                                                Root MSE          =     4.4043

                                                       (Std. Err. adjusted for 49 clusters in fips)
---------------------------------------------------------------------------------------------------
                                  |               Robust
                 excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------------------+----------------------------------------------------------------
          excess_respir_deaths_pc |   .9272906   .6097128     1.52   0.135    -.2986192      2.1532
                            p_pos |  -.0159192   .0246295    -0.65   0.521      -.06544    .0336017
                                  |
c.excess_respir_deaths_pc#c.p_pos |    .002784   .0147063     0.19   0.851    -.0267851    .0323531
                                  |
                            _cons |  -.1694933   .7401319    -0.23   0.820    -1.657628    1.318642
---------------------------------------------------------------------------------------------------

. reg excess_deaths_pc c.excess_respir_deaths_pc##c.p_pos c.covid_deaths_pc##c.end_week [aweight=popu
> lation] if days_to_report > 14, cluster(fips)
(sum of wgt is 2,561,350,802)

Linear regression                               Number of obs     =        407
                                                F(6, 48)          =      13.64
                                                Prob > F          =     0.0000
                                                R-squared         =     0.6280
                                                Root MSE          =     4.3926

                                                       (Std. Err. adjusted for 49 clusters in fips)
---------------------------------------------------------------------------------------------------
                                  |               Robust
                 excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------------------+----------------------------------------------------------------
          excess_respir_deaths_pc |   .9106518   .9009949     1.01   0.317    -.9009198    2.722224
                            p_pos |  -.0275011   .0273273    -1.01   0.319    -.0824463    .0274442
                                  |
c.excess_respir_deaths_pc#c.p_pos |  -.0011425   .0125742    -0.09   0.928    -.0264248    .0241397
                                  |
                  covid_deaths_pc |   91.81232   283.7824     0.32   0.748    -478.7705    662.3951
                         end_week |  -.0283549   .0245003    -1.16   0.253    -.0776161    .0209063
                                  |
     c.covid_deaths_pc#c.end_week |  -.0041595   .0128611    -0.32   0.748    -.0300185    .0216995
                                  |
                            _cons |   624.1339   539.0684     1.16   0.253    -459.7358    1708.004
---------------------------------------------------------------------------------------------------

. 
. reg f.adj_excess_deaths_pc c.new_pos_pc##c.p_pos [aweight=population] if days_to_report > 14, clust
> er(fips)
(sum of wgt is 2,874,561,951)

Linear regression                               Number of obs     =        456
                                                F(3, 48)          =       9.48
                                                Prob > F          =     0.0000
                                                R-squared         =     0.5367
                                                Root MSE          =     5.2652

                                          (Std. Err. adjusted for 49 clusters in fips)
--------------------------------------------------------------------------------------
F.                   |               Robust
adj_excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
          new_pos_pc |   .0377071   .0309935     1.22   0.230    -.0246095    .1000236
               p_pos |  -.0907252   .0379265    -2.39   0.021    -.1669814   -.0144689
                     |
c.new_pos_pc#c.p_pos |   .0015224   .0009758     1.56   0.125    -.0004395    .0034843
                     |
               _cons |   1.857939    .810182     2.29   0.026     .2289592    3.486919
--------------------------------------------------------------------------------------

. reg f.adj_excess_respir_deaths_pc c.new_pos_pc##c.p_pos [aweight=population] if days_to_report > 14
> , cluster(fips)
(sum of wgt is 2,248,139,653)

Linear regression                               Number of obs     =        358
                                                F(3, 48)          =     604.20
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9291
                                                Root MSE          =     1.6201

                                          (Std. Err. adjusted for 49 clusters in fips)
--------------------------------------------------------------------------------------
F.                   |               Robust
adj_excess_respir_~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
          new_pos_pc |   .0368931   .0110452     3.34   0.002     .0146853    .0591009
               p_pos |   .0134928   .0086353     1.56   0.125    -.0038697    .0308553
                     |
c.new_pos_pc#c.p_pos |   .0011368   .0003685     3.08   0.003     .0003958    .0018778
                     |
               _cons |   .3518258   .2354061     1.49   0.142    -.1214899    .8251415
--------------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  C:\Users\favero\Documents\GitHub\covid-underreporting\code\..\logs\cleandata.txt
  log type:  text
 closed on:  10 Jun 2020, 14:41:57
-----------------------------------------------------------------------------------------------------
