-----------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\favero\Documents\GitHub\covid-underreporting\code\..\logs\cleandata.txt
  log type:  text
 opened on:  26 May 2020, 14:23:42

. 
. use "..\data\population.dta" // start from this file because it has both fips codes and state names

. 
. merge 1:m fips using "..\data\covidtracking.dta", keep(2 3)

    Result                           # of obs.
    -----------------------------------------
    not matched                           355
        from master                         0  (_merge==1)
        from using                        355  (_merge==2)

    matched                             4,198  (_merge==3)
    -----------------------------------------

. drop _merge population // merge population back in later because want it merged to all observations
> , even those missing from the current dataset

. 
. merge 1:1 state date using "..\data\cdc_deaths.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                         4,222
        from master                     3,937  (_merge==1)
        from using                        285  (_merge==2)

    matched                               616  (_merge==3)
    -----------------------------------------

. drop _merge

. 
. merge 1:1 state date using "..\data\cdc_historical_deaths.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                        22,890
        from master                     4,072  (_merge==1)
        from using                     18,818  (_merge==2)

    matched                               766  (_merge==3)
    -----------------------------------------

. drop _merge

. 
. drop fips

. merge m:1 state using "..\data\population.dta", keep(1 3)

    Result                           # of obs.
    -----------------------------------------
    not matched                           389
        from master                       389  (_merge==1)
        from using                          0  (_merge==2)

    matched                            23,267  (_merge==3)
    -----------------------------------------

. drop _merge

. order date fips

. sort fips state date

. 
. drop if fips > 56
(389 observations deleted)

. 
. encode dataqualitygrade, gen(datagrade)

. order datagrade, after(dataqualitygrade)

. drop dataqualitygrade

. 
. gen end_week = date + mod(6 - dow(date), 7)

. format end_week %tdCCYYNNDD

. order end_week, after(date)

. 
. foreach var of varlist positive-datagrade death-pneumon_influ_or_covid numinfluenzadeaths-percentco
> mplete {
  2.         gen `var'_mis = (`var'==.)
  3. }

. gen dayscollapsed = 1

. collapse (firstnm) state report_date epi_week (lastnm) positive-datagrade population death-posneg (
> sum) deathincrease-pneumon_influ_or_covid numinfluenzadeaths-percentcomplete *_mis dayscollapsed, b
> y(end_week fips)

. foreach var of varlist positive-datagrade {
  2.         replace `var' = . if `var'_mis > 0
  3. }
(0 real changes made)
(16 real changes made, 16 to missing)
(51 real changes made, 51 to missing)
(52 real changes made, 52 to missing)
(48 real changes made, 48 to missing)
(35 real changes made, 35 to missing)
(18 real changes made, 18 to missing)
(28 real changes made, 28 to missing)
(12 real changes made, 12 to missing)
(45 real changes made, 45 to missing)
(51 real changes made, 51 to missing)

. foreach var of varlist death-pneumon_influ_or_covid numinfluenzadeaths-percentcomplete {
  2.         replace `var' = . if `var'_mis == dayscollapsed
  3. }
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(19,083 real changes made, 19,083 to missing)
(19,083 real changes made, 19,083 to missing)
(19,083 real changes made, 19,083 to missing)
(19,083 real changes made, 19,083 to missing)
(19,083 real changes made, 19,083 to missing)
(18,870 real changes made, 18,870 to missing)
(18,870 real changes made, 18,870 to missing)
(18,870 real changes made, 18,870 to missing)
(18,870 real changes made, 18,870 to missing)
(18,870 real changes made, 18,870 to missing)
(18,870 real changes made, 18,870 to missing)
(18,870 real changes made, 18,870 to missing)
(153 real changes made, 153 to missing)
(153 real changes made, 153 to missing)
(153 real changes made, 153 to missing)
(153 real changes made, 153 to missing)

. drop *_mis

. 
. xtset fips end_week, delta(7)
       panel variable:  fips (strongly balanced)
        time variable:  end_week, 20130105 to 20200530
                delta:  7 days

. 
. gen new_pos = d.positive if d.positive>=0
(19,120 missing values generated)

. gen new_neg = d.negative if d.negative>=0
(19,164 missing values generated)

. gen p_pos = new_pos/(new_pos+new_neg)*100
(19,164 missing values generated)

. order new_pos-p_pos, after(negative)

. 
. // adjust expected deaths for reporting lag: https://www.cdc.gov/nchs/data/vsrr/report001.pdf
. // maybe also somehow adjust for how the individual state was doing relative to expectations pre-co
> vid
. gen days_to_report = report_date - end_week
(18,870 missing values generated)

. 
. drop if fips == 9 | fips == 37 // Connecticut and North Carolina's data look highly problematic, so
>  dropping them
(774 observations deleted)

. 
. /*
> gen allcause_minus_posscovid = total_deaths - pneumon_influ_or_covid
> gen allcause_minus_posscovid_pc  = allcause_minus_posscovid*1000000/population
> bys days_to_report: sum allcause_minus_posscovid_pc
> gen adj_allcause_minus_posscovid_pc = allcause_minus_posscovid_pc
> replace adj_allcause_minus_posscovid_pc = allcause_minus_posscovid_pc * 212 / 93 if days_to_report 
> <= 7 & days_to_report != .
> replace adj_allcause_minus_posscovid_pc = allcause_minus_posscovid_pc * 212 / 159 if days_to_report
>  > 7 & days_to_report <= 14
> replace adj_allcause_minus_posscovid_pc = allcause_minus_posscovid_pc * 212 / 192 if days_to_report
>  > 14 & days_to_report <= 21
> */
. 
. //gen adj_expected_deaths = expected_deaths
. //replace adj_expected_deaths = expected_deaths * 93 / 212 if days_to_report <= 7 & days_to_report 
> != .
. //replace adj_expected_deaths = expected_deaths * 159 / 212 if days_to_report > 7 & days_to_report 
> <= 14
. //replace adj_expected_deaths = expected_deaths * 192 / 212 if days_to_report > 14 & days_to_report
>  <= 21
. gen adj_expected_deaths = expected_deaths * (1-exp(-.09246997*days_to_report))
(18,130 missing values generated)

. order adj_expected_deaths, after(expected_deaths)

. 
. gen pneumon_or_influ_fluview = numinfluenzadeaths + numpneumoniadeaths if end_week < date("20200201
> ","YMD")
(882 missing values generated)

. gen mmwrweek = substr(epi_week,-2,2)
(147 missing values generated)

. 
. //egen old_expected_influ_pneu_deaths = mean(pneumon_or_influ_fluview), by(fips mmwrweek)
. 
. // generate expected influenza/pneumonia deaths based on historical patterns
.         gen epi_year = substr(epi_week,1,4)
(147 missing values generated)

.         destring epi_year mmwrweek, replace
epi_year: all characters numeric; replaced as int
(147 missing values generated)
mmwrweek: all characters numeric; replaced as byte
(147 missing values generated)

.         replace epi_year = epi_year + 1 if mmwrweek >= 40
(4,508 real changes made)

. 
.         gen mmwrweek2 = mmwrweek - 39 if mmwrweek >= 40
(14,455 missing values generated)

.         replace mmwrweek2 = l.mmwrweek2 + 1 if mmwrweek < 40
(12,397 real changes made)

.         replace mmwrweek2 = mmwrweek + 13 if mmwrweek2 == .
(1,911 real changes made)

.         //gen pi_time = 2*_pi*mmwrweek2/52.1775
.         //gen sin_time = sin(pi_time)
.         //gen cos_time = cos(pi_time)
.         //gen halfsin_time = sin(pi_time/2)
.         //gen halfcos_time = cos(pi_time/2)
. 
.         gen pneumon_or_influ_fluview_pc = pneumon_or_influ_fluview * 1000000 / population
(882 missing values generated)

.         
.         // most year-to-year variation in influenza severity seems to be from weeks 50 to 8; thus, 
> create a sin spike for this period with a year-varying coefficient
.         gen fluseason = 0 if mmwrweek != .
(147 missing values generated)

.         replace fluseason = 1 if (mmwrweek >= 50 | mmwrweek <= 8) & mmwrweek != .
(4,214 real changes made)

.         gen fluseason_sin_time = sin(fluseason*_pi*(mmwrweek2-10)/12)
(147 missing values generated)

.         
.         reg pneumon_or_influ_fluview_pc i.fips i.epi_year i.mmwrweek i.epi_year#c.fluseason_sin_tim
> e [aweight=population]
(sum of wgt is 115,934,690,088)

      Source |       SS           df       MS      Number of obs   =    18,081
-------------+----------------------------------   F(115, 17965)   =    521.03
       Model |  201013.657       115  1747.94485   Prob > F        =    0.0000
    Residual |  60268.2363    17,965  3.35475849   R-squared       =    0.7693
-------------+----------------------------------   Adj R-squared   =    0.7679
       Total |  261281.894    18,080  14.4514322   Root MSE        =    1.8316

-----------------------------------------------------------------------------------------------
  pneumon_or_influ_fluview_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                         fips |
                           2  |  -5.825264   .3026146   -19.25   0.000    -6.418418    -5.23211
                           4  |  -3.205597     .14106   -22.73   0.000    -3.482088   -2.929106
                           5  |   3.051991   .1766518    17.28   0.000     2.705736    3.398245
                           6  |  -2.268413   .1156045   -19.62   0.000    -2.495009   -2.041817
                           8  |  -4.727203   .1483638   -31.86   0.000     -5.01801   -4.436396
                          10  |  -1.437599   .2678693    -5.37   0.000    -1.962649   -.9125496
                          11  |  -4.478159   .3073893   -14.57   0.000    -5.080672   -3.875647
                          12  |  -2.283191   .1208438   -18.89   0.000    -2.520057   -2.046326
                          13  |   -4.12139   .1318313   -31.26   0.000    -4.379792   -3.862988
                          15  |    2.76329   .2303498    12.00   0.000     2.311783    3.214798
                          16  |  -3.940811    .210972   -18.68   0.000    -4.354336   -3.527286
                          17  |  -1.206361   .1284109    -9.39   0.000    -1.458059   -.9546634
                          18  |   .7863893   .1433459     5.49   0.000     .5054175    1.067361
                          19  |   1.232255   .1742568     7.07   0.000     .8906953    1.573816
                          20  |   .2982263    .178602     1.67   0.095    -.0518508    .6483033
                          21  |   4.487376   .1579148    28.42   0.000     4.177848    4.796904
                          22  |  -2.867302   .1562969   -18.35   0.000    -3.173659   -2.560945
                          23  |   2.510922   .2350658    10.68   0.000     2.050171    2.971674
                          24  |  -1.675401   .1467357   -11.42   0.000    -1.963017   -1.387785
                          25  |   .3082243   .1426418     2.16   0.031     .0286326     .587816
                          26  |  -.5319895   .1331396    -4.00   0.000     -.792956   -.2710231
                          27  |  -2.334791   .1490825   -15.66   0.000    -2.627007   -2.042575
                          28  |   2.135278   .1774154    12.04   0.000     1.787527    2.483029
                          29  |     .11761   .1462437     0.80   0.421    -.1690417    .4042617
                          30  |  -1.525114    .257744    -5.92   0.000    -2.030317   -1.019911
                          31  |   .2108836   .2049988     1.03   0.304    -.1909338     .612701
                          32  |  -1.912617   .1755415   -10.90   0.000    -2.256695   -1.568538
                          33  |  -.8291304    .234012    -3.54   0.000    -1.287816   -.3704445
                          34  |  -2.831354   .1358386   -20.84   0.000    -3.097611   -2.565098
                          35  |  -.6795766    .199224    -3.41   0.001    -1.070075   -.2890783
                          36  |   .1661381   .1220068     1.36   0.173    -.0730069     .405283
                          38  |   .9772469   .2972953     3.29   0.001     .3945195    1.559974
                          39  |   -.025399   .1299081    -0.20   0.845    -.2800314    .2292335
                          40  |   3.447875   .1631598    21.13   0.000     3.128066    3.767684
                          41  |  -3.377835   .1603443   -21.07   0.000    -3.692125   -3.063545
                          42  |  -.0079482   .1282287    -0.06   0.951    -.2592887    .2433923
                          44  |    1.63297   .2586829     6.31   0.000     1.125927    2.140013
                          45  |  -.2027137   .1523521    -1.33   0.183    -.5013384    .0959111
                          46  |   2.430771   .2788973     8.72   0.000     1.884105    2.977436
                          47  |   2.196776   .1429165    15.37   0.000     1.916646    2.476906
                          48  |  -3.041931   .1178961   -25.80   0.000    -3.273018   -2.810843
                          49  |  -5.313371   .1734133   -30.64   0.000    -5.653278   -4.973465
                          50  |   1.005237   .3245166     3.10   0.002     .3691536    1.641321
                          51  |  -3.291503   .1368162   -24.06   0.000    -3.559676    -3.02333
                          53  |  -2.774458   .1398011   -19.85   0.000    -3.048482   -2.500435
                          54  |   7.406932   .2107526    35.15   0.000     6.993837    7.820028
                          55  |  -1.767177   .1479901   -11.94   0.000    -2.057252   -1.477102
                          56  |  -.7957156    .335577    -2.37   0.018    -1.453479   -.1379524
                              |
                     epi_year |
                        2014  |  -.2863546   .0621445    -4.61   0.000    -.4081638   -.1645454
                        2015  |  -.0503765   .0623012    -0.81   0.419    -.1724927    .0717398
                        2016  |   -.136425   .0621445    -2.20   0.028    -.2582342   -.0146158
                        2017  |  -.2242134   .0621445    -3.61   0.000    -.3460226   -.1024042
                        2018  |   -.496476   .0621445    -7.99   0.000    -.6182852   -.3746668
                        2019  |    -.57876   .0621445    -9.31   0.000    -.7005692   -.4569509
                        2020  |  -.9323278     .09971    -9.35   0.000    -1.127769   -.7368868
                              |
                     mmwrweek |
                           2  |   .9432872   .1433907     6.58   0.000     .6622276    1.224347
                           3  |   .4353523   .1507673     2.89   0.004     .1398338    .7308707
                           4  |  -.0463079   .1392351    -0.33   0.739    -.3192221    .2266063
                           5  |   .0899989   .1382404     0.65   0.515    -.1809655    .3609634
                           6  |   .6169963   .1883154     3.28   0.001     .2478801    .9861125
                           7  |   1.805674   .2990116     6.04   0.000     1.219583    2.391766
                           8  |   2.913603   .4440624     6.56   0.000     2.043199    3.784008
                           9  |    3.73297   .5803815     6.43   0.000     2.595366    4.870573
                          10  |   3.626572   .5803815     6.25   0.000     2.488969    4.764176
                          11  |   3.281918   .5803815     5.65   0.000     2.144314    4.419521
                          12  |   2.772211   .5803815     4.78   0.000     1.634607    3.909814
                          13  |   2.442106   .5803815     4.21   0.000     1.304503     3.57971
                          14  |    2.20976   .5803815     3.81   0.000     1.072156    3.347363
                          15  |   1.877382   .5803815     3.23   0.001     .7397783    3.014985
                          16  |   1.300836   .5803815     2.24   0.025     .1632321    2.438439
                          17  |   .7774879   .5803815     1.34   0.180    -.3601156    1.915091
                          18  |   .4664803   .5803815     0.80   0.422    -.6711231    1.604084
                          19  |   .1954853   .5803815     0.34   0.736    -.9421181    1.333089
                          20  |  -.1828163   .5803815    -0.31   0.753     -1.32042    .9547872
                          21  |  -.2341962   .5803815    -0.40   0.687      -1.3718    .9034073
                          22  |  -.6302307   .5803815    -1.09   0.278    -1.767834    .5073727
                          23  |  -.3987938   .5803815    -0.69   0.492    -1.536397    .7388096
                          24  |  -.6174995   .5803815    -1.06   0.287    -1.755103     .520104
                          25  |  -.8134706   .5803815    -1.40   0.161    -1.951074    .3241328
                          26  |  -.9457853   .5803815    -1.63   0.103    -2.083389    .1918182
                          27  |  -1.124478   .5803815    -1.94   0.053    -2.262082    .0131252
                          28  |     -1.049   .5803815    -1.81   0.071    -2.186603    .0886037
                          29  |     -1.335   .5803815    -2.30   0.021    -2.472603    -.197396
                          30  |  -1.346367   .5803815    -2.32   0.020     -2.48397   -.2087633
                          31  |  -1.411387   .5803815    -2.43   0.015    -2.548991   -.2737838
                          32  |   -1.49596   .5803815    -2.58   0.010    -2.633563   -.3583561
                          33  |  -1.476863   .5803815    -2.54   0.011    -2.614466   -.3392592
                          34  |  -1.430939   .5803815    -2.47   0.014    -2.568542   -.2933355
                          35  |  -1.535518   .5803815    -2.65   0.008    -2.673121   -.3979141
                          36  |  -1.354096   .5803815    -2.33   0.020      -2.4917    -.216493
                          37  |  -1.162672   .5803815    -2.00   0.045    -2.300276   -.0250687
                          38  |  -1.041725   .5803815    -1.79   0.073    -2.179328    .0958787
                          39  |  -1.020354   .5803815    -1.76   0.079    -2.157958    .1172491
                          40  |  -.6293558   .5803044    -1.08   0.278    -1.766808    .5080966
                          41  |  -.5916165   .5803044    -1.02   0.308    -1.729069    .5458359
                          42  |  -.3028886   .5803044    -0.52   0.602    -1.440341    .8345637
                          43  |  -.2283196   .5803044    -0.39   0.694    -1.365772    .9091328
                          44  |  -.2242274   .5803044    -0.39   0.699     -1.36168     .913225
                          45  |   -.082819   .5803044    -0.14   0.887    -1.220271    1.054633
                          46  |   .0376738   .5803044     0.06   0.948    -1.099779    1.175126
                          47  |   .1099694   .5803044     0.19   0.850    -1.027483    1.247422
                          48  |   .5041852   .5803044     0.87   0.385    -.6332672    1.641638
                          49  |    .999342   .5803044     1.72   0.085    -.1381103    2.136794
                          50  |   .1230895   .4203192     0.29   0.770    -.7007766    .9469556
                          51  |  -.9015919   .2781439    -3.24   0.001    -1.446781   -.3564031
                          52  |  -.9695968   .1746016    -5.55   0.000    -1.311833   -.6273608
                          53  |   .8631074   .2925835     2.95   0.003     .2896157    1.436599
                              |
epi_year#c.fluseason_sin_time |
                        2013  |   7.851516   .6485306    12.11   0.000     6.580334    9.122698
                        2014  |   5.757474   .6475322     8.89   0.000     4.488249      7.0267
                        2015  |   8.378202    .674693    12.42   0.000     7.055739    9.700665
                        2016  |   2.471254   .6475322     3.82   0.000     1.202028    3.740479
                        2017  |    5.06053   .6475322     7.82   0.000     3.791305    6.329756
                        2018  |   10.79833   .6475322    16.68   0.000     9.529101    12.06755
                        2019  |   3.367439   .6475322     5.20   0.000     2.098213    4.636664
                        2020  |   4.147721   .6629906     6.26   0.000     2.848196    5.447246
                              |
                        _cons |   11.55233   .5850235    19.75   0.000     10.40563    12.69903
-----------------------------------------------------------------------------------------------

.         predict expected_influ_pneu_deaths_pc
(option xb assumed; fitted values)
(147 missing values generated)

.         gen expected_influ_pneu_deaths = expected_influ_pneu_deaths_pc * population / 1000000
(147 missing values generated)

. 
. //gen adj_expected_influ_pneu_deaths = expected_influ_pneu_deaths
. //replace adj_expected_influ_pneu_deaths = expected_influ_pneu_deaths * 93 / 212 if days_to_report 
> <= 7 & days_to_report != .
. //replace adj_expected_influ_pneu_deaths = expected_influ_pneu_deaths * 159 / 212 if days_to_report
>  > 7 & days_to_report <= 14
. //replace adj_expected_influ_pneu_deaths = expected_influ_pneu_deaths * 192 / 212 if days_to_report
>  > 14 & days_to_report <= 21
. gen adj_expected_influ_pneu_deaths = expected_influ_pneu_deaths * (1-exp(-.09246997*days_to_report)
> )
(18,228 missing values generated)

. order adj_expected_influ_pneu_deaths, after(expected_influ_pneu_deaths)

. 
. replace covid_deaths = 5 if covid_deaths == . & total_deaths != . //rough imputation for where data
>  is supressed for 1-9 deaths
(0 real changes made)

. 
. 
. gen cumulative_covdeath = covid_deaths
(18,130 missing values generated)

. replace cumulative_covdeath = cumulative_covdeath + l.cumulative_covdeath if l.cumulative_covdeath 
> != .
(454 real changes made)

. 
. //gen adj_covid_deaths = covid_deaths
. //replace adj_covid_deaths = covid_deaths * 212 / 93 if days_to_report <= 7 & days_to_report != .
. //replace adj_covid_deaths = covid_deaths * 212 / 159 if days_to_report > 7 & days_to_report <= 14
. //replace adj_covid_deaths = covid_deaths * 212 / 192 if days_to_report > 14 & days_to_report <= 21
. 
. gen adj_covid_deaths = covid_deaths / (1-exp(-.09246997*days_to_report))
(18,130 missing values generated)

. gen adj_cumulative_covdeath = adj_covid_deaths
(18,130 missing values generated)

. replace adj_cumulative_covdeath = adj_cumulative_covdeath + l.adj_cumulative_covdeath if l.adj_cumu
> lative_covdeath != .
(454 real changes made)

. 
. gen adj_total_deaths = total_deaths / (1-exp(-.09246997*days_to_report))
(18,130 missing values generated)

. gen adj_pneumon_influ_or_covid = pneumon_influ_or_covid / (1-exp(-.09246997*days_to_report))
(18,130 missing values generated)

. 
. 
. gen covdeath_pc = covid_deaths*1000000/population
(18,130 missing values generated)

. gen excess_deaths_pc = (total_deaths-adj_expected_deaths)*1000000/population
(18,130 missing values generated)

. gen excess_respir_deaths_pc = (pneumon_influ_or_covid-adj_expected_influ_pneu_deaths)*1000000/popul
> ation
(18,228 missing values generated)

. gen adj_excess_deaths_pc = (adj_total_deaths-expected_deaths)*1000000/population
(18,130 missing values generated)

. gen adj_excess_respir_deaths_pc = (adj_pneumon_influ_or_covid-expected_influ_pneu_deaths)*1000000/p
> opulation
(18,228 missing values generated)

. gen new_pos_pc = new_pos*1000000/population
(18,370 missing values generated)

. gen new_neg_pc = new_neg*1000000/population
(18,411 missing values generated)

. gen new_tests_pc = new_pos_pc + new_neg_pc
(18,411 missing values generated)

. gen deathincrease_pc = deathincrease*1000000/population
(18,334 missing values generated)

. gen adj_covid_deaths_pc = adj_covid_deaths*1000000/population
(18,130 missing values generated)

. 
. /*
> gen log_covdeath = log(covid_deaths)
>         //replace log_covdeath = 2 if covid_deaths==0
> gen log_allcause = log(total_deaths)
> gen log_expected = log(adj_expected_deaths)
> gen excess_deaths = log_allcause-log_expected
> */
. 
. save "..\data\weeklydata.dta", replace
file ..\data\weeklydata.dta saved

. 
. 
. reg excess_deaths_pc covdeath_pc [aweight=population] if days_to_report > 14, cluster(fips) nocons
(sum of wgt is 4,712,792,280)

Linear regression                               Number of obs     =        735
                                                F(1, 48)          =    6736.47
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9289
                                                Root MSE          =      16.67

                                  (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
excess_dea~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 covdeath_pc |   1.357013   .0165336    82.08   0.000      1.32377    1.390256
------------------------------------------------------------------------------

. margins, dydx(covdeath_pc)

Average marginal effects                        Number of obs     =        735
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : covdeath_pc

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 covdeath_pc |   1.357013   .0165336    82.08   0.000      1.32377    1.390256
------------------------------------------------------------------------------

. 
. twoway (scatter excess_deaths_pc covdeath_pc if days_to_report > 14, mcolor(%30) yline(0)) (functio
> n y=x, range(0 300))

. 
. reg excess_deaths_pc covdeath_pc [aweight=population] if days_to_report > 14, cluster(fips)
(sum of wgt is 4,712,792,280)

Linear regression                               Number of obs     =        735
                                                F(1, 48)          =    5755.02
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9212
                                                Root MSE          =     16.659

                                  (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
excess_dea~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 covdeath_pc |   1.364073    .017981    75.86   0.000     1.327919    1.400226
       _cons |  -.9140146   2.143838    -0.43   0.672    -5.224489     3.39646
------------------------------------------------------------------------------

. reg excess_deaths_pc c.covdeath_pc c.p_pos [aweight=population] if days_to_report > 14, cluster(fip
> s)
(sum of wgt is 2,568,711,386)

Linear regression                               Number of obs     =        407
                                                F(2, 48)          =    2998.00
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9500
                                                Root MSE          =     16.633

                                  (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
excess_dea~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 covdeath_pc |   1.334294   .0202494    65.89   0.000      1.29358    1.375008
       p_pos |   .1683397   .1402378     1.20   0.236    -.1136273    .4503066
       _cons |  -1.513885   2.621367    -0.58   0.566    -6.784497    3.756726
------------------------------------------------------------------------------

. reg excess_deaths_pc c.covdeath_pc##c.p_pos [aweight=population] if days_to_report > 14, cluster(fi
> ps)
(sum of wgt is 2,568,711,386)

Linear regression                               Number of obs     =        407
                                                F(3, 48)          =    2559.84
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9548
                                                Root MSE          =     15.836

                                           (Std. Err. adjusted for 49 clusters in fips)
---------------------------------------------------------------------------------------
                      |               Robust
     excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
          covdeath_pc |   1.034926   .0801514    12.91   0.000     .8737707    1.196081
                p_pos |   .0457594   .1055836     0.43   0.667    -.1665308    .2580495
                      |
c.covdeath_pc#c.p_pos |   .0079189    .002323     3.41   0.001     .0032482    .0125896
                      |
                _cons |   2.640711   2.326115     1.14   0.262    -2.036256    7.317679
---------------------------------------------------------------------------------------

. reg excess_deaths_pc c.covdeath_pc c.new_pos_pc c.new_neg_pc [aweight=population] if days_to_report
>  > 14, cluster(fips)
(sum of wgt is 2,568,711,386)

Linear regression                               Number of obs     =        407
                                                F(3, 48)          =    5228.67
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9559
                                                Root MSE          =     15.637

                                  (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
excess_dea~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 covdeath_pc |   1.212258   .0633504    19.14   0.000     1.084884    1.339633
  new_pos_pc |   .0160308   .0071396     2.25   0.029     .0016756     .030386
  new_neg_pc |  -.0030738   .0009077    -3.39   0.001    -.0048988   -.0012488
       _cons |   5.182408   2.031106     2.55   0.014     1.098595     9.26622
------------------------------------------------------------------------------

. reg excess_deaths_pc c.covdeath_pc##c.new_pos_pc c.covdeath_pc##c.new_neg_pc [aweight=population] i
> f days_to_report > 14, cluster(fips)
(sum of wgt is 2,568,711,386)
note: covdeath_pc omitted because of collinearity

Linear regression                               Number of obs     =        407
                                                F(5, 48)          =    2841.81
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9584
                                                Root MSE          =      15.22

                                                (Std. Err. adjusted for 49 clusters in fips)
--------------------------------------------------------------------------------------------
                           |               Robust
          excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------------+----------------------------------------------------------------
               covdeath_pc |    1.24525   .1038819    11.99   0.000     1.036381    1.454118
                new_pos_pc |   .0141439   .0060851     2.32   0.024     .0019091    .0263787
                           |
c.covdeath_pc#c.new_pos_pc |   .0000473    .000023     2.05   0.045     9.89e-07    .0000936
                           |
               covdeath_pc |          0  (omitted)
                new_neg_pc |  -.0016905   .0009562    -1.77   0.083    -.0036132    .0002321
                           |
c.covdeath_pc#c.new_neg_pc |  -.0000351   .0000116    -3.04   0.004    -.0000583   -.0000119
                           |
                     _cons |   3.233776    2.16893     1.49   0.143     -1.12715    7.594702
--------------------------------------------------------------------------------------------

. reg excess_deaths_pc c.covdeath_pc c.new_tests_pc [aweight=population] if days_to_report > 14, clus
> ter(fips)
(sum of wgt is 2,568,711,386)

Linear regression                               Number of obs     =        407
                                                F(2, 48)          =    5027.48
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9527
                                                Root MSE          =     16.166

                                  (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
excess_dea~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 covdeath_pc |   1.405447   .0233609    60.16   0.000     1.358477    1.452417
new_tests_pc |  -.0020447   .0006874    -2.97   0.005    -.0034269   -.0006626
       _cons |   5.729729    1.99575     2.87   0.006     1.717004    9.742454
------------------------------------------------------------------------------

. reg excess_deaths_pc c.covdeath_pc##c.new_tests_pc [aweight=population] if days_to_report > 14, clu
> ster(fips)
(sum of wgt is 2,568,711,386)

Linear regression                               Number of obs     =        407
                                                F(3, 48)          =    2180.41
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9543
                                                Root MSE          =     15.918

                                                  (Std. Err. adjusted for 49 clusters in fips)
----------------------------------------------------------------------------------------------
                             |               Robust
            excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                 covdeath_pc |    1.59603   .1198122    13.32   0.000     1.355132    1.836929
                new_tests_pc |  -.0015019   .0006631    -2.27   0.028     -.002835   -.0001687
                             |
c.covdeath_pc#c.new_tests_pc |  -.0000274   .0000141    -1.95   0.058    -.0000558    9.19e-07
                             |
                       _cons |   3.110045   2.221048     1.40   0.168    -1.355671    7.575761
----------------------------------------------------------------------------------------------

. reg excess_deaths_pc c.covdeath_pc##c.new_tests_pc c.covdeath_pc##c.p_pos [aweight=population] if d
> ays_to_report > 14, cluster(fips)
(sum of wgt is 2,568,711,386)
note: covdeath_pc omitted because of collinearity

Linear regression                               Number of obs     =        407
                                                F(5, 48)          =    2243.61
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9559
                                                Root MSE          =     15.672

                                                  (Std. Err. adjusted for 49 clusters in fips)
----------------------------------------------------------------------------------------------
                             |               Robust
            excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                 covdeath_pc |   1.292428   .1661002     7.78   0.000     .9584614    1.626395
                new_tests_pc |  -.0009501   .0010066    -0.94   0.350     -.002974    .0010738
                             |
c.covdeath_pc#c.new_tests_pc |  -.0000169   .0000113    -1.50   0.139    -.0000396    5.69e-06
                             |
                 covdeath_pc |          0  (omitted)
                       p_pos |  -.0335601   .1192999    -0.28   0.780    -.2734286    .2063084
                             |
       c.covdeath_pc#c.p_pos |   .0054429   .0031418     1.73   0.090     -.000874    .0117598
                             |
                       _cons |   4.420229   2.765139     1.60   0.116    -1.139455    9.979913
----------------------------------------------------------------------------------------------

. reg excess_deaths_pc c.covdeath_pc##c.new_tests_pc##c.p_pos [aweight=population] if days_to_report 
> > 14, cluster(fips)
(sum of wgt is 2,568,711,386)

Linear regression                               Number of obs     =        407
                                                F(7, 48)          =    8188.62
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9589
                                                Root MSE          =     15.168

                                                   (Std. Err. adjusted for 49 clusters in fips)
-----------------------------------------------------------------------------------------------
                              |               Robust
             excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                  covdeath_pc |   1.313461   .2151583     6.10   0.000     .8808561    1.746066
                 new_tests_pc |  -.0022346   .0009931    -2.25   0.029    -.0042314   -.0002379
                              |
 c.covdeath_pc#c.new_tests_pc |   -.000043   .0000222    -1.94   0.059    -.0000876    1.63e-06
                              |
                        p_pos |  -.1588327    .095535    -1.66   0.103    -.3509186    .0332533
                              |
        c.covdeath_pc#c.p_pos |  -.0018035   .0048793    -0.37   0.713     -.011614     .008007
                              |
       c.new_tests_pc#c.p_pos |   .0001945   .0000638     3.05   0.004     .0000662    .0003227
                              |
 c.covdeath_pc#c.new_tests_pc#|
                      c.p_pos |   1.01e-06   6.31e-07     1.60   0.115    -2.57e-07    2.28e-06
                              |
                        _cons |   5.579785   1.904929     2.93   0.005     1.749668    9.409902
-----------------------------------------------------------------------------------------------

. 
. gen covdeath_pcXp_pos = covdeath_pc * p_pos
(18,458 missing values generated)

. reghv excess_deaths_pc covdeath_pc p_pos covdeath_pcXp_pos if days_to_report > 14, var( new_tests_p
> c covdeath_pc population) twostage cluster(fips)

Multiplicative heteroscedastic regression             Number of obs  =     407
Estimator: 2sls                                       Model chi2(6)  = 852.105
                                                      Prob > chi2    =   0.000
Log Likelihood              = -1792.651               Pseudo R2      =  0.1920
                                                      VWLS R2        =  0.9033
                                  (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
excess_dea~c |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
lp_mean      |
 covdeath_pc |   .9651018   .0951807    10.14   0.000      .778551    1.151653
       p_pos |    .084461   .0806725     1.05   0.295    -.0736542    .2425763
covdeath_p~s |   .0092952   .0027415     3.39   0.001     .0039221    .0146684
       _cons |  -1.757293   2.196678    -0.80   0.424    -6.062702    2.548117
-------------+----------------------------------------------------------------
lp_lnvar     |
new_tests_pc |   .0002424   .0001657     1.46   0.143    -.0000823    .0005672
 covdeath_pc |  -.0045387   .0093122    -0.49   0.626    -.0227903    .0137129
  population |  -1.26e-08   7.64e-08    -0.17   0.869    -1.62e-07    1.37e-07
       _cons |   5.162825   .9039088     5.71   0.000     3.391196    6.934454
------------------------------------------------------------------------------

. reghv excess_deaths_pc covdeath_pc p_pos covdeath_pcXp_pos if days_to_report > 14, var( new_tests_p
> c covdeath_pc population) cluster(fips)

iteration 1:  Log-likelihood =     -1770  |delta-b|     2.804 
iteration 2:  Log-likelihood =     -1766  |delta-b|     1.568 
iteration 3:  Log-likelihood =     -1765  |delta-b|     .5242 
iteration 4:  Log-likelihood =     -1765  |delta-b|     .2907 
iteration 5:  Log-likelihood =     -1765  |delta-b|    .01992 
iteration 6:  Log-likelihood =     -1765  |delta-b|    .02162 
iteration 7:  Log-likelihood =     -1765  |delta-b|   .007185 
iteration 8:  Log-likelihood =     -1765  |delta-b|   .003462 
iteration 9:  Log-likelihood =     -1765  |delta-b|   .001315 

Multiplicative heteroscedastic regression             Number of obs  =     407
Estimator: mle                                        Model chi2(6)  = 906.534
                                                      Prob > chi2    =   0.000
Log Likelihood              = -1765.437               Pseudo R2      =  0.2043
                                                      VWLS R2        =  0.9001
                                  (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
excess_dea~c |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
lp_mean      |
 covdeath_pc |   1.125114   .0861744    13.06   0.000     .9562157    1.294013
       p_pos |  -.0631706   .0705592    -0.90   0.371    -.2014641    .0751229
covdeath_p~s |   .0061299    .002428     2.52   0.012     .0013712    .0108886
       _cons |   3.396258   1.877746     1.81   0.070    -.2840565    7.076572
-------------+----------------------------------------------------------------
lp_lnvar     |
new_tests_pc |   .0002591   .0000611     4.24   0.000     .0001393     .000379
 covdeath_pc |  -.0015799   .0035157    -0.45   0.653    -.0084706    .0053107
  population |  -7.78e-08   1.93e-08    -4.02   0.000    -1.16e-07   -3.99e-08
       _cons |   5.487058   .3299419    16.63   0.000     4.840383    6.133732
------------------------------------------------------------------------------

. drop covdeath_pcXp_pos

. 
. 
. 
. reg deathincrease_pc adj_covid_deaths_pc [aweight=population] if days_to_report > 7, cluster(fips)
(sum of wgt is 3,453,559,742)

Linear regression                               Number of obs     =        530
                                                F(1, 48)          =    1003.16
                                                Prob > F          =     0.0000
                                                R-squared         =     0.8949
                                                Root MSE          =     13.987

                                         (Std. Err. adjusted for 49 clusters in fips)
-------------------------------------------------------------------------------------
                    |               Robust
   deathincrease_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
adj_covid_deaths_pc |    .823644   .0260049    31.67   0.000     .7713577    .8759304
              _cons |   3.682269   .8557446     4.30   0.000     1.961679    5.402858
-------------------------------------------------------------------------------------

. reg deathincrease_pc adj_covid_deaths_pc l.adj_covid_deaths_pc [aweight=population] if days_to_repo
> rt > 7, cluster(fips)
(sum of wgt is 3,445,944,849)

Linear regression                               Number of obs     =        529
                                                F(2, 48)          =    1483.51
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9325
                                                Root MSE          =     11.233

                                         (Std. Err. adjusted for 49 clusters in fips)
-------------------------------------------------------------------------------------
                    |               Robust
   deathincrease_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
adj_covid_deaths_pc |
                --. |    .491643   .1298479     3.79   0.000     .2305662    .7527197
                L1. |     .37227   .1672794     2.23   0.031     .0359322    .7086078
                    |
              _cons |   3.195057   .6761789     4.73   0.000     1.835509    4.554606
-------------------------------------------------------------------------------------

. reg deathincrease_pc c.adj_covid_deaths_pc##c.p_pos [aweight=population] if days_to_report > 7, clu
> ster(fips)
(sum of wgt is 2,882,897,538)

Linear regression                               Number of obs     =        456
                                                F(3, 48)          =     446.95
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9072
                                                Root MSE          =     14.009

                                                   (Std. Err. adjusted for 49 clusters in fips)
-----------------------------------------------------------------------------------------------
                              |               Robust
             deathincrease_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
          adj_covid_deaths_pc |   1.118214   .0361299    30.95   0.000      1.04557    1.190858
                        p_pos |  -.0676145   .0498327    -1.36   0.181    -.1678099     .032581
                              |
c.adj_covid_deaths_pc#c.p_pos |  -.0076794   .0006161   -12.47   0.000    -.0089181   -.0064408
                              |
                        _cons |   2.743662    .813394     3.37   0.001     1.108224      4.3791
-----------------------------------------------------------------------------------------------

. reg deathincrease_pc c.adj_covid_deaths_pc##c.new_tests_pc [aweight=population] if days_to_report >
>  7, cluster(fips)
(sum of wgt is 2,882,897,538)

Linear regression                               Number of obs     =        456
                                                F(3, 48)          =     980.97
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9183
                                                Root MSE          =     13.145

                                            (Std. Err. adjusted for 49 clusters in fips)
----------------------------------------------------------------------------------------
                       |               Robust
      deathincrease_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------+----------------------------------------------------------------
   adj_covid_deaths_pc |   .7918032   .0616444    12.84   0.000     .6678588    .9157477
          new_tests_pc |   .0029957   .0006765     4.43   0.000     .0016355     .004356
                       |
 c.adj_covid_deaths_pc#|
        c.new_tests_pc |  -6.05e-06   7.44e-06    -0.81   0.420     -.000021    8.91e-06
                       |
                 _cons |  -4.718051   1.599185    -2.95   0.005    -7.933428   -1.502674
----------------------------------------------------------------------------------------

. reg deathincrease_pc c.adj_covid_deaths_pc##c.new_tests_pc c.l.adj_covid_deaths_pc##c.new_tests_pc 
> [aweight=population] if days_to_report > 7, cluster(fips)
(sum of wgt is 2,882,897,538)
note: new_tests_pc omitted because of collinearity

Linear regression                               Number of obs     =        456
                                                F(5, 48)          =    2891.46
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9471
                                                Root MSE          =     10.602

                                             (Std. Err. adjusted for 49 clusters in fips)
-----------------------------------------------------------------------------------------
                        |               Robust
       deathincrease_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
    adj_covid_deaths_pc |   .3694781   .1216821     3.04   0.004     .1248198    .6141364
           new_tests_pc |   .0026265   .0006907     3.80   0.000     .0012378    .0040153
                        |
  c.adj_covid_deaths_pc#|
         c.new_tests_pc |    .000015   .0000266     0.56   0.576    -.0000385    .0000685
                        |
    adj_covid_deaths_pc |
                    L1. |   .6204824    .112413     5.52   0.000      .394461    .8465038
                        |
           new_tests_pc |          0  (omitted)
                        |
 cL.adj_covid_deaths_pc#|
         c.new_tests_pc |  -.0000403   .0000269    -1.50   0.141    -.0000945    .0000138
                        |
                  _cons |  -4.459985   1.494719    -2.98   0.004    -7.465319   -1.454652
-----------------------------------------------------------------------------------------

. reg deathincrease_pc c.excess_deaths_pc##c.new_tests_pc c.l.excess_deaths_pc##c.new_tests_pc [aweig
> ht=population] if days_to_report > 7, cluster(fips)
(sum of wgt is 2,882,897,538)
note: new_tests_pc omitted because of collinearity

Linear regression                               Number of obs     =        456
                                                F(5, 48)          =     584.18
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9060
                                                Root MSE          =     14.132

                                                        (Std. Err. adjusted for 49 clusters in fips)
----------------------------------------------------------------------------------------------------
                                   |               Robust
                  deathincrease_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------------------+----------------------------------------------------------------
                  excess_deaths_pc |   .0806314   .0967586     0.83   0.409    -.1139148    .2751775
                      new_tests_pc |   .0041171   .0007782     5.29   0.000     .0025525    .0056817
                                   |
 c.excess_deaths_pc#c.new_tests_pc |   .0000187   .0000221     0.85   0.402    -.0000258    .0000632
                                   |
                  excess_deaths_pc |
                               L1. |   .5382299   .1091609     4.93   0.000     .3187472    .7577125
                                   |
                      new_tests_pc |          0  (omitted)
                                   |
cL.excess_deaths_pc#c.new_tests_pc |  -.0000277   .0000215    -1.29   0.203    -.0000709    .0000155
                                   |
                             _cons |  -6.214518   2.315066    -2.68   0.010    -10.86927   -1.559767
----------------------------------------------------------------------------------------------------

. 
. 
. reg excess_deaths_pc covdeath_pc [aweight=population] if days_to_report > 14, cluster(fips)
(sum of wgt is 4,712,792,280)

Linear regression                               Number of obs     =        735
                                                F(1, 48)          =    5755.02
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9212
                                                Root MSE          =     16.659

                                  (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
excess_dea~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 covdeath_pc |   1.364073    .017981    75.86   0.000     1.327919    1.400226
       _cons |  -.9140146   2.143838    -0.43   0.672    -5.224489     3.39646
------------------------------------------------------------------------------

. reg excess_respir_deaths_pc covdeath_pc [aweight=population] if days_to_report > 14, cluster(fips)
(sum of wgt is 4,712,792,280)

Linear regression                               Number of obs     =        735
                                                F(1, 48)          >   99999.00
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9960
                                                Root MSE          =     2.7878

                                  (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
excess_res~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 covdeath_pc |   1.050747   .0032734   320.99   0.000     1.044166    1.057329
       _cons |    .396745   .2612613     1.52   0.135    -.1285561     .922046
------------------------------------------------------------------------------

. 
. reg excess_deaths_pc c.covdeath_pc##c.p_pos [aweight=population] if days_to_report > 14, cluster(fi
> ps)
(sum of wgt is 2,568,711,386)

Linear regression                               Number of obs     =        407
                                                F(3, 48)          =    2559.84
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9548
                                                Root MSE          =     15.836

                                           (Std. Err. adjusted for 49 clusters in fips)
---------------------------------------------------------------------------------------
                      |               Robust
     excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
          covdeath_pc |   1.034926   .0801514    12.91   0.000     .8737707    1.196081
                p_pos |   .0457594   .1055836     0.43   0.667    -.1665308    .2580495
                      |
c.covdeath_pc#c.p_pos |   .0079189    .002323     3.41   0.001     .0032482    .0125896
                      |
                _cons |   2.640711   2.326115     1.14   0.262    -2.036256    7.317679
---------------------------------------------------------------------------------------

. reg excess_respir_deaths_pc c.covdeath_pc##c.p_pos [aweight=population] if days_to_report > 14, clu
> ster(fips)
(sum of wgt is 2,568,711,386)

Linear regression                               Number of obs     =        407
                                                F(3, 48)          =   36615.80
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9974
                                                Root MSE          =     2.8873

                                           (Std. Err. adjusted for 49 clusters in fips)
---------------------------------------------------------------------------------------
                      |               Robust
excess_respir_death~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
          covdeath_pc |   .9707717   .0195314    49.70   0.000     .9315012    1.010042
                p_pos |   .0473972   .0203122     2.33   0.024     .0065568    .0882375
                      |
c.covdeath_pc#c.p_pos |   .0018088   .0005119     3.53   0.001     .0007795    .0028382
                      |
                _cons |   .7919326   .4611641     1.72   0.092    -.1352999    1.719165
---------------------------------------------------------------------------------------

. 
. reg f.adj_excess_deaths_pc c.new_pos_pc##c.p_pos [aweight=population] if days_to_report > 14, clust
> er(fips)
(sum of wgt is 2,568,711,386)

Linear regression                               Number of obs     =        407
                                                F(3, 48)          =      35.29
                                                Prob > F          =     0.0000
                                                R-squared         =     0.7378
                                                Root MSE          =     42.705

                                          (Std. Err. adjusted for 49 clusters in fips)
--------------------------------------------------------------------------------------
F.                   |               Robust
adj_excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
          new_pos_pc |   .0132052   .0152937     0.86   0.392     -.017545    .0439553
               p_pos |   .5296134   .2133786     2.48   0.017     .1005869    .9586398
                     |
c.new_pos_pc#c.p_pos |   .0021528   .0004936     4.36   0.000     .0011604    .0031453
                     |
               _cons |  -4.160471   5.023666    -0.83   0.412    -14.26123    5.940287
--------------------------------------------------------------------------------------

. reg f.adj_excess_respir_deaths_pc c.new_pos_pc##c.p_pos [aweight=population] if days_to_report > 14
> , cluster(fips)
(sum of wgt is 2,254,525,234)

Linear regression                               Number of obs     =        358
                                                F(3, 48)          =     124.53
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9049
                                                Root MSE          =     18.911

                                          (Std. Err. adjusted for 49 clusters in fips)
--------------------------------------------------------------------------------------
F.                   |               Robust
adj_excess_respir_~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
          new_pos_pc |   .0327194    .012056     2.71   0.009     .0084792    .0569597
               p_pos |    .144312   .0915476     1.58   0.122    -.0397569    .3283809
                     |
c.new_pos_pc#c.p_pos |   .0012189   .0004042     3.02   0.004     .0004063    .0020316
                     |
               _cons |   2.442377   2.550649     0.96   0.343    -2.686047    7.570802
--------------------------------------------------------------------------------------

. 
. 
. log close
      name:  <unnamed>
       log:  C:\Users\favero\Documents\GitHub\covid-underreporting\code\..\logs\cleandata.txt
  log type:  text
 closed on:  26 May 2020, 14:23:56
-----------------------------------------------------------------------------------------------------
