-----------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\favero\Documents\GitHub\covid-underreporting\data\..\logs\cleandata.txt
  log type:  text
 opened on:  22 May 2020, 16:17:14

. 
. use "..\data\population.dta" // start from this file because it has both fips codes and state names

. 
. merge 1:m fips using "..\data\covidtracking.dta", keep(2 3)

    Result                           # of obs.
    -----------------------------------------
    not matched                           330
        from master                         0  (_merge==1)
        from using                        330  (_merge==2)

    matched                             3,943  (_merge==3)
    -----------------------------------------

. drop _merge population // merge population back in later because want it merged to all observations
> , even those missing from the current dataset

. 
. merge 1:1 state date using "..\data\cdc_deaths.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                         3,991
        from master                     3,708  (_merge==1)
        from using                        283  (_merge==2)

    matched                               565  (_merge==3)
    -----------------------------------------

. drop _merge

. 
. merge 1:1 state date using "..\data\cdc_historical_deaths.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                        22,608
        from master                     3,790  (_merge==1)
        from using                     18,818  (_merge==2)

    matched                               766  (_merge==3)
    -----------------------------------------

. drop _merge

. 
. drop fips

. merge m:1 state using "..\data\population.dta", keep(1 3)

    Result                           # of obs.
    -----------------------------------------
    not matched                           362
        from master                       362  (_merge==1)
        from using                          0  (_merge==2)

    matched                            23,012  (_merge==3)
    -----------------------------------------

. drop _merge

. order date fips

. sort fips state date

. 
. drop if fips > 56
(362 observations deleted)

. 
. encode dataqualitygrade, gen(datagrade)

. order datagrade, after(dataqualitygrade)

. drop dataqualitygrade

. 
. gen end_week = date + mod(6 - dow(date), 7)

. format end_week %tdCCYYNNDD

. order end_week, after(date)

. 
. foreach var of varlist positive-datagrade death-pneumon_influ_or_covid numinfluenzadeaths-percentco
> mplete {
  2.         gen `var'_mis = (`var'==.)
  3. }

. gen dayscollapsed = 1

. collapse (firstnm) state report_date epi_week (lastnm) positive-datagrade population death-posneg (
> sum) deathincrease-pneumon_influ_or_covid numinfluenzadeaths-percentcomplete *_mis dayscollapsed, b
> y(end_week fips)

. foreach var of varlist positive-datagrade {
  2.         replace `var' = . if `var'_mis > 0
  3. }
(0 real changes made)
(16 real changes made, 16 to missing)
(51 real changes made, 51 to missing)
(49 real changes made, 49 to missing)
(47 real changes made, 47 to missing)
(32 real changes made, 32 to missing)
(18 real changes made, 18 to missing)
(27 real changes made, 27 to missing)
(12 real changes made, 12 to missing)
(43 real changes made, 43 to missing)
(52 real changes made, 52 to missing)

. foreach var of varlist death-pneumon_influ_or_covid numinfluenzadeaths-percentcomplete {
  2.         replace `var' = . if `var'_mis == dayscollapsed
  3. }
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(19,083 real changes made, 19,083 to missing)
(19,083 real changes made, 19,083 to missing)
(19,083 real changes made, 19,083 to missing)
(19,083 real changes made, 19,083 to missing)
(19,083 real changes made, 19,083 to missing)
(18,870 real changes made, 18,870 to missing)
(18,870 real changes made, 18,870 to missing)
(18,870 real changes made, 18,870 to missing)
(18,870 real changes made, 18,870 to missing)
(18,870 real changes made, 18,870 to missing)
(18,870 real changes made, 18,870 to missing)
(18,870 real changes made, 18,870 to missing)
(102 real changes made, 102 to missing)
(102 real changes made, 102 to missing)
(102 real changes made, 102 to missing)
(102 real changes made, 102 to missing)

. drop *_mis

. 
. xtset fips end_week, delta(7)
       panel variable:  fips (strongly balanced)
        time variable:  end_week, 20130105 to 20200523
                delta:  7 days

. 
. gen new_pos = d.positive if d.positive>=0
(19,120 missing values generated)

. gen new_neg = d.negative if d.negative>=0
(19,162 missing values generated)

. gen p_pos = new_pos/(new_pos+new_neg)*100
(19,162 missing values generated)

. order new_pos-p_pos, after(negative)

. 
. // adjust expected deaths for reporting lag: https://www.cdc.gov/nchs/data/vsrr/report001.pdf
. // maybe also somehow adjust for how the individual state was doing relative to expectations pre-co
> vid
. gen days_to_report = report_date - end_week
(18,870 missing values generated)

. 
. drop if fips == 9 | fips == 37 // Connecticut and North Carolina's data look highly problematic, so
>  dropping them
(772 observations deleted)

. 
. /*
> gen allcause_minus_posscovid = total_deaths - pneumon_influ_or_covid
> gen allcause_minus_posscovid_pc  = allcause_minus_posscovid*1000000/population
> bys days_to_report: sum allcause_minus_posscovid_pc
> gen adj_allcause_minus_posscovid_pc = allcause_minus_posscovid_pc
> replace adj_allcause_minus_posscovid_pc = allcause_minus_posscovid_pc * 212 / 93 if days_to_report 
> <= 7 & days_to_report != .
> replace adj_allcause_minus_posscovid_pc = allcause_minus_posscovid_pc * 212 / 159 if days_to_report
>  > 7 & days_to_report <= 14
> replace adj_allcause_minus_posscovid_pc = allcause_minus_posscovid_pc * 212 / 192 if days_to_report
>  > 14 & days_to_report <= 21
> */
. 
. //gen adj_expected_deaths = expected_deaths
. //replace adj_expected_deaths = expected_deaths * 93 / 212 if days_to_report <= 7 & days_to_report 
> != .
. //replace adj_expected_deaths = expected_deaths * 159 / 212 if days_to_report > 7 & days_to_report 
> <= 14
. //replace adj_expected_deaths = expected_deaths * 192 / 212 if days_to_report > 14 & days_to_report
>  <= 21
. gen adj_expected_deaths = expected_deaths * (1-exp(-.09246997*days_to_report))
(18,130 missing values generated)

. order adj_expected_deaths, after(expected_deaths)

. 
. gen pneumon_or_influ_fluview = numinfluenzadeaths + numpneumoniadeaths if end_week < date("20200201
> ","YMD")
(833 missing values generated)

. gen mmwrweek = substr(epi_week,-2,2)
(98 missing values generated)

. 
. //egen old_expected_influ_pneu_deaths = mean(pneumon_or_influ_fluview), by(fips mmwrweek)
. 
. // generate expected influenza/pneumonia deaths based on historical patterns
.         gen epi_year = substr(epi_week,1,4)
(98 missing values generated)

.         destring epi_year mmwrweek, replace
epi_year: all characters numeric; replaced as int
(98 missing values generated)
mmwrweek: all characters numeric; replaced as byte
(98 missing values generated)

.         replace epi_year = epi_year + 1 if mmwrweek >= 40
(4,508 real changes made)

. 
.         gen mmwrweek2 = mmwrweek - 39 if mmwrweek >= 40
(14,406 missing values generated)

.         replace mmwrweek2 = l.mmwrweek2 + 1 if mmwrweek < 40
(12,397 real changes made)

.         replace mmwrweek2 = mmwrweek + 13 if mmwrweek2 == .
(1,911 real changes made)

.         //gen pi_time = 2*_pi*mmwrweek2/52.1775
.         //gen sin_time = sin(pi_time)
.         //gen cos_time = cos(pi_time)
.         //gen halfsin_time = sin(pi_time/2)
.         //gen halfcos_time = cos(pi_time/2)
. 
.         gen pneumon_or_influ_fluview_pc = pneumon_or_influ_fluview * 1000000 / population
(833 missing values generated)

.         
.         // most year-to-year variation in influenza severity seems to be from weeks 50 to 8; thus, 
> create a sin spike for this period with a year-varying coefficient
.         gen fluseason = 0 if mmwrweek != .
(98 missing values generated)

.         replace fluseason = 1 if (mmwrweek >= 50 | mmwrweek <= 8) & mmwrweek != .
(4,214 real changes made)

.         gen fluseason_sin_time = sin(fluseason*_pi*(mmwrweek2-10)/12)
(98 missing values generated)

.         
.         reg pneumon_or_influ_fluview_pc i.fips i.epi_year i.mmwrweek i.epi_year#c.fluseason_sin_tim
> e [aweight=population]
(sum of wgt is 115,934,690,088)

      Source |       SS           df       MS      Number of obs   =    18,081
-------------+----------------------------------   F(115, 17965)   =    521.03
       Model |  201013.657       115  1747.94485   Prob > F        =    0.0000
    Residual |  60268.2363    17,965  3.35475849   R-squared       =    0.7693
-------------+----------------------------------   Adj R-squared   =    0.7679
       Total |  261281.894    18,080  14.4514322   Root MSE        =    1.8316

-----------------------------------------------------------------------------------------------
  pneumon_or_influ_fluview_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                         fips |
                           2  |  -5.825264   .3026146   -19.25   0.000    -6.418418    -5.23211
                           4  |  -3.205597     .14106   -22.73   0.000    -3.482088   -2.929106
                           5  |   3.051991   .1766518    17.28   0.000     2.705736    3.398245
                           6  |  -2.268413   .1156045   -19.62   0.000    -2.495009   -2.041817
                           8  |  -4.727203   .1483638   -31.86   0.000     -5.01801   -4.436396
                          10  |  -1.437599   .2678693    -5.37   0.000    -1.962649   -.9125496
                          11  |  -4.478159   .3073893   -14.57   0.000    -5.080672   -3.875647
                          12  |  -2.283191   .1208438   -18.89   0.000    -2.520057   -2.046326
                          13  |   -4.12139   .1318313   -31.26   0.000    -4.379792   -3.862988
                          15  |    2.76329   .2303498    12.00   0.000     2.311783    3.214798
                          16  |  -3.940811    .210972   -18.68   0.000    -4.354336   -3.527286
                          17  |  -1.206361   .1284109    -9.39   0.000    -1.458059   -.9546634
                          18  |   .7863893   .1433459     5.49   0.000     .5054175    1.067361
                          19  |   1.232255   .1742568     7.07   0.000     .8906953    1.573816
                          20  |   .2982263    .178602     1.67   0.095    -.0518508    .6483033
                          21  |   4.487376   .1579148    28.42   0.000     4.177848    4.796904
                          22  |  -2.867302   .1562969   -18.35   0.000    -3.173659   -2.560945
                          23  |   2.510922   .2350658    10.68   0.000     2.050171    2.971674
                          24  |  -1.675401   .1467357   -11.42   0.000    -1.963017   -1.387785
                          25  |   .3082243   .1426418     2.16   0.031     .0286326     .587816
                          26  |  -.5319895   .1331396    -4.00   0.000     -.792956   -.2710231
                          27  |  -2.334791   .1490825   -15.66   0.000    -2.627007   -2.042575
                          28  |   2.135278   .1774154    12.04   0.000     1.787527    2.483029
                          29  |     .11761   .1462437     0.80   0.421    -.1690417    .4042617
                          30  |  -1.525114    .257744    -5.92   0.000    -2.030317   -1.019911
                          31  |   .2108836   .2049988     1.03   0.304    -.1909338     .612701
                          32  |  -1.912617   .1755415   -10.90   0.000    -2.256695   -1.568538
                          33  |  -.8291304    .234012    -3.54   0.000    -1.287816   -.3704445
                          34  |  -2.831354   .1358386   -20.84   0.000    -3.097611   -2.565098
                          35  |  -.6795766    .199224    -3.41   0.001    -1.070075   -.2890783
                          36  |   .1661381   .1220068     1.36   0.173    -.0730069     .405283
                          38  |   .9772469   .2972953     3.29   0.001     .3945195    1.559974
                          39  |   -.025399   .1299081    -0.20   0.845    -.2800314    .2292335
                          40  |   3.447875   .1631598    21.13   0.000     3.128066    3.767684
                          41  |  -3.377835   .1603443   -21.07   0.000    -3.692125   -3.063545
                          42  |  -.0079482   .1282287    -0.06   0.951    -.2592887    .2433923
                          44  |    1.63297   .2586829     6.31   0.000     1.125927    2.140013
                          45  |  -.2027137   .1523521    -1.33   0.183    -.5013384    .0959111
                          46  |   2.430771   .2788973     8.72   0.000     1.884105    2.977436
                          47  |   2.196776   .1429165    15.37   0.000     1.916646    2.476906
                          48  |  -3.041931   .1178961   -25.80   0.000    -3.273018   -2.810843
                          49  |  -5.313371   .1734133   -30.64   0.000    -5.653278   -4.973465
                          50  |   1.005237   .3245166     3.10   0.002     .3691536    1.641321
                          51  |  -3.291503   .1368162   -24.06   0.000    -3.559676    -3.02333
                          53  |  -2.774458   .1398011   -19.85   0.000    -3.048482   -2.500435
                          54  |   7.406932   .2107526    35.15   0.000     6.993837    7.820028
                          55  |  -1.767177   .1479901   -11.94   0.000    -2.057252   -1.477102
                          56  |  -.7957156    .335577    -2.37   0.018    -1.453479   -.1379524
                              |
                     epi_year |
                        2014  |  -.2863546   .0621445    -4.61   0.000    -.4081638   -.1645454
                        2015  |  -.0503765   .0623012    -0.81   0.419    -.1724927    .0717398
                        2016  |   -.136425   .0621445    -2.20   0.028    -.2582342   -.0146158
                        2017  |  -.2242134   .0621445    -3.61   0.000    -.3460226   -.1024042
                        2018  |   -.496476   .0621445    -7.99   0.000    -.6182852   -.3746668
                        2019  |    -.57876   .0621445    -9.31   0.000    -.7005692   -.4569509
                        2020  |  -.9323278     .09971    -9.35   0.000    -1.127769   -.7368868
                              |
                     mmwrweek |
                           2  |   .9432872   .1433907     6.58   0.000     .6622276    1.224347
                           3  |   .4353523   .1507673     2.89   0.004     .1398338    .7308707
                           4  |  -.0463079   .1392351    -0.33   0.739    -.3192221    .2266063
                           5  |   .0899989   .1382404     0.65   0.515    -.1809655    .3609634
                           6  |   .6169963   .1883154     3.28   0.001     .2478801    .9861125
                           7  |   1.805674   .2990116     6.04   0.000     1.219583    2.391766
                           8  |   2.913603   .4440624     6.56   0.000     2.043199    3.784008
                           9  |    3.73297   .5803815     6.43   0.000     2.595366    4.870573
                          10  |   3.626572   .5803815     6.25   0.000     2.488969    4.764176
                          11  |   3.281918   .5803815     5.65   0.000     2.144314    4.419521
                          12  |   2.772211   .5803815     4.78   0.000     1.634607    3.909814
                          13  |   2.442106   .5803815     4.21   0.000     1.304503     3.57971
                          14  |    2.20976   .5803815     3.81   0.000     1.072156    3.347363
                          15  |   1.877382   .5803815     3.23   0.001     .7397783    3.014985
                          16  |   1.300836   .5803815     2.24   0.025     .1632321    2.438439
                          17  |   .7774879   .5803815     1.34   0.180    -.3601156    1.915091
                          18  |   .4664803   .5803815     0.80   0.422    -.6711231    1.604084
                          19  |   .1954853   .5803815     0.34   0.736    -.9421181    1.333089
                          20  |  -.1828163   .5803815    -0.31   0.753     -1.32042    .9547872
                          21  |  -.2341962   .5803815    -0.40   0.687      -1.3718    .9034073
                          22  |  -.6302307   .5803815    -1.09   0.278    -1.767834    .5073727
                          23  |  -.3987938   .5803815    -0.69   0.492    -1.536397    .7388096
                          24  |  -.6174995   .5803815    -1.06   0.287    -1.755103     .520104
                          25  |  -.8134706   .5803815    -1.40   0.161    -1.951074    .3241328
                          26  |  -.9457853   .5803815    -1.63   0.103    -2.083389    .1918182
                          27  |  -1.124478   .5803815    -1.94   0.053    -2.262082    .0131252
                          28  |     -1.049   .5803815    -1.81   0.071    -2.186603    .0886037
                          29  |     -1.335   .5803815    -2.30   0.021    -2.472603    -.197396
                          30  |  -1.346367   .5803815    -2.32   0.020     -2.48397   -.2087633
                          31  |  -1.411387   .5803815    -2.43   0.015    -2.548991   -.2737838
                          32  |   -1.49596   .5803815    -2.58   0.010    -2.633563   -.3583561
                          33  |  -1.476863   .5803815    -2.54   0.011    -2.614466   -.3392592
                          34  |  -1.430939   .5803815    -2.47   0.014    -2.568542   -.2933355
                          35  |  -1.535518   .5803815    -2.65   0.008    -2.673121   -.3979141
                          36  |  -1.354096   .5803815    -2.33   0.020      -2.4917    -.216493
                          37  |  -1.162672   .5803815    -2.00   0.045    -2.300276   -.0250687
                          38  |  -1.041725   .5803815    -1.79   0.073    -2.179328    .0958787
                          39  |  -1.020354   .5803815    -1.76   0.079    -2.157958    .1172491
                          40  |  -.6293558   .5803044    -1.08   0.278    -1.766808    .5080966
                          41  |  -.5916165   .5803044    -1.02   0.308    -1.729069    .5458359
                          42  |  -.3028886   .5803044    -0.52   0.602    -1.440341    .8345637
                          43  |  -.2283196   .5803044    -0.39   0.694    -1.365772    .9091328
                          44  |  -.2242274   .5803044    -0.39   0.699     -1.36168     .913225
                          45  |   -.082819   .5803044    -0.14   0.887    -1.220271    1.054633
                          46  |   .0376738   .5803044     0.06   0.948    -1.099779    1.175126
                          47  |   .1099694   .5803044     0.19   0.850    -1.027483    1.247422
                          48  |   .5041852   .5803044     0.87   0.385    -.6332672    1.641638
                          49  |    .999342   .5803044     1.72   0.085    -.1381103    2.136794
                          50  |   .1230895   .4203192     0.29   0.770    -.7007766    .9469556
                          51  |  -.9015919   .2781439    -3.24   0.001    -1.446781   -.3564031
                          52  |  -.9695968   .1746016    -5.55   0.000    -1.311833   -.6273608
                          53  |   .8631074   .2925835     2.95   0.003     .2896157    1.436599
                              |
epi_year#c.fluseason_sin_time |
                        2013  |   7.851516   .6485306    12.11   0.000     6.580334    9.122698
                        2014  |   5.757474   .6475322     8.89   0.000     4.488249      7.0267
                        2015  |   8.378202    .674693    12.42   0.000     7.055739    9.700665
                        2016  |   2.471254   .6475322     3.82   0.000     1.202028    3.740479
                        2017  |    5.06053   .6475322     7.82   0.000     3.791305    6.329756
                        2018  |   10.79833   .6475322    16.68   0.000     9.529101    12.06755
                        2019  |   3.367439   .6475322     5.20   0.000     2.098213    4.636664
                        2020  |   4.147721   .6629906     6.26   0.000     2.848196    5.447246
                              |
                        _cons |   11.55233   .5850235    19.75   0.000     10.40563    12.69903
-----------------------------------------------------------------------------------------------

.         predict expected_influ_pneu_deaths_pc
(option xb assumed; fitted values)
(98 missing values generated)

.         gen expected_influ_pneu_deaths = expected_influ_pneu_deaths_pc * population / 1000000
(98 missing values generated)

. 
. //gen adj_expected_influ_pneu_deaths = expected_influ_pneu_deaths
. //replace adj_expected_influ_pneu_deaths = expected_influ_pneu_deaths * 93 / 212 if days_to_report 
> <= 7 & days_to_report != .
. //replace adj_expected_influ_pneu_deaths = expected_influ_pneu_deaths * 159 / 212 if days_to_report
>  > 7 & days_to_report <= 14
. //replace adj_expected_influ_pneu_deaths = expected_influ_pneu_deaths * 192 / 212 if days_to_report
>  > 14 & days_to_report <= 21
. gen adj_expected_influ_pneu_deaths = expected_influ_pneu_deaths * (1-exp(-.09246997*days_to_report)
> )
(18,179 missing values generated)

. order adj_expected_influ_pneu_deaths, after(expected_influ_pneu_deaths)

. 
. replace covid_deaths = 5 if covid_deaths == . & total_deaths != . //rough imputation for where data
>  is supressed for 1-9 deaths
(0 real changes made)

. 
. 
. gen cumulative_covdeath = covid_deaths
(18,130 missing values generated)

. replace cumulative_covdeath = cumulative_covdeath + l.cumulative_covdeath if l.cumulative_covdeath 
> != .
(408 real changes made)

. 
. //gen adj_covid_deaths = covid_deaths
. //replace adj_covid_deaths = covid_deaths * 212 / 93 if days_to_report <= 7 & days_to_report != .
. //replace adj_covid_deaths = covid_deaths * 212 / 159 if days_to_report > 7 & days_to_report <= 14
. //replace adj_covid_deaths = covid_deaths * 212 / 192 if days_to_report > 14 & days_to_report <= 21
. 
. gen adj_covid_deaths = covid_deaths / (1-exp(-.09246997*days_to_report))
(18,130 missing values generated)

. gen adj_cumulative_covdeath = adj_covid_deaths
(18,130 missing values generated)

. replace adj_cumulative_covdeath = adj_cumulative_covdeath + l.adj_cumulative_covdeath if l.adj_cumu
> lative_covdeath != .
(408 real changes made)

. 
. 
. 
. gen covdeath_pc = covid_deaths*1000000/population
(18,130 missing values generated)

. gen excess_deaths_pc = (total_deaths-adj_expected_deaths)*1000000/population
(18,130 missing values generated)

. gen excess_respir_deaths_pc = (pneumon_influ_or_covid-adj_expected_influ_pneu_deaths)*1000000/popul
> ation
(18,179 missing values generated)

. gen new_pos_pc = new_pos*1000000/population
(18,370 missing values generated)

. gen new_neg_pc = new_neg*1000000/population
(18,409 missing values generated)

. gen new_tests_pc = new_pos_pc + new_neg_pc
(18,409 missing values generated)

. gen deathincrease_pc = deathincrease*1000000/population
(18,334 missing values generated)

. gen adj_covid_deaths_pc = adj_covid_deaths*1000000/population
(18,130 missing values generated)

. 
. /*
> gen log_covdeath = log(covid_deaths)
>         //replace log_covdeath = 2 if covid_deaths==0
> gen log_allcause = log(total_deaths)
> gen log_expected = log(adj_expected_deaths)
> gen excess_deaths = log_allcause-log_expected
> */
. 
. save "..\data\weeklydata.dta", replace
file ..\data\weeklydata.dta saved

. 
. 
. reg excess_deaths_pc covdeath_pc [aweight=population] if days_to_report > 14, cluster(fips) nocons
(sum of wgt is 4,398,606,128)

Linear regression                               Number of obs     =        686
                                                F(1, 48)          =    4176.66
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9349
                                                Root MSE          =     16.321

                                  (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
excess_dea~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 covdeath_pc |   1.406564   .0217643    64.63   0.000     1.362804    1.450324
------------------------------------------------------------------------------

. margins, dydx(covdeath_pc)

Average marginal effects                        Number of obs     =        686
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : covdeath_pc

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 covdeath_pc |   1.406564   .0217643    64.63   0.000     1.362804    1.450324
------------------------------------------------------------------------------

. 
. twoway (scatter excess_deaths_pc covdeath_pc if days_to_report > 14, mcolor(%30) yline(0)) (functio
> n y=x, range(0 300))

. 
. reg excess_deaths_pc covdeath_pc [aweight=population] if days_to_report > 14, cluster(fips)
(sum of wgt is 4,398,606,128)

Linear regression                               Number of obs     =        686
                                                F(1, 48)          =    3408.29
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9277
                                                Root MSE          =     16.332

                                  (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
excess_dea~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 covdeath_pc |   1.404898   .0240645    58.38   0.000     1.356513    1.453282
       _cons |   .2258274   2.201095     0.10   0.919    -4.199772    4.651426
------------------------------------------------------------------------------

. reg excess_deaths_pc c.covdeath_pc c.p_pos [aweight=population] if days_to_report > 14, cluster(fip
> s)
(sum of wgt is 2,254,525,234)

Linear regression                               Number of obs     =        358
                                                F(2, 48)          =    2280.61
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9587
                                                Root MSE          =     15.808

                                  (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
excess_dea~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 covdeath_pc |   1.372106   .0266572    51.47   0.000     1.318508    1.425704
       p_pos |   .1030605   .1484627     0.69   0.491    -.1954438    .4015648
       _cons |   1.850327    2.41297     0.77   0.447    -3.001274    6.701928
------------------------------------------------------------------------------

. reg excess_deaths_pc c.covdeath_pc##c.p_pos [aweight=population] if days_to_report > 14, cluster(fi
> ps)
(sum of wgt is 2,254,525,234)

Linear regression                               Number of obs     =        358
                                                F(3, 48)          =    5004.58
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9643
                                                Root MSE          =     14.726

                                           (Std. Err. adjusted for 49 clusters in fips)
---------------------------------------------------------------------------------------
                      |               Robust
     excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
          covdeath_pc |   1.008637   .0934178    10.80   0.000     .8208082    1.196466
                p_pos |  -.0253226    .108581    -0.23   0.817    -.2436393    .1929941
                      |
c.covdeath_pc#c.p_pos |   .0094126   .0022408     4.20   0.000     .0049071    .0139181
                      |
                _cons |   6.401726   1.932052     3.31   0.002     2.517075    10.28638
---------------------------------------------------------------------------------------

. reg excess_deaths_pc c.covdeath_pc c.new_pos_pc c.new_neg_pc [aweight=population] if days_to_report
>  > 14, cluster(fips)
(sum of wgt is 2,254,525,234)

Linear regression                               Number of obs     =        358
                                                F(3, 48)          =    3221.10
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9631
                                                Root MSE          =     14.977

                                  (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
excess_dea~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 covdeath_pc |   1.188659   .0733725    16.20   0.000     1.041134    1.336185
  new_pos_pc |   .0198214   .0076036     2.61   0.012     .0045334    .0351094
  new_neg_pc |  -.0026696   .0012072    -2.21   0.032    -.0050968   -.0002424
       _cons |   5.576946    2.22748     2.50   0.016     1.098298    10.05559
------------------------------------------------------------------------------

. reg excess_deaths_pc c.covdeath_pc##c.new_pos_pc c.covdeath_pc##c.new_neg_pc [aweight=population] i
> f days_to_report > 14, cluster(fips)
(sum of wgt is 2,254,525,234)
note: covdeath_pc omitted because of collinearity

Linear regression                               Number of obs     =        358
                                                F(5, 48)          =    3295.00
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9682
                                                Root MSE          =     13.933

                                                (Std. Err. adjusted for 49 clusters in fips)
--------------------------------------------------------------------------------------------
                           |               Robust
          excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------------+----------------------------------------------------------------
               covdeath_pc |   1.274339   .1227788    10.38   0.000     1.027476    1.521203
                new_pos_pc |    .016697   .0060095     2.78   0.008     .0046141    .0287798
                           |
c.covdeath_pc#c.new_pos_pc |   .0000673   .0000249     2.70   0.010     .0000172    .0001175
                           |
               covdeath_pc |          0  (omitted)
                new_neg_pc |  -.0004335   .0009919    -0.44   0.664    -.0024278    .0015609
                           |
c.covdeath_pc#c.new_neg_pc |  -.0000596   .0000101    -5.88   0.000      -.00008   -.0000392
                           |
                     _cons |   2.504063   2.206629     1.13   0.262    -1.932662    6.940787
--------------------------------------------------------------------------------------------

. reg excess_deaths_pc c.covdeath_pc c.new_tests_pc [aweight=population] if days_to_report > 14, clus
> ter(fips)
(sum of wgt is 2,254,525,234)

Linear regression                               Number of obs     =        358
                                                F(2, 48)          =    2526.30
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9594
                                                Root MSE          =     15.676

                                  (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
excess_dea~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 covdeath_pc |    1.41703    .028118    50.40   0.000     1.360495    1.473565
new_tests_pc |  -.0012754   .0007954    -1.60   0.115    -.0028746    .0003238
       _cons |   5.963713   2.200238     2.71   0.009     1.539838    10.38759
------------------------------------------------------------------------------

. reg excess_deaths_pc c.covdeath_pc##c.new_tests_pc [aweight=population] if days_to_report > 14, clu
> ster(fips)
(sum of wgt is 2,254,525,234)

Linear regression                               Number of obs     =        358
                                                F(3, 48)          =    2888.22
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9629
                                                Root MSE          =     15.016

                                                  (Std. Err. adjusted for 49 clusters in fips)
----------------------------------------------------------------------------------------------
                             |               Robust
            excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                 covdeath_pc |   1.722903   .1250825    13.77   0.000     1.471408    1.974398
                new_tests_pc |  -.0005422   .0006755    -0.80   0.426    -.0019003    .0008159
                             |
c.covdeath_pc#c.new_tests_pc |  -.0000436   .0000147    -2.96   0.005    -.0000733    -.000014
                             |
                       _cons |   2.245017   2.276471     0.99   0.329    -2.332134    6.822168
----------------------------------------------------------------------------------------------

. reg excess_deaths_pc c.covdeath_pc##c.new_tests_pc c.covdeath_pc##c.p_pos [aweight=population] if d
> ays_to_report > 14, cluster(fips)
(sum of wgt is 2,254,525,234)
note: covdeath_pc omitted because of collinearity

Linear regression                               Number of obs     =        358
                                                F(5, 48)          =    3421.14
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9656
                                                Root MSE          =     14.496

                                                  (Std. Err. adjusted for 49 clusters in fips)
----------------------------------------------------------------------------------------------
                             |               Robust
            excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                 covdeath_pc |   1.279898   .1829394     7.00   0.000     .9120738    1.647722
                new_tests_pc |   .0003856   .0010621     0.36   0.718    -.0017499    .0025212
                             |
c.covdeath_pc#c.new_tests_pc |  -.0000288   .0000115    -2.50   0.016     -.000052   -5.68e-06
                             |
                 covdeath_pc |          0  (omitted)
                       p_pos |  -.0507959   .1107566    -0.46   0.649    -.2734869    .1718951
                             |
       c.covdeath_pc#c.p_pos |    .007831   .0031873     2.46   0.018     .0014226    .0142395
                             |
                       _cons |   4.004797   2.625681     1.53   0.134    -1.274489    9.284083
----------------------------------------------------------------------------------------------

. reg excess_deaths_pc c.covdeath_pc##c.new_tests_pc##c.p_pos [aweight=population] if days_to_report 
> > 14, cluster(fips)
(sum of wgt is 2,254,525,234)

Linear regression                               Number of obs     =        358
                                                F(7, 48)          =    8194.66
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9687
                                                Root MSE          =     13.855

                                                   (Std. Err. adjusted for 49 clusters in fips)
-----------------------------------------------------------------------------------------------
                              |               Robust
             excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                  covdeath_pc |   1.391078   .2295615     6.06   0.000     .9295132    1.852642
                 new_tests_pc |  -.0010715   .0010444    -1.03   0.310    -.0031714    .0010283
                              |
 c.covdeath_pc#c.new_tests_pc |  -.0000748   .0000238    -3.15   0.003    -.0001226   -.0000271
                              |
                        p_pos |  -.1534557   .0958149    -1.60   0.116    -.3461045     .039193
                              |
        c.covdeath_pc#c.p_pos |  -.0033339   .0044667    -0.75   0.459    -.0123148    .0056471
                              |
       c.new_tests_pc#c.p_pos |   .0002137   .0000656     3.26   0.002     .0000818    .0003457
                              |
 c.covdeath_pc#c.new_tests_pc#|
                      c.p_pos |   1.67e-06   5.51e-07     3.04   0.004     5.66e-07    2.78e-06
                              |
                        _cons |   4.706354   2.122745     2.22   0.031     .4382888    8.974419
-----------------------------------------------------------------------------------------------

. 
. gen covdeath_pcXp_pos = covdeath_pc * p_pos
(18,458 missing values generated)

. reghv excess_deaths_pc covdeath_pc p_pos covdeath_pcXp_pos if days_to_report > 14, var( new_tests_p
> c covdeath_pc population) twostage cluster(fips)

Multiplicative heteroscedastic regression             Number of obs  =     358
Estimator: 2sls                                       Model chi2(6)  = 820.322
                                                      Prob > chi2    =   0.000
Log Likelihood              = -1553.584               Pseudo R2      =  0.2089
                                                      VWLS R2        =  0.9563
                                  (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
excess_dea~c |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
lp_mean      |
 covdeath_pc |   .9872306   .1003906     9.83   0.000     .7904686    1.183993
       p_pos |    .055501   .0786084     0.71   0.480    -.0985685    .2095706
covdeath_p~s |   .0098665    .002531     3.90   0.000     .0049058    .0148272
       _cons |    .759112   2.038971     0.37   0.710    -3.237198    4.755422
-------------+----------------------------------------------------------------
lp_lnvar     |
new_tests_pc |   .0002623   .0002183     1.20   0.230    -.0001655    .0006901
 covdeath_pc |  -.0080674   .0133221    -0.61   0.545    -.0341782    .0180434
  population |  -1.80e-08   7.58e-08    -0.24   0.812    -1.67e-07    1.31e-07
       _cons |   5.100591   .9276403     5.50   0.000      3.28245    6.918733
------------------------------------------------------------------------------

. reghv excess_deaths_pc covdeath_pc p_pos covdeath_pcXp_pos if days_to_report > 14, var( new_tests_p
> c covdeath_pc population) cluster(fips)

iteration 1:  Log-likelihood =     -1535  |delta-b|     2.058 
iteration 2:  Log-likelihood =     -1532  |delta-b|     .9949 
iteration 3:  Log-likelihood =     -1532  |delta-b|     .8195 
iteration 4:  Log-likelihood =     -1532  |delta-b|     .1012 
iteration 5:  Log-likelihood =     -1532  |delta-b|    .05409 
iteration 6:  Log-likelihood =     -1532  |delta-b|  .0009588 
iteration 7:  Log-likelihood =     -1532  |delta-b|   .002975 

Multiplicative heteroscedastic regression             Number of obs  =     358
Estimator: mle                                        Model chi2(6)  = 864.102
                                                      Prob > chi2    =   0.000
Log Likelihood              = -1531.694               Pseudo R2      =  0.2200
                                                      VWLS R2        =  0.9049
                                  (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
excess_dea~c |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
lp_mean      |
 covdeath_pc |   1.176968   .1076485    10.93   0.000     .9659808    1.387955
       p_pos |  -.0854838   .0710914    -1.20   0.229    -.2248203    .0538527
covdeath_p~s |   .0060955   .0024537     2.48   0.013     .0012864    .0109046
       _cons |   4.753579   1.811164     2.62   0.009     1.203764    8.303395
-------------+----------------------------------------------------------------
lp_lnvar     |
new_tests_pc |   .0002678   .0000776     3.45   0.001     .0001157    .0004198
 covdeath_pc |  -.0013171    .004054    -0.32   0.745    -.0092627    .0066286
  population |  -7.74e-08   1.97e-08    -3.94   0.000    -1.16e-07   -3.88e-08
       _cons |    5.42963   .3352084    16.20   0.000     4.772634    6.086626
------------------------------------------------------------------------------

. drop covdeath_pcXp_pos

. 
. 
. 
. reg deathincrease_pc adj_covid_deaths_pc [aweight=population] if days_to_report > 7, cluster(fips)
(sum of wgt is 3,139,373,590)

Linear regression                               Number of obs     =        481
                                                F(1, 48)          =     779.03
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9333
                                                Root MSE          =     11.429

                                         (Std. Err. adjusted for 49 clusters in fips)
-------------------------------------------------------------------------------------
                    |               Robust
   deathincrease_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
adj_covid_deaths_pc |   .8262069   .0296013    27.91   0.000     .7666894    .8857244
              _cons |   2.138038   .5079429     4.21   0.000      1.11675    3.159325
-------------------------------------------------------------------------------------

. reg deathincrease_pc adj_covid_deaths_pc l.adj_covid_deaths_pc [aweight=population] if days_to_repo
> rt > 7, cluster(fips)
(sum of wgt is 3,131,758,697)

Linear regression                               Number of obs     =        480
                                                F(2, 48)          =    1969.01
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9527
                                                Root MSE          =     9.6378

                                         (Std. Err. adjusted for 49 clusters in fips)
-------------------------------------------------------------------------------------
                    |               Robust
   deathincrease_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
adj_covid_deaths_pc |
                --. |   .5746416   .0997219     5.76   0.000     .3741373    .7751459
                L1. |   .2835737   .1414643     2.00   0.051    -.0008594    .5680068
                    |
              _cons |   2.200459   .4564187     4.82   0.000     1.282768     3.11815
-------------------------------------------------------------------------------------

. reg deathincrease_pc c.adj_covid_deaths_pc##c.p_pos [aweight=population] if days_to_report > 7, clu
> ster(fips)
(sum of wgt is 2,568,711,386)

Linear regression                               Number of obs     =        407
                                                F(3, 48)          =     407.53
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9398
                                                Root MSE          =     11.695

                                                   (Std. Err. adjusted for 49 clusters in fips)
-----------------------------------------------------------------------------------------------
                              |               Robust
             deathincrease_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
          adj_covid_deaths_pc |   1.045861   .0547384    19.11   0.000     .9358023     1.15592
                        p_pos |  -.0098525   .0459793    -0.21   0.831    -.1023001    .0825951
                              |
c.adj_covid_deaths_pc#c.p_pos |  -.0058718   .0011377    -5.16   0.000    -.0081594   -.0035843
                              |
                        _cons |   .9055805   .7318164     1.24   0.222     -.565835    2.376996
-----------------------------------------------------------------------------------------------

. reg deathincrease_pc c.adj_covid_deaths_pc##c.new_tests_pc [aweight=population] if days_to_report >
>  7, cluster(fips)
(sum of wgt is 2,568,711,386)

Linear regression                               Number of obs     =        407
                                                F(3, 48)          =    4287.01
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9382
                                                Root MSE          =     11.846

                                            (Std. Err. adjusted for 49 clusters in fips)
----------------------------------------------------------------------------------------
                       |               Robust
      deathincrease_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------+----------------------------------------------------------------
   adj_covid_deaths_pc |   .8827757    .070227    12.57   0.000     .7415749    1.023977
          new_tests_pc |   .0020616   .0004215     4.89   0.000     .0012141    .0029091
                       |
 c.adj_covid_deaths_pc#|
        c.new_tests_pc |   -.000015   7.42e-06    -2.02   0.049    -.0000299   -8.07e-08
                       |
                 _cons |  -3.152395   .8857175    -3.56   0.001    -4.933249    -1.37154
----------------------------------------------------------------------------------------

. reg deathincrease_pc c.adj_covid_deaths_pc##c.new_tests_pc c.l.adj_covid_deaths_pc##c.new_tests_pc 
> [aweight=population] if days_to_report > 7, cluster(fips)
(sum of wgt is 2,568,711,386)
note: new_tests_pc omitted because of collinearity

Linear regression                               Number of obs     =        407
                                                F(5, 48)          =    3402.09
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9706
                                                Root MSE          =     8.1894

                                             (Std. Err. adjusted for 49 clusters in fips)
-----------------------------------------------------------------------------------------
                        |               Robust
       deathincrease_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
    adj_covid_deaths_pc |  -.0676861   .2080307    -0.33   0.746    -.4859599    .3505877
           new_tests_pc |   .0016962   .0004643     3.65   0.001     .0007627    .0026297
                        |
  c.adj_covid_deaths_pc#|
         c.new_tests_pc |   .0000863   .0000249     3.46   0.001     .0000361    .0001364
                        |
    adj_covid_deaths_pc |
                    L1. |   1.177863    .225486     5.22   0.000     .7244927    1.631233
                        |
           new_tests_pc |          0  (omitted)
                        |
 cL.adj_covid_deaths_pc#|
         c.new_tests_pc |  -.0001232   .0000262    -4.70   0.000    -.0001759   -.0000705
                        |
                  _cons |  -1.906375   .9204803    -2.07   0.044    -3.757125   -.0556251
-----------------------------------------------------------------------------------------

. reg deathincrease_pc c.excess_deaths_pc##c.new_tests_pc c.l.excess_deaths_pc##c.new_tests_pc [aweig
> ht=population] if days_to_report > 7, cluster(fips)
(sum of wgt is 2,568,711,386)
note: new_tests_pc omitted because of collinearity

Linear regression                               Number of obs     =        407
                                                F(5, 48)          =     640.78
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9234
                                                Root MSE          =     13.222

                                                        (Std. Err. adjusted for 49 clusters in fips)
----------------------------------------------------------------------------------------------------
                                   |               Robust
                  deathincrease_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------------------+----------------------------------------------------------------
                  excess_deaths_pc |  -.0590529    .144813    -0.41   0.685    -.3502189     .232113
                      new_tests_pc |   .0029111   .0007734     3.76   0.000      .001356    .0044661
                                   |
 c.excess_deaths_pc#c.new_tests_pc |   .0000464   .0000198     2.34   0.024     6.52e-06    .0000863
                                   |
                  excess_deaths_pc |
                               L1. |    .679358   .1771697     3.83   0.000     .3231345    1.035582
                                   |
                      new_tests_pc |          0  (omitted)
                                   |
cL.excess_deaths_pc#c.new_tests_pc |  -.0000515    .000022    -2.34   0.023    -.0000957   -7.26e-06
                                   |
                             _cons |   -4.13425   1.995608    -2.07   0.044    -8.146688   -.1218108
----------------------------------------------------------------------------------------------------

. 
. 
. reg excess_deaths_pc covdeath_pc [aweight=population] if days_to_report > 14, cluster(fips)
(sum of wgt is 4,398,606,128)

Linear regression                               Number of obs     =        686
                                                F(1, 48)          =    3408.29
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9277
                                                Root MSE          =     16.332

                                  (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
excess_dea~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 covdeath_pc |   1.404898   .0240645    58.38   0.000     1.356513    1.453282
       _cons |   .2258274   2.201095     0.10   0.919    -4.199772    4.651426
------------------------------------------------------------------------------

. reg excess_respir_deaths_pc covdeath_pc [aweight=population] if days_to_report > 14, cluster(fips)
(sum of wgt is 4,398,606,128)

Linear regression                               Number of obs     =        686
                                                F(1, 48)          =   19815.73
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9959
                                                Root MSE          =     2.8456

                                  (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
excess_res~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 covdeath_pc |   1.061714   .0075423   140.77   0.000     1.046549    1.076879
       _cons |   .5261397   .2650262     1.99   0.053    -.0067311    1.059011
------------------------------------------------------------------------------

. 
. reg excess_deaths_pc c.covdeath_pc##c.p_pos [aweight=population] if days_to_report > 14, cluster(fi
> ps)
(sum of wgt is 2,254,525,234)

Linear regression                               Number of obs     =        358
                                                F(3, 48)          =    5004.58
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9643
                                                Root MSE          =     14.726

                                           (Std. Err. adjusted for 49 clusters in fips)
---------------------------------------------------------------------------------------
                      |               Robust
     excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
          covdeath_pc |   1.008637   .0934178    10.80   0.000     .8208082    1.196466
                p_pos |  -.0253226    .108581    -0.23   0.817    -.2436393    .1929941
                      |
c.covdeath_pc#c.p_pos |   .0094126   .0022408     4.20   0.000     .0049071    .0139181
                      |
                _cons |   6.401726   1.932052     3.31   0.002     2.517075    10.28638
---------------------------------------------------------------------------------------

. reg excess_respir_deaths_pc c.covdeath_pc##c.p_pos [aweight=population] if days_to_report > 14, clu
> ster(fips)
(sum of wgt is 2,254,525,234)

Linear regression                               Number of obs     =        358
                                                F(3, 48)          >   99999.00
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9976
                                                Root MSE          =     2.8733

                                           (Std. Err. adjusted for 49 clusters in fips)
---------------------------------------------------------------------------------------
                      |               Robust
excess_respir_death~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
          covdeath_pc |   .9545117   .0168693    56.58   0.000     .9205938    .9884296
                p_pos |   .0369116    .021639     1.71   0.095    -.0065965    .0804197
                      |
c.covdeath_pc#c.p_pos |   .0024529   .0003327     7.37   0.000     .0017839    .0031219
                      |
                _cons |   1.376836   .4508955     3.05   0.004     .4702493    2.283422
---------------------------------------------------------------------------------------

. 
. reg f.excess_deaths_pc c.new_pos_pc##c.p_pos [aweight=population] if days_to_report > 14, cluster(f
> ips)
(sum of wgt is 2,254,525,234)

Linear regression                               Number of obs     =        358
                                                F(3, 48)          =     128.37
                                                Prob > F          =     0.0000
                                                R-squared         =     0.8385
                                                Root MSE          =     31.454

                                          (Std. Err. adjusted for 49 clusters in fips)
--------------------------------------------------------------------------------------
                     |               Robust
  F.excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
          new_pos_pc |   .0233274   .0162475     1.44   0.158    -.0093404    .0559951
               p_pos |   .1581279   .1857613     0.85   0.399    -.2153703    .5316261
                     |
c.new_pos_pc#c.p_pos |   .0018943   .0005749     3.29   0.002     .0007383    .0030503
                     |
               _cons |   8.605404   3.860454     2.23   0.031     .8434401    16.36737
--------------------------------------------------------------------------------------

. reg f.excess_respir_deaths_pc c.new_pos_pc##c.p_pos [aweight=population] if days_to_report > 14, cl
> uster(fips)
(sum of wgt is 2,254,525,234)

Linear regression                               Number of obs     =        358
                                                F(3, 48)          =     115.81
                                                Prob > F          =     0.0000
                                                R-squared         =     0.8938
                                                Root MSE          =     19.043

                                          (Std. Err. adjusted for 49 clusters in fips)
--------------------------------------------------------------------------------------
F.                   |               Robust
excess_respir_deat~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
          new_pos_pc |   .0199733   .0126654     1.58   0.121    -.0054922    .0454387
               p_pos |   .1101835   .0882049     1.25   0.218    -.0671644    .2875313
                     |
c.new_pos_pc#c.p_pos |   .0014172   .0004528     3.13   0.003     .0005068    .0023275
                     |
               _cons |    3.70361    2.57274     1.44   0.156    -1.469231     8.87645
--------------------------------------------------------------------------------------

. 
. 
. log close
      name:  <unnamed>
       log:  C:\Users\favero\Documents\GitHub\covid-underreporting\data\..\logs\cleandata.txt
  log type:  text
 closed on:  22 May 2020, 16:17:28
-----------------------------------------------------------------------------------------------------
