-----------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\favero\Documents\GitHub\covid-underreporting\data\..\logs\cleandata.txt
  log type:  text
 opened on:  24 May 2020, 21:51:14

. 
. use "..\data\population.dta" // start from this file because it has both fips codes and state names

. 
. merge 1:m fips using "..\data\covidtracking.dta", keep(2 3)

    Result                           # of obs.
    -----------------------------------------
    not matched                           350
        from master                         0  (_merge==1)
        from using                        350  (_merge==2)

    matched                             4,147  (_merge==3)
    -----------------------------------------

. drop _merge population // merge population back in later because want it merged to all observations
> , even those missing from the current dataset

. 
. merge 1:1 state date using "..\data\cdc_deaths.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                         4,215
        from master                     3,932  (_merge==1)
        from using                        283  (_merge==2)

    matched                               565  (_merge==3)
    -----------------------------------------

. drop _merge

. 
. merge 1:1 state date using "..\data\cdc_historical_deaths.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                        22,832
        from master                     4,014  (_merge==1)
        from using                     18,818  (_merge==2)

    matched                               766  (_merge==3)
    -----------------------------------------

. drop _merge

. 
. drop fips

. merge m:1 state using "..\data\population.dta", keep(1 3)

    Result                           # of obs.
    -----------------------------------------
    not matched                           382
        from master                       382  (_merge==1)
        from using                          0  (_merge==2)

    matched                            23,216  (_merge==3)
    -----------------------------------------

. drop _merge

. order date fips

. sort fips state date

. 
. drop if fips > 56
(382 observations deleted)

. 
. encode dataqualitygrade, gen(datagrade)

. order datagrade, after(dataqualitygrade)

. drop dataqualitygrade

. 
. gen end_week = date + mod(6 - dow(date), 7)

. format end_week %tdCCYYNNDD

. order end_week, after(date)

. 
. foreach var of varlist positive-datagrade death-pneumon_influ_or_covid numinfluenzadeaths-percentco
> mplete {
  2.         gen `var'_mis = (`var'==.)
  3. }

. gen dayscollapsed = 1

. collapse (firstnm) state report_date epi_week (lastnm) positive-datagrade population death-posneg (
> sum) deathincrease-pneumon_influ_or_covid numinfluenzadeaths-percentcomplete *_mis dayscollapsed, b
> y(end_week fips)

. foreach var of varlist positive-datagrade {
  2.         replace `var' = . if `var'_mis > 0
  3. }
(0 real changes made)
(16 real changes made, 16 to missing)
(51 real changes made, 51 to missing)
(51 real changes made, 51 to missing)
(48 real changes made, 48 to missing)
(35 real changes made, 35 to missing)
(18 real changes made, 18 to missing)
(28 real changes made, 28 to missing)
(12 real changes made, 12 to missing)
(45 real changes made, 45 to missing)
(52 real changes made, 52 to missing)

. foreach var of varlist death-pneumon_influ_or_covid numinfluenzadeaths-percentcomplete {
  2.         replace `var' = . if `var'_mis == dayscollapsed
  3. }
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(19,083 real changes made, 19,083 to missing)
(19,083 real changes made, 19,083 to missing)
(19,083 real changes made, 19,083 to missing)
(19,083 real changes made, 19,083 to missing)
(19,083 real changes made, 19,083 to missing)
(18,921 real changes made, 18,921 to missing)
(18,921 real changes made, 18,921 to missing)
(18,921 real changes made, 18,921 to missing)
(18,921 real changes made, 18,921 to missing)
(18,921 real changes made, 18,921 to missing)
(18,921 real changes made, 18,921 to missing)
(18,921 real changes made, 18,921 to missing)
(153 real changes made, 153 to missing)
(153 real changes made, 153 to missing)
(153 real changes made, 153 to missing)
(153 real changes made, 153 to missing)

. drop *_mis

. 
. xtset fips end_week, delta(7)
       panel variable:  fips (strongly balanced)
        time variable:  end_week, 20130105 to 20200530
                delta:  7 days

. 
. gen new_pos = d.positive if d.positive>=0
(19,120 missing values generated)

. gen new_neg = d.negative if d.negative>=0
(19,163 missing values generated)

. gen p_pos = new_pos/(new_pos+new_neg)*100
(19,167 missing values generated)

. order new_pos-p_pos, after(negative)

. 
. // adjust expected deaths for reporting lag: https://www.cdc.gov/nchs/data/vsrr/report001.pdf
. // maybe also somehow adjust for how the individual state was doing relative to expectations pre-co
> vid
. gen days_to_report = report_date - end_week
(18,921 missing values generated)

. 
. drop if fips == 9 | fips == 37 // Connecticut and North Carolina's data look highly problematic, so
>  dropping them
(774 observations deleted)

. 
. /*
> gen allcause_minus_posscovid = total_deaths - pneumon_influ_or_covid
> gen allcause_minus_posscovid_pc  = allcause_minus_posscovid*1000000/population
> bys days_to_report: sum allcause_minus_posscovid_pc
> gen adj_allcause_minus_posscovid_pc = allcause_minus_posscovid_pc
> replace adj_allcause_minus_posscovid_pc = allcause_minus_posscovid_pc * 212 / 93 if days_to_report 
> <= 7 & days_to_report != .
> replace adj_allcause_minus_posscovid_pc = allcause_minus_posscovid_pc * 212 / 159 if days_to_report
>  > 7 & days_to_report <= 14
> replace adj_allcause_minus_posscovid_pc = allcause_minus_posscovid_pc * 212 / 192 if days_to_report
>  > 14 & days_to_report <= 21
> */
. 
. //gen adj_expected_deaths = expected_deaths
. //replace adj_expected_deaths = expected_deaths * 93 / 212 if days_to_report <= 7 & days_to_report 
> != .
. //replace adj_expected_deaths = expected_deaths * 159 / 212 if days_to_report > 7 & days_to_report 
> <= 14
. //replace adj_expected_deaths = expected_deaths * 192 / 212 if days_to_report > 14 & days_to_report
>  <= 21
. gen adj_expected_deaths = expected_deaths * (1-exp(-.09246997*days_to_report))
(18,179 missing values generated)

. order adj_expected_deaths, after(expected_deaths)

. 
. gen pneumon_or_influ_fluview = numinfluenzadeaths + numpneumoniadeaths if end_week < date("20200201
> ","YMD")
(882 missing values generated)

. gen mmwrweek = substr(epi_week,-2,2)
(147 missing values generated)

. 
. //egen old_expected_influ_pneu_deaths = mean(pneumon_or_influ_fluview), by(fips mmwrweek)
. 
. // generate expected influenza/pneumonia deaths based on historical patterns
.         gen epi_year = substr(epi_week,1,4)
(147 missing values generated)

.         destring epi_year mmwrweek, replace
epi_year: all characters numeric; replaced as int
(147 missing values generated)
mmwrweek: all characters numeric; replaced as byte
(147 missing values generated)

.         replace epi_year = epi_year + 1 if mmwrweek >= 40
(4,508 real changes made)

. 
.         gen mmwrweek2 = mmwrweek - 39 if mmwrweek >= 40
(14,455 missing values generated)

.         replace mmwrweek2 = l.mmwrweek2 + 1 if mmwrweek < 40
(12,397 real changes made)

.         replace mmwrweek2 = mmwrweek + 13 if mmwrweek2 == .
(1,911 real changes made)

.         //gen pi_time = 2*_pi*mmwrweek2/52.1775
.         //gen sin_time = sin(pi_time)
.         //gen cos_time = cos(pi_time)
.         //gen halfsin_time = sin(pi_time/2)
.         //gen halfcos_time = cos(pi_time/2)
. 
.         gen pneumon_or_influ_fluview_pc = pneumon_or_influ_fluview * 1000000 / population
(882 missing values generated)

.         
.         // most year-to-year variation in influenza severity seems to be from weeks 50 to 8; thus, 
> create a sin spike for this period with a year-varying coefficient
.         gen fluseason = 0 if mmwrweek != .
(147 missing values generated)

.         replace fluseason = 1 if (mmwrweek >= 50 | mmwrweek <= 8) & mmwrweek != .
(4,214 real changes made)

.         gen fluseason_sin_time = sin(fluseason*_pi*(mmwrweek2-10)/12)
(147 missing values generated)

.         
.         reg pneumon_or_influ_fluview_pc i.fips i.epi_year i.mmwrweek i.epi_year#c.fluseason_sin_tim
> e [aweight=population]
(sum of wgt is 115,934,690,088)

      Source |       SS           df       MS      Number of obs   =    18,081
-------------+----------------------------------   F(115, 17965)   =    521.03
       Model |  201013.657       115  1747.94485   Prob > F        =    0.0000
    Residual |  60268.2363    17,965  3.35475849   R-squared       =    0.7693
-------------+----------------------------------   Adj R-squared   =    0.7679
       Total |  261281.894    18,080  14.4514322   Root MSE        =    1.8316

-----------------------------------------------------------------------------------------------
  pneumon_or_influ_fluview_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                         fips |
                           2  |  -5.825264   .3026146   -19.25   0.000    -6.418418    -5.23211
                           4  |  -3.205597     .14106   -22.73   0.000    -3.482088   -2.929106
                           5  |   3.051991   .1766518    17.28   0.000     2.705736    3.398245
                           6  |  -2.268413   .1156045   -19.62   0.000    -2.495009   -2.041817
                           8  |  -4.727203   .1483638   -31.86   0.000     -5.01801   -4.436396
                          10  |  -1.437599   .2678693    -5.37   0.000    -1.962649   -.9125496
                          11  |  -4.478159   .3073893   -14.57   0.000    -5.080672   -3.875647
                          12  |  -2.283191   .1208438   -18.89   0.000    -2.520057   -2.046326
                          13  |   -4.12139   .1318313   -31.26   0.000    -4.379792   -3.862988
                          15  |    2.76329   .2303498    12.00   0.000     2.311783    3.214798
                          16  |  -3.940811    .210972   -18.68   0.000    -4.354336   -3.527286
                          17  |  -1.206361   .1284109    -9.39   0.000    -1.458059   -.9546634
                          18  |   .7863893   .1433459     5.49   0.000     .5054175    1.067361
                          19  |   1.232255   .1742568     7.07   0.000     .8906953    1.573816
                          20  |   .2982263    .178602     1.67   0.095    -.0518508    .6483033
                          21  |   4.487376   .1579148    28.42   0.000     4.177848    4.796904
                          22  |  -2.867302   .1562969   -18.35   0.000    -3.173659   -2.560945
                          23  |   2.510922   .2350658    10.68   0.000     2.050171    2.971674
                          24  |  -1.675401   .1467357   -11.42   0.000    -1.963017   -1.387785
                          25  |   .3082243   .1426418     2.16   0.031     .0286326     .587816
                          26  |  -.5319895   .1331396    -4.00   0.000     -.792956   -.2710231
                          27  |  -2.334791   .1490825   -15.66   0.000    -2.627007   -2.042575
                          28  |   2.135278   .1774154    12.04   0.000     1.787527    2.483029
                          29  |     .11761   .1462437     0.80   0.421    -.1690417    .4042617
                          30  |  -1.525114    .257744    -5.92   0.000    -2.030317   -1.019911
                          31  |   .2108836   .2049988     1.03   0.304    -.1909338     .612701
                          32  |  -1.912617   .1755415   -10.90   0.000    -2.256695   -1.568538
                          33  |  -.8291304    .234012    -3.54   0.000    -1.287816   -.3704445
                          34  |  -2.831354   .1358386   -20.84   0.000    -3.097611   -2.565098
                          35  |  -.6795766    .199224    -3.41   0.001    -1.070075   -.2890783
                          36  |   .1661381   .1220068     1.36   0.173    -.0730069     .405283
                          38  |   .9772469   .2972953     3.29   0.001     .3945195    1.559974
                          39  |   -.025399   .1299081    -0.20   0.845    -.2800314    .2292335
                          40  |   3.447875   .1631598    21.13   0.000     3.128066    3.767684
                          41  |  -3.377835   .1603443   -21.07   0.000    -3.692125   -3.063545
                          42  |  -.0079482   .1282287    -0.06   0.951    -.2592887    .2433923
                          44  |    1.63297   .2586829     6.31   0.000     1.125927    2.140013
                          45  |  -.2027137   .1523521    -1.33   0.183    -.5013384    .0959111
                          46  |   2.430771   .2788973     8.72   0.000     1.884105    2.977436
                          47  |   2.196776   .1429165    15.37   0.000     1.916646    2.476906
                          48  |  -3.041931   .1178961   -25.80   0.000    -3.273018   -2.810843
                          49  |  -5.313371   .1734133   -30.64   0.000    -5.653278   -4.973465
                          50  |   1.005237   .3245166     3.10   0.002     .3691536    1.641321
                          51  |  -3.291503   .1368162   -24.06   0.000    -3.559676    -3.02333
                          53  |  -2.774458   .1398011   -19.85   0.000    -3.048482   -2.500435
                          54  |   7.406932   .2107526    35.15   0.000     6.993837    7.820028
                          55  |  -1.767177   .1479901   -11.94   0.000    -2.057252   -1.477102
                          56  |  -.7957156    .335577    -2.37   0.018    -1.453479   -.1379524
                              |
                     epi_year |
                        2014  |  -.2863546   .0621445    -4.61   0.000    -.4081638   -.1645454
                        2015  |  -.0503765   .0623012    -0.81   0.419    -.1724927    .0717398
                        2016  |   -.136425   .0621445    -2.20   0.028    -.2582342   -.0146158
                        2017  |  -.2242134   .0621445    -3.61   0.000    -.3460226   -.1024042
                        2018  |   -.496476   .0621445    -7.99   0.000    -.6182852   -.3746668
                        2019  |    -.57876   .0621445    -9.31   0.000    -.7005692   -.4569509
                        2020  |  -.9323278     .09971    -9.35   0.000    -1.127769   -.7368868
                              |
                     mmwrweek |
                           2  |   .9432872   .1433907     6.58   0.000     .6622276    1.224347
                           3  |   .4353523   .1507673     2.89   0.004     .1398338    .7308707
                           4  |  -.0463079   .1392351    -0.33   0.739    -.3192221    .2266063
                           5  |   .0899989   .1382404     0.65   0.515    -.1809655    .3609634
                           6  |   .6169963   .1883154     3.28   0.001     .2478801    .9861125
                           7  |   1.805674   .2990116     6.04   0.000     1.219583    2.391766
                           8  |   2.913603   .4440624     6.56   0.000     2.043199    3.784008
                           9  |    3.73297   .5803815     6.43   0.000     2.595366    4.870573
                          10  |   3.626572   .5803815     6.25   0.000     2.488969    4.764176
                          11  |   3.281918   .5803815     5.65   0.000     2.144314    4.419521
                          12  |   2.772211   .5803815     4.78   0.000     1.634607    3.909814
                          13  |   2.442106   .5803815     4.21   0.000     1.304503     3.57971
                          14  |    2.20976   .5803815     3.81   0.000     1.072156    3.347363
                          15  |   1.877382   .5803815     3.23   0.001     .7397783    3.014985
                          16  |   1.300836   .5803815     2.24   0.025     .1632321    2.438439
                          17  |   .7774879   .5803815     1.34   0.180    -.3601156    1.915091
                          18  |   .4664803   .5803815     0.80   0.422    -.6711231    1.604084
                          19  |   .1954853   .5803815     0.34   0.736    -.9421181    1.333089
                          20  |  -.1828163   .5803815    -0.31   0.753     -1.32042    .9547872
                          21  |  -.2341962   .5803815    -0.40   0.687      -1.3718    .9034073
                          22  |  -.6302307   .5803815    -1.09   0.278    -1.767834    .5073727
                          23  |  -.3987938   .5803815    -0.69   0.492    -1.536397    .7388096
                          24  |  -.6174995   .5803815    -1.06   0.287    -1.755103     .520104
                          25  |  -.8134706   .5803815    -1.40   0.161    -1.951074    .3241328
                          26  |  -.9457853   .5803815    -1.63   0.103    -2.083389    .1918182
                          27  |  -1.124478   .5803815    -1.94   0.053    -2.262082    .0131252
                          28  |     -1.049   .5803815    -1.81   0.071    -2.186603    .0886037
                          29  |     -1.335   .5803815    -2.30   0.021    -2.472603    -.197396
                          30  |  -1.346367   .5803815    -2.32   0.020     -2.48397   -.2087633
                          31  |  -1.411387   .5803815    -2.43   0.015    -2.548991   -.2737838
                          32  |   -1.49596   .5803815    -2.58   0.010    -2.633563   -.3583561
                          33  |  -1.476863   .5803815    -2.54   0.011    -2.614466   -.3392592
                          34  |  -1.430939   .5803815    -2.47   0.014    -2.568542   -.2933355
                          35  |  -1.535518   .5803815    -2.65   0.008    -2.673121   -.3979141
                          36  |  -1.354096   .5803815    -2.33   0.020      -2.4917    -.216493
                          37  |  -1.162672   .5803815    -2.00   0.045    -2.300276   -.0250687
                          38  |  -1.041725   .5803815    -1.79   0.073    -2.179328    .0958787
                          39  |  -1.020354   .5803815    -1.76   0.079    -2.157958    .1172491
                          40  |  -.6293558   .5803044    -1.08   0.278    -1.766808    .5080966
                          41  |  -.5916165   .5803044    -1.02   0.308    -1.729069    .5458359
                          42  |  -.3028886   .5803044    -0.52   0.602    -1.440341    .8345637
                          43  |  -.2283196   .5803044    -0.39   0.694    -1.365772    .9091328
                          44  |  -.2242274   .5803044    -0.39   0.699     -1.36168     .913225
                          45  |   -.082819   .5803044    -0.14   0.887    -1.220271    1.054633
                          46  |   .0376738   .5803044     0.06   0.948    -1.099779    1.175126
                          47  |   .1099694   .5803044     0.19   0.850    -1.027483    1.247422
                          48  |   .5041852   .5803044     0.87   0.385    -.6332672    1.641638
                          49  |    .999342   .5803044     1.72   0.085    -.1381103    2.136794
                          50  |   .1230895   .4203192     0.29   0.770    -.7007766    .9469556
                          51  |  -.9015919   .2781439    -3.24   0.001    -1.446781   -.3564031
                          52  |  -.9695968   .1746016    -5.55   0.000    -1.311833   -.6273608
                          53  |   .8631074   .2925835     2.95   0.003     .2896157    1.436599
                              |
epi_year#c.fluseason_sin_time |
                        2013  |   7.851516   .6485306    12.11   0.000     6.580334    9.122698
                        2014  |   5.757474   .6475322     8.89   0.000     4.488249      7.0267
                        2015  |   8.378202    .674693    12.42   0.000     7.055739    9.700665
                        2016  |   2.471254   .6475322     3.82   0.000     1.202028    3.740479
                        2017  |    5.06053   .6475322     7.82   0.000     3.791305    6.329756
                        2018  |   10.79833   .6475322    16.68   0.000     9.529101    12.06755
                        2019  |   3.367439   .6475322     5.20   0.000     2.098213    4.636664
                        2020  |   4.147721   .6629906     6.26   0.000     2.848196    5.447246
                              |
                        _cons |   11.55233   .5850235    19.75   0.000     10.40563    12.69903
-----------------------------------------------------------------------------------------------

.         predict expected_influ_pneu_deaths_pc
(option xb assumed; fitted values)
(147 missing values generated)

.         gen expected_influ_pneu_deaths = expected_influ_pneu_deaths_pc * population / 1000000
(147 missing values generated)

. 
. //gen adj_expected_influ_pneu_deaths = expected_influ_pneu_deaths
. //replace adj_expected_influ_pneu_deaths = expected_influ_pneu_deaths * 93 / 212 if days_to_report 
> <= 7 & days_to_report != .
. //replace adj_expected_influ_pneu_deaths = expected_influ_pneu_deaths * 159 / 212 if days_to_report
>  > 7 & days_to_report <= 14
. //replace adj_expected_influ_pneu_deaths = expected_influ_pneu_deaths * 192 / 212 if days_to_report
>  > 14 & days_to_report <= 21
. gen adj_expected_influ_pneu_deaths = expected_influ_pneu_deaths * (1-exp(-.09246997*days_to_report)
> )
(18,228 missing values generated)

. order adj_expected_influ_pneu_deaths, after(expected_influ_pneu_deaths)

. 
. replace covid_deaths = 5 if covid_deaths == . & total_deaths != . //rough imputation for where data
>  is supressed for 1-9 deaths
(0 real changes made)

. 
. 
. gen cumulative_covdeath = covid_deaths
(18,179 missing values generated)

. replace cumulative_covdeath = cumulative_covdeath + l.cumulative_covdeath if l.cumulative_covdeath 
> != .
(405 real changes made)

. 
. //gen adj_covid_deaths = covid_deaths
. //replace adj_covid_deaths = covid_deaths * 212 / 93 if days_to_report <= 7 & days_to_report != .
. //replace adj_covid_deaths = covid_deaths * 212 / 159 if days_to_report > 7 & days_to_report <= 14
. //replace adj_covid_deaths = covid_deaths * 212 / 192 if days_to_report > 14 & days_to_report <= 21
. 
. gen adj_covid_deaths = covid_deaths / (1-exp(-.09246997*days_to_report))
(18,179 missing values generated)

. gen adj_cumulative_covdeath = adj_covid_deaths
(18,179 missing values generated)

. replace adj_cumulative_covdeath = adj_cumulative_covdeath + l.adj_cumulative_covdeath if l.adj_cumu
> lative_covdeath != .
(405 real changes made)

. 
. gen adj_total_deaths = total_deaths / (1-exp(-.09246997*days_to_report))
(18,179 missing values generated)

. gen adj_pneumon_influ_or_covid = pneumon_influ_or_covid / (1-exp(-.09246997*days_to_report))
(18,179 missing values generated)

. 
. 
. gen covdeath_pc = covid_deaths*1000000/population
(18,179 missing values generated)

. gen excess_deaths_pc = (total_deaths-adj_expected_deaths)*1000000/population
(18,179 missing values generated)

. gen excess_respir_deaths_pc = (pneumon_influ_or_covid-adj_expected_influ_pneu_deaths)*1000000/popul
> ation
(18,228 missing values generated)

. gen adj_excess_deaths_pc = (adj_total_deaths-expected_deaths)*1000000/population
(18,179 missing values generated)

. gen adj_excess_respir_deaths_pc = (adj_pneumon_influ_or_covid-expected_influ_pneu_deaths)*1000000/p
> opulation
(18,228 missing values generated)

. gen new_pos_pc = new_pos*1000000/population
(18,370 missing values generated)

. gen new_neg_pc = new_neg*1000000/population
(18,410 missing values generated)

. gen new_tests_pc = new_pos_pc + new_neg_pc
(18,410 missing values generated)

. gen deathincrease_pc = deathincrease*1000000/population
(18,334 missing values generated)

. gen adj_covid_deaths_pc = adj_covid_deaths*1000000/population
(18,179 missing values generated)

. 
. /*
> gen log_covdeath = log(covid_deaths)
>         //replace log_covdeath = 2 if covid_deaths==0
> gen log_allcause = log(total_deaths)
> gen log_expected = log(adj_expected_deaths)
> gen excess_deaths = log_allcause-log_expected
> */
. 
. save "..\data\weeklydata.dta", replace
file ..\data\weeklydata.dta saved

. 
. 
. reg excess_deaths_pc covdeath_pc [aweight=population] if days_to_report > 14, cluster(fips) nocons
(sum of wgt is 4,398,606,128)

Linear regression                               Number of obs     =        686
                                                F(1, 48)          =   10226.02
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9380
                                                Root MSE          =     15.914

                                  (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
excess_dea~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 covdeath_pc |   1.387309   .0137189   101.12   0.000     1.359725    1.414892
------------------------------------------------------------------------------

. margins, dydx(covdeath_pc)

Average marginal effects                        Number of obs     =        686
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : covdeath_pc

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 covdeath_pc |   1.387309   .0137189   101.12   0.000     1.359725    1.414892
------------------------------------------------------------------------------

. 
. twoway (scatter excess_deaths_pc covdeath_pc if days_to_report > 14, mcolor(%30) yline(0)) (functio
> n y=x, range(0 300))

. 
. reg excess_deaths_pc covdeath_pc [aweight=population] if days_to_report > 14, cluster(fips)
(sum of wgt is 4,398,606,128)

Linear regression                               Number of obs     =        686
                                                F(1, 48)          =    7011.70
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9314
                                                Root MSE          =     15.924

                                  (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
excess_dea~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 covdeath_pc |   1.389194   .0165902    83.74   0.000     1.355837    1.422551
       _cons |   -.257895   2.324166    -0.11   0.912    -4.930945    4.415155
------------------------------------------------------------------------------

. reg excess_deaths_pc c.covdeath_pc c.p_pos [aweight=population] if days_to_report > 14, cluster(fip
> s)
(sum of wgt is 2,254,525,234)

Linear regression                               Number of obs     =        358
                                                F(2, 48)          =    3916.72
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9676
                                                Root MSE          =     13.965

                                  (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
excess_dea~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 covdeath_pc |    1.36655   .0177694    76.90   0.000     1.330822    1.402278
       p_pos |   .0107816   .1124527     0.10   0.924    -.2153196    .2368828
       _cons |   2.678421   2.179946     1.23   0.225    -1.704654    7.061495
------------------------------------------------------------------------------

. reg excess_deaths_pc c.covdeath_pc##c.p_pos [aweight=population] if days_to_report > 14, cluster(fi
> ps)
(sum of wgt is 2,254,525,234)

Linear regression                               Number of obs     =        358
                                                F(3, 48)          =    3335.61
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9707
                                                Root MSE          =      13.29

                                           (Std. Err. adjusted for 49 clusters in fips)
---------------------------------------------------------------------------------------
                      |               Robust
     excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
          covdeath_pc |   1.100999   .0889751    12.37   0.000     .9221026    1.279895
                p_pos |  -.0837113   .0879386    -0.95   0.346    -.2605237     .093101
                      |
c.covdeath_pc#c.p_pos |   .0068517   .0024368     2.81   0.007     .0019523    .0117512
                      |
                _cons |   6.073375   1.901709     3.19   0.002     2.249734    9.897017
---------------------------------------------------------------------------------------

. reg excess_deaths_pc c.covdeath_pc c.new_pos_pc c.new_neg_pc [aweight=population] if days_to_report
>  > 14, cluster(fips)
(sum of wgt is 2,254,525,234)

Linear regression                               Number of obs     =        358
                                                F(3, 48)          =    5062.95
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9689
                                                Root MSE          =     13.696

                                  (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
excess_dea~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 covdeath_pc |   1.260576   .0592272    21.28   0.000     1.141492    1.379661
  new_pos_pc |   .0108996   .0067179     1.62   0.111    -.0026077    .0244069
  new_neg_pc |   -.001391    .000979    -1.42   0.162    -.0033594    .0005773
       _cons |   3.997076   2.204968     1.81   0.076    -.4363093    8.430461
------------------------------------------------------------------------------

. reg excess_deaths_pc c.covdeath_pc##c.new_pos_pc c.covdeath_pc##c.new_neg_pc [aweight=population] i
> f days_to_report > 14, cluster(fips)
(sum of wgt is 2,254,525,234)
note: covdeath_pc omitted because of collinearity

Linear regression                               Number of obs     =        358
                                                F(5, 48)          =    3701.27
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9728
                                                Root MSE          =     12.853

                                                (Std. Err. adjusted for 49 clusters in fips)
--------------------------------------------------------------------------------------------
                           |               Robust
          excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------------+----------------------------------------------------------------
               covdeath_pc |   1.275811   .1187909    10.74   0.000     1.036966    1.514656
                new_pos_pc |   .0090038   .0053294     1.69   0.098    -.0017117    .0197194
                           |
c.covdeath_pc#c.new_pos_pc |   .0000697   .0000229     3.05   0.004     .0000237    .0001158
                           |
               covdeath_pc |          0  (omitted)
                new_neg_pc |   .0005341   .0007077     0.75   0.454    -.0008887     .001957
                           |
c.covdeath_pc#c.new_neg_pc |  -.0000482   .0000104    -4.61   0.000    -.0000692   -.0000272
                           |
                     _cons |   1.700591   2.280298     0.75   0.459    -2.884255    6.285437
--------------------------------------------------------------------------------------------

. reg excess_deaths_pc c.covdeath_pc c.new_tests_pc [aweight=population] if days_to_report > 14, clus
> ter(fips)
(sum of wgt is 2,254,525,234)

Linear regression                               Number of obs     =        358
                                                F(2, 48)          =    4351.83
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9678
                                                Root MSE          =     13.917

                                  (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
excess_dea~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 covdeath_pc |   1.383388    .021132    65.46   0.000     1.340899    1.425877
new_tests_pc |  -.0006172   .0006766    -0.91   0.366    -.0019776    .0007432
       _cons |   4.160939    2.18428     1.90   0.063    -.2308503    8.552728
------------------------------------------------------------------------------

. reg excess_deaths_pc c.covdeath_pc##c.new_tests_pc [aweight=population] if days_to_report > 14, clu
> ster(fips)
(sum of wgt is 2,254,525,234)

Linear regression                               Number of obs     =        358
                                                F(3, 48)          =    1563.00
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9693
                                                Root MSE          =     13.616

                                                  (Std. Err. adjusted for 49 clusters in fips)
----------------------------------------------------------------------------------------------
                             |               Robust
            excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                 covdeath_pc |   1.573589   .1041533    15.11   0.000     1.364175    1.783003
                new_tests_pc |  -.0001203    .000576    -0.21   0.835    -.0012783    .0010378
                             |
c.covdeath_pc#c.new_tests_pc |  -.0000275   .0000116    -2.37   0.022    -.0000508   -4.21e-06
                             |
                       _cons |   1.745683   2.250361     0.78   0.442    -2.778971    6.270337
----------------------------------------------------------------------------------------------

. reg excess_deaths_pc c.covdeath_pc##c.new_tests_pc c.covdeath_pc##c.p_pos [aweight=population] if d
> ays_to_report > 14, cluster(fips)
(sum of wgt is 2,254,525,234)
note: covdeath_pc omitted because of collinearity

Linear regression                               Number of obs     =        358
                                                F(5, 48)          =    3230.63
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9713
                                                Root MSE          =     13.193

                                                  (Std. Err. adjusted for 49 clusters in fips)
----------------------------------------------------------------------------------------------
                             |               Robust
            excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                 covdeath_pc |   1.232505   .1588156     7.76   0.000     .9131846    1.551825
                new_tests_pc |   .0005683   .0008123     0.70   0.488    -.0010648    .0022014
                             |
c.covdeath_pc#c.new_tests_pc |   -.000017    .000011    -1.55   0.127    -.0000391    5.00e-06
                             |
                 covdeath_pc |          0  (omitted)
                       p_pos |  -.0842796   .0892374    -0.94   0.350    -.2637035    .0951443
                             |
       c.covdeath_pc#c.p_pos |   .0063552     .00308     2.06   0.045     .0001626    .0125479
                             |
                       _cons |   3.859282   2.436188     1.58   0.120    -1.039004    8.757567
----------------------------------------------------------------------------------------------

. reg excess_deaths_pc c.covdeath_pc##c.new_tests_pc##c.p_pos [aweight=population] if days_to_report 
> > 14, cluster(fips)
(sum of wgt is 2,254,525,234)

Linear regression                               Number of obs     =        358
                                                F(7, 48)          =    7984.35
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9734
                                                Root MSE          =     12.744

                                                   (Std. Err. adjusted for 49 clusters in fips)
-----------------------------------------------------------------------------------------------
                              |               Robust
             excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                  covdeath_pc |   1.492063   .1962839     7.60   0.000     1.097408    1.886718
                 new_tests_pc |   .0000854   .0006456     0.13   0.895    -.0012127    .0013836
                              |
 c.covdeath_pc#c.new_tests_pc |  -.0000782   .0000202    -3.88   0.000    -.0001188   -.0000376
                              |
                        p_pos |  -.1070026   .0813157    -1.32   0.194    -.2704988    .0564937
                              |
        c.covdeath_pc#c.p_pos |  -.0065048   .0039828    -1.63   0.109    -.0145129    .0015032
                              |
       c.new_tests_pc#c.p_pos |    .000122   .0000533     2.29   0.027     .0000148    .0002293
                              |
 c.covdeath_pc#c.new_tests_pc#|
                      c.p_pos |   2.05e-06   5.01e-07     4.09   0.000     1.04e-06    3.06e-06
                              |
                        _cons |   2.682707   2.099783     1.28   0.208     -1.53919    6.904604
-----------------------------------------------------------------------------------------------

. 
. gen covdeath_pcXp_pos = covdeath_pc * p_pos
(18,507 missing values generated)

. reghv excess_deaths_pc covdeath_pc p_pos covdeath_pcXp_pos if days_to_report > 14, var( new_tests_p
> c covdeath_pc population) twostage cluster(fips)

Multiplicative heteroscedastic regression             Number of obs  =     358
Estimator: 2sls                                       Model chi2(6)  = 889.083
                                                      Prob > chi2    =   0.000
Log Likelihood              = -1510.886               Pseudo R2      =  0.2273
                                                      VWLS R2        =  0.9680
                                  (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
excess_dea~c |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
lp_mean      |
 covdeath_pc |   1.076845   .0973613    11.06   0.000       .88602    1.267669
       p_pos |  -.0025236   .0779314    -0.03   0.974    -.1552663     .150219
covdeath_p~s |   .0071031      .0027     2.63   0.009     .0018111    .0123951
       _cons |   1.196597   2.007072     0.60   0.551    -2.737193    5.130386
-------------+----------------------------------------------------------------
lp_lnvar     |
new_tests_pc |   .0002416   .0001564     1.54   0.122    -.0000649    .0005482
 covdeath_pc |  -.0082737   .0146184    -0.57   0.571    -.0369252    .0203778
  population |  -1.29e-08   7.88e-08    -0.16   0.870    -1.67e-07    1.41e-07
       _cons |   4.984872   .8902121     5.60   0.000     3.240088    6.729656
------------------------------------------------------------------------------

. reghv excess_deaths_pc covdeath_pc p_pos covdeath_pcXp_pos if days_to_report > 14, var( new_tests_p
> c covdeath_pc population) cluster(fips)

iteration 1:  Log-likelihood =     -1498  |delta-b|     .6463 
iteration 2:  Log-likelihood =     -1496  |delta-b|     .4181 
iteration 3:  Log-likelihood =     -1495  |delta-b|     .6641 
iteration 4:  Log-likelihood =     -1495  |delta-b|     .1338 
iteration 5:  Log-likelihood =     -1495  |delta-b|    .01868 
iteration 6:  Log-likelihood =     -1495  |delta-b|    .00581 
iteration 7:  Log-likelihood =     -1495  |delta-b|   .001298 

Multiplicative heteroscedastic regression             Number of obs  =     358
Estimator: mle                                        Model chi2(6)  = 920.311
                                                      Prob > chi2    =   0.000
Log Likelihood              = -1495.272               Pseudo R2      =  0.2353
                                                      VWLS R2        =  0.9193
                                  (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
excess_dea~c |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
lp_mean      |
 covdeath_pc |   1.239215    .086902    14.26   0.000      1.06889     1.40954
       p_pos |  -.0695936   .0667348    -1.04   0.297    -.2003914    .0612041
covdeath_p~s |   .0037809   .0021761     1.74   0.082    -.0004842     .008046
       _cons |   3.027892   1.881089     1.61   0.107    -.6589755    6.714759
-------------+----------------------------------------------------------------
lp_lnvar     |
new_tests_pc |   .0002135   .0000575     3.71   0.000     .0001007    .0003262
 covdeath_pc |  -.0012092   .0037309    -0.32   0.746    -.0085216    .0061032
  population |  -5.57e-08   2.45e-08    -2.28   0.023    -1.04e-07   -7.77e-09
       _cons |   5.251059    .341799    15.36   0.000     4.581145    5.920973
------------------------------------------------------------------------------

. drop covdeath_pcXp_pos

. 
. 
. 
. reg deathincrease_pc adj_covid_deaths_pc [aweight=population] if days_to_report > 7, cluster(fips)
(sum of wgt is 3,139,373,590)

Linear regression                               Number of obs     =        481
                                                F(1, 48)          =    1395.28
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9326
                                                Root MSE          =      11.49

                                         (Std. Err. adjusted for 49 clusters in fips)
-------------------------------------------------------------------------------------
                    |               Robust
   deathincrease_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
adj_covid_deaths_pc |   .8199028   .0219499    37.35   0.000     .7757696     .864036
              _cons |   1.933102    .498703     3.88   0.000     .9303923    2.935812
-------------------------------------------------------------------------------------

. reg deathincrease_pc adj_covid_deaths_pc l.adj_covid_deaths_pc [aweight=population] if days_to_repo
> rt > 7, cluster(fips)
(sum of wgt is 3,131,758,697)

Linear regression                               Number of obs     =        480
                                                F(2, 48)          =    1646.06
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9540
                                                Root MSE          =      9.508

                                         (Std. Err. adjusted for 49 clusters in fips)
-------------------------------------------------------------------------------------
                    |               Robust
   deathincrease_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
adj_covid_deaths_pc |
                --. |   .5593571   .1125432     4.97   0.000     .3330738    .7856405
                L1. |    .293594   .1449247     2.03   0.048     .0022034    .5849845
                    |
              _cons |   2.024333   .4474086     4.52   0.000     1.124758    2.923909
-------------------------------------------------------------------------------------

. reg deathincrease_pc c.adj_covid_deaths_pc##c.p_pos [aweight=population] if days_to_report > 7, clu
> ster(fips)
(sum of wgt is 2,568,711,386)

Linear regression                               Number of obs     =        407
                                                F(3, 48)          =     719.06
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9412
                                                Root MSE          =     11.556

                                                   (Std. Err. adjusted for 49 clusters in fips)
-----------------------------------------------------------------------------------------------
                              |               Robust
             deathincrease_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
          adj_covid_deaths_pc |   1.066977   .0490363    21.76   0.000      .968383    1.165571
                        p_pos |  -.0109936   .0548205    -0.20   0.842    -.1212177    .0992304
                              |
c.adj_covid_deaths_pc#c.p_pos |  -.0065312   .0009077    -7.20   0.000    -.0083562   -.0047062
                              |
                        _cons |   .3417847    .740935     0.46   0.647    -1.147965    1.831534
-----------------------------------------------------------------------------------------------

. reg deathincrease_pc c.adj_covid_deaths_pc##c.new_tests_pc [aweight=population] if days_to_report >
>  7, cluster(fips)
(sum of wgt is 2,568,711,386)

Linear regression                               Number of obs     =        407
                                                F(3, 48)          =    2996.48
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9369
                                                Root MSE          =     11.973

                                            (Std. Err. adjusted for 49 clusters in fips)
----------------------------------------------------------------------------------------
                       |               Robust
      deathincrease_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------+----------------------------------------------------------------
   adj_covid_deaths_pc |   .8087995   .0625026    12.94   0.000     .6831295    .9344694
          new_tests_pc |   .0019711   .0004165     4.73   0.000     .0011337    .0028084
                       |
 c.adj_covid_deaths_pc#|
        c.new_tests_pc |  -5.74e-06   6.93e-06    -0.83   0.412    -.0000197    8.19e-06
                       |
                 _cons |  -2.712834   .8008235    -3.39   0.001    -4.322998   -1.102671
----------------------------------------------------------------------------------------

. reg deathincrease_pc c.adj_covid_deaths_pc##c.new_tests_pc c.l.adj_covid_deaths_pc##c.new_tests_pc 
> [aweight=population] if days_to_report > 7, cluster(fips)
(sum of wgt is 2,568,711,386)
note: new_tests_pc omitted because of collinearity

Linear regression                               Number of obs     =        407
                                                F(5, 48)          =    4304.12
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9696
                                                Root MSE          =     8.3325

                                             (Std. Err. adjusted for 49 clusters in fips)
-----------------------------------------------------------------------------------------
                        |               Robust
       deathincrease_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
    adj_covid_deaths_pc |  -.1345441   .2367596    -0.57   0.572    -.6105812     .341493
           new_tests_pc |   .0016334   .0004536     3.60   0.001     .0007214    .0025453
                        |
  c.adj_covid_deaths_pc#|
         c.new_tests_pc |   .0000954   .0000285     3.34   0.002      .000038    .0001527
                        |
    adj_covid_deaths_pc |
                    L1. |   1.160925   .2425779     4.79   0.000     .6731899    1.648661
                        |
           new_tests_pc |          0  (omitted)
                        |
 cL.adj_covid_deaths_pc#|
         c.new_tests_pc |  -.0001222   .0000284    -4.30   0.000    -.0001793   -.0000651
                        |
                  _cons |  -1.408848   .9423114    -1.50   0.141    -3.303492    .4857963
-----------------------------------------------------------------------------------------

. reg deathincrease_pc c.excess_deaths_pc##c.new_tests_pc c.l.excess_deaths_pc##c.new_tests_pc [aweig
> ht=population] if days_to_report > 7, cluster(fips)
(sum of wgt is 2,568,711,386)
note: new_tests_pc omitted because of collinearity

Linear regression                               Number of obs     =        407
                                                F(5, 48)          =     605.84
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9289
                                                Root MSE          =     12.737

                                                        (Std. Err. adjusted for 49 clusters in fips)
----------------------------------------------------------------------------------------------------
                                   |               Robust
                  deathincrease_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------------------+----------------------------------------------------------------
                  excess_deaths_pc |   .0396973   .1482976     0.27   0.790     -.258475    .3378695
                      new_tests_pc |   .0023805   .0007222     3.30   0.002     .0009284    .0038326
                                   |
 c.excess_deaths_pc#c.new_tests_pc |   .0000382    .000019     2.01   0.050    -8.29e-08    .0000764
                                   |
                  excess_deaths_pc |
                               L1. |   .5666396    .194794     2.91   0.005       .17498    .9582993
                                   |
                      new_tests_pc |          0  (omitted)
                                   |
cL.excess_deaths_pc#c.new_tests_pc |  -.0000396   .0000234    -1.69   0.097    -.0000866    7.42e-06
                                   |
                             _cons |  -3.213401   1.879002    -1.71   0.094    -6.991388    .5645852
----------------------------------------------------------------------------------------------------

. 
. 
. reg excess_deaths_pc covdeath_pc [aweight=population] if days_to_report > 14, cluster(fips)
(sum of wgt is 4,398,606,128)

Linear regression                               Number of obs     =        686
                                                F(1, 48)          =    7011.70
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9314
                                                Root MSE          =     15.924

                                  (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
excess_dea~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 covdeath_pc |   1.389194   .0165902    83.74   0.000     1.355837    1.422551
       _cons |   -.257895   2.324166    -0.11   0.912    -4.930945    4.415155
------------------------------------------------------------------------------

. reg excess_respir_deaths_pc covdeath_pc [aweight=population] if days_to_report > 14, cluster(fips)
(sum of wgt is 4,398,606,128)

Linear regression                               Number of obs     =        686
                                                F(1, 48)          >   99999.00
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9962
                                                Root MSE          =     2.7578

                                  (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
excess_res~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 covdeath_pc |   1.056221   .0027214   388.12   0.000      1.05075    1.061693
       _cons |   .5471168   .2571196     2.13   0.039     .0301433     1.06409
------------------------------------------------------------------------------

. 
. reg excess_deaths_pc c.covdeath_pc##c.p_pos [aweight=population] if days_to_report > 14, cluster(fi
> ps)
(sum of wgt is 2,254,525,234)

Linear regression                               Number of obs     =        358
                                                F(3, 48)          =    3335.61
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9707
                                                Root MSE          =      13.29

                                           (Std. Err. adjusted for 49 clusters in fips)
---------------------------------------------------------------------------------------
                      |               Robust
     excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
          covdeath_pc |   1.100999   .0889751    12.37   0.000     .9221026    1.279895
                p_pos |  -.0837113   .0879386    -0.95   0.346    -.2605237     .093101
                      |
c.covdeath_pc#c.p_pos |   .0068517   .0024368     2.81   0.007     .0019523    .0117512
                      |
                _cons |   6.073375   1.901709     3.19   0.002     2.249734    9.897017
---------------------------------------------------------------------------------------

. reg excess_respir_deaths_pc c.covdeath_pc##c.p_pos [aweight=population] if days_to_report > 14, clu
> ster(fips)
(sum of wgt is 2,254,525,234)

Linear regression                               Number of obs     =        358
                                                F(3, 48)          =   40581.28
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9976
                                                Root MSE          =     2.8877

                                           (Std. Err. adjusted for 49 clusters in fips)
---------------------------------------------------------------------------------------
                      |               Robust
excess_respir_death~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
          covdeath_pc |   .9735613   .0236655    41.14   0.000     .9259787    1.021144
                p_pos |   .0369401   .0199154     1.85   0.070    -.0031024    .0769827
                      |
c.covdeath_pc#c.p_pos |   .0018343   .0006312     2.91   0.006     .0005652    .0031033
                      |
                _cons |   1.247088   .4562549     2.73   0.009     .3297264     2.16445
---------------------------------------------------------------------------------------

. 
. reg f.adj_excess_deaths_pc c.new_pos_pc##c.p_pos [aweight=population] if days_to_report > 14, clust
> er(fips)
(sum of wgt is 2,254,525,234)

Linear regression                               Number of obs     =        358
                                                F(3, 48)          =     161.35
                                                Prob > F          =     0.0000
                                                R-squared         =     0.8617
                                                Root MSE          =     30.652

                                          (Std. Err. adjusted for 49 clusters in fips)
--------------------------------------------------------------------------------------
F.                   |               Robust
adj_excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
          new_pos_pc |   .0515292   .0151466     3.40   0.001     .0210749    .0819836
               p_pos |   .1081135   .1591809     0.68   0.500    -.2119411    .4281682
                     |
c.new_pos_pc#c.p_pos |   .0014177   .0004791     2.96   0.005     .0004544    .0023811
                     |
               _cons |   8.455453   3.626117     2.33   0.024     1.164656    15.74625
--------------------------------------------------------------------------------------

. reg f.adj_excess_respir_deaths_pc c.new_pos_pc##c.p_pos [aweight=population] if days_to_report > 14
> , cluster(fips)
(sum of wgt is 2,254,525,234)

Linear regression                               Number of obs     =        358
                                                F(3, 48)          =     127.07
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9098
                                                Root MSE          =     18.688

                                          (Std. Err. adjusted for 49 clusters in fips)
--------------------------------------------------------------------------------------
F.                   |               Robust
adj_excess_respir_~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
          new_pos_pc |   .0375305   .0114469     3.28   0.002      .014515    .0605461
               p_pos |   .1542708   .0910791     1.69   0.097     -.028856    .3373976
                     |
c.new_pos_pc#c.p_pos |   .0011378   .0003714     3.06   0.004     .0003911    .0018846
                     |
               _cons |   1.934535   2.478933     0.78   0.439    -3.049693    6.918763
--------------------------------------------------------------------------------------

. 
. 
. log close
      name:  <unnamed>
       log:  C:\Users\favero\Documents\GitHub\covid-underreporting\data\..\logs\cleandata.txt
  log type:  text
 closed on:  24 May 2020, 21:51:25
-----------------------------------------------------------------------------------------------------
