-------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\favero\Documents\GitHub\covid-underrepo
> rting\code\..\logs\cleandata.txt
  log type:  text
 opened on:  11 Jun 2020, 17:54:29

. 
. use "..\data\population.dta" // start from this file becaus
> e it has both fips codes and state names

. 
. merge 1:m fips using "..\data\covidtracking.dta", keep(2 3)

    Result                           # of obs.
    -----------------------------------------
    not matched                           435
        from master                         0  (_merge==1)
        from using                        435  (_merge==2)

    matched                             5,014  (_merge==3)
    -----------------------------------------

. drop _merge population risk_standardized_population // merg
> e population back in later because want it merged to all ob
> servations, even those missing from the current dataset

. 
. merge 1:1 state date using "..\data\past_reports\ 6 Jun 202
> 0 cdc_deaths.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                         5,069
        from master                     4,782  (_merge==1)
        from using                        287  (_merge==2)

    matched                               667  (_merge==3)
    -----------------------------------------

. drop _merge

. 
. merge 1:1 state date using "..\data\cdc_historical_deaths.d
> ta"

    Result                           # of obs.
    -----------------------------------------
    not matched                        23,635
        from master                     4,817  (_merge==1)
        from using                     18,818  (_merge==2)

    matched                               919  (_merge==3)
    -----------------------------------------

. drop _merge

. 
. drop fips

. merge m:1 state using "..\data\population.dta", keep(1 3)

    Result                           # of obs.
    -----------------------------------------
    not matched                           471
        from master                       471  (_merge==1)
        from using                          0  (_merge==2)

    matched                            24,083  (_merge==3)
    -----------------------------------------

. drop _merge

. order date fips

. sort fips state date

. 
. // bring in delay multipliers, which adjust expected deaths
>  for reporting lag: https://www.cdc.gov/nchs/data/vsrr/repo
> rt001.pdf
. // note: excess deaths do not adjust for how the individual
>  state was doing relative to expectations pre-covid this ye
> ar
. gen end_week = date + mod(6 - dow(date), 7)

. format end_week %tdCCYYNNDD

. order end_week, after(date)

. gen days_to_report = report_date - end_week
(23,600 missing values generated)

. merge m:1 state days_to_report using "..\data\delay_multipl
> iers.dta", keep(1 3)

    Result                           # of obs.
    -----------------------------------------
    not matched                        23,804
        from master                    23,804  (_merge==1)
        from using                          0  (_merge==2)

    matched                               750  (_merge==3)
    -----------------------------------------

. drop _merge

. replace delay_multiplier = 1 if days_to_report >= 118 & del
> ay_multiplier == . & days_to_report != .
(106 real changes made)

. 
. drop if fips > 56
(471 observations deleted)

. 
. //drop if fips == 9 | fips == 37 // Connecticut and North C
> arolina's provisional death data look highly problematic, s
> o they are not included in analyses using death counts; how
> ever, they are kept in the dataset for analysis of hospital
> izations
. 
. encode dataqualitygrade, gen(datagrade)

. order datagrade, after(dataqualitygrade)

. drop dataqualitygrade

. 
. drop hash datechecked // new variables added to more recent
>  versions of covidtracking's data that interfere with follo
> wing code:

. foreach var of varlist positive-datagrade death-pneumon_inf
> lu_or_covid numinfluenzadeaths-percentcomplete {
  2.         gen `var'_mis = (`var'==.)
  3. }

. gen dayscollapsed = 1

. sort fips state date

. 
end of do-file

. exit, clear
