-----------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\favero\Documents\GitHub\covid-underreporting\data\..\logs\cleandata.txt
  log type:  text
 opened on:  26 May 2020, 22:59:37

. 
. use "..\data\population.dta" // start from this file because it has both fips codes and state names

. 
. merge 1:m fips using "..\data\covidtracking.dta", keep(2 3)

    Result                           # of obs.
    -----------------------------------------
    not matched                           355
        from master                         0  (_merge==1)
        from using                        355  (_merge==2)

    matched                             4,198  (_merge==3)
    -----------------------------------------

. drop _merge population // merge population back in later because want it merged to all observations
> , even those missing from the current dataset

. 
. merge 1:1 state date using "..\data\cdc_deaths.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                         4,222
        from master                     3,937  (_merge==1)
        from using                        285  (_merge==2)

    matched                               616  (_merge==3)
    -----------------------------------------

. drop _merge

. 
. merge 1:1 state date using "..\data\cdc_historical_deaths.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                        22,890
        from master                     4,072  (_merge==1)
        from using                     18,818  (_merge==2)

    matched                               766  (_merge==3)
    -----------------------------------------

. drop _merge

. 
. drop fips

. merge m:1 state using "..\data\population.dta", keep(1 3)

    Result                           # of obs.
    -----------------------------------------
    not matched                           389
        from master                       389  (_merge==1)
        from using                          0  (_merge==2)

    matched                            23,267  (_merge==3)
    -----------------------------------------

. drop _merge

. order date fips

. sort fips state date

. 
. drop if fips > 56
(389 observations deleted)

. 
. encode dataqualitygrade, gen(datagrade)

. order datagrade, after(dataqualitygrade)

. drop dataqualitygrade

. 
. gen end_week = date + mod(6 - dow(date), 7)

. format end_week %tdCCYYNNDD

. order end_week, after(date)

. 
. foreach var of varlist positive-datagrade death-pneumon_influ_or_covid numinfluenzadeaths-percentco
> mplete {
  2.         gen `var'_mis = (`var'==.)
  3. }

. gen dayscollapsed = 1

. collapse (firstnm) state report_date epi_week (lastnm) positive-datagrade population death-posneg (
> sum) deathincrease-pneumon_influ_or_covid numinfluenzadeaths-percentcomplete *_mis dayscollapsed, b
> y(end_week fips)

. foreach var of varlist positive-datagrade {
  2.         replace `var' = . if `var'_mis > 0
  3. }
(0 real changes made)
(16 real changes made, 16 to missing)
(51 real changes made, 51 to missing)
(52 real changes made, 52 to missing)
(48 real changes made, 48 to missing)
(35 real changes made, 35 to missing)
(18 real changes made, 18 to missing)
(28 real changes made, 28 to missing)
(12 real changes made, 12 to missing)
(45 real changes made, 45 to missing)
(51 real changes made, 51 to missing)

. foreach var of varlist death-pneumon_influ_or_covid numinfluenzadeaths-percentcomplete {
  2.         replace `var' = . if `var'_mis == dayscollapsed
  3. }
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(19,083 real changes made, 19,083 to missing)
(19,083 real changes made, 19,083 to missing)
(19,083 real changes made, 19,083 to missing)
(19,083 real changes made, 19,083 to missing)
(19,083 real changes made, 19,083 to missing)
(18,870 real changes made, 18,870 to missing)
(18,870 real changes made, 18,870 to missing)
(18,870 real changes made, 18,870 to missing)
(18,870 real changes made, 18,870 to missing)
(18,870 real changes made, 18,870 to missing)
(18,870 real changes made, 18,870 to missing)
(18,870 real changes made, 18,870 to missing)
(153 real changes made, 153 to missing)
(153 real changes made, 153 to missing)
(153 real changes made, 153 to missing)
(153 real changes made, 153 to missing)

. drop *_mis

. 
. xtset fips end_week, delta(7)
       panel variable:  fips (strongly balanced)
        time variable:  end_week, 20130105 to 20200530
                delta:  7 days

. 
. gen new_pos = d.positive if d.positive>=0
(19,120 missing values generated)

. gen new_neg = d.negative if d.negative>=0
(19,164 missing values generated)

. gen p_pos = new_pos/(new_pos+new_neg)*100
(19,164 missing values generated)

. order new_pos-p_pos, after(negative)

. 
. // adjust expected deaths for reporting lag: https://www.cdc.gov/nchs/data/vsrr/report001.pdf
. // maybe also somehow adjust for how the individual state was doing relative to expectations pre-co
> vid
. gen days_to_report = report_date - end_week
(18,870 missing values generated)

. 
. drop if fips == 9 | fips == 37 // Connecticut and North Carolina's data look highly problematic, so
>  dropping them
(774 observations deleted)

. 
. /*
> gen allcause_minus_posscovid = total_deaths - pneumon_influ_or_covid
> gen allcause_minus_posscovid_pc  = allcause_minus_posscovid*100000/population
> bys days_to_report: sum allcause_minus_posscovid_pc
> gen adj_allcause_minus_posscovid_pc = allcause_minus_posscovid_pc
> replace adj_allcause_minus_posscovid_pc = allcause_minus_posscovid_pc * 212 / 93 if days_to_report 
> <= 7 & days_to_report != .
> replace adj_allcause_minus_posscovid_pc = allcause_minus_posscovid_pc * 212 / 159 if days_to_report
>  > 7 & days_to_report <= 14
> replace adj_allcause_minus_posscovid_pc = allcause_minus_posscovid_pc * 212 / 192 if days_to_report
>  > 14 & days_to_report <= 21
> */
. 
. //gen adj_expected_deaths = expected_deaths
. //replace adj_expected_deaths = expected_deaths * 93 / 212 if days_to_report <= 7 & days_to_report 
> != .
. //replace adj_expected_deaths = expected_deaths * 159 / 212 if days_to_report > 7 & days_to_report 
> <= 14
. //replace adj_expected_deaths = expected_deaths * 192 / 212 if days_to_report > 14 & days_to_report
>  <= 21
. gen adj_expected_deaths = expected_deaths * (1-exp(-.09246997*days_to_report))
(18,130 missing values generated)

. order adj_expected_deaths, after(expected_deaths)

. 
. gen pneumon_or_influ_fluview = numinfluenzadeaths + numpneumoniadeaths if end_week < date("20200201
> ","YMD")
(882 missing values generated)

. gen mmwrweek = substr(epi_week,-2,2)
(147 missing values generated)

. 
. //egen old_expected_influ_pneu_deaths = mean(pneumon_or_influ_fluview), by(fips mmwrweek)
. 
. // generate expected influenza/pneumonia deaths based on historical patterns
.         gen epi_year = substr(epi_week,1,4)
(147 missing values generated)

.         destring epi_year mmwrweek, replace
epi_year: all characters numeric; replaced as int
(147 missing values generated)
mmwrweek: all characters numeric; replaced as byte
(147 missing values generated)

.         replace epi_year = epi_year + 1 if mmwrweek >= 40
(4,508 real changes made)

. 
.         gen mmwrweek2 = mmwrweek - 39 if mmwrweek >= 40
(14,455 missing values generated)

.         replace mmwrweek2 = l.mmwrweek2 + 1 if mmwrweek < 40
(12,397 real changes made)

.         replace mmwrweek2 = mmwrweek + 13 if mmwrweek2 == .
(1,911 real changes made)

.         //gen pi_time = 2*_pi*mmwrweek2/52.1775
.         //gen sin_time = sin(pi_time)
.         //gen cos_time = cos(pi_time)
.         //gen halfsin_time = sin(pi_time/2)
.         //gen halfcos_time = cos(pi_time/2)
. 
.         gen pneumon_or_influ_fluview_pc = pneumon_or_influ_fluview * 100000 / population
(882 missing values generated)

.         
.         // most year-to-year variation in influenza severity seems to be from weeks 50 to 8; thus, 
> create a sin spike for this period with a year-varying coefficient
.         gen fluseason = 0 if mmwrweek != .
(147 missing values generated)

.         replace fluseason = 1 if (mmwrweek >= 50 | mmwrweek <= 8) & mmwrweek != .
(4,214 real changes made)

.         gen fluseason_sin_time = sin(fluseason*_pi*(mmwrweek2-10)/12)
(147 missing values generated)

.         
.         reg pneumon_or_influ_fluview_pc i.fips i.epi_year i.mmwrweek i.epi_year#c.fluseason_sin_tim
> e [aweight=population]
(sum of wgt is 115,934,690,088)

      Source |       SS           df       MS      Number of obs   =    18,081
-------------+----------------------------------   F(115, 17965)   =    521.03
       Model |  2010.13658       115  17.4794485   Prob > F        =    0.0000
    Residual |  602.682367    17,965  .033547585   R-squared       =    0.7693
-------------+----------------------------------   Adj R-squared   =    0.7679
       Total |  2612.81894    18,080  .144514322   Root MSE        =    .18316

-----------------------------------------------------------------------------------------------
  pneumon_or_influ_fluview_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                         fips |
                           2  |  -.5825264   .0302615   -19.25   0.000    -.6418418    -.523211
                           4  |  -.3205597    .014106   -22.73   0.000    -.3482088   -.2929106
                           5  |   .3051991   .0176652    17.28   0.000     .2705736    .3398245
                           6  |  -.2268413   .0115605   -19.62   0.000    -.2495009   -.2041817
                           8  |  -.4727203   .0148364   -31.86   0.000     -.501801   -.4436396
                          10  |  -.1437599   .0267869    -5.37   0.000    -.1962649    -.091255
                          11  |  -.4478159   .0307389   -14.57   0.000    -.5080672   -.3875647
                          12  |  -.2283191   .0120844   -18.89   0.000    -.2520057   -.2046326
                          13  |   -.412139   .0131831   -31.26   0.000    -.4379792   -.3862988
                          15  |    .276329    .023035    12.00   0.000     .2311783    .3214798
                          16  |  -.3940811   .0210972   -18.68   0.000    -.4354336   -.3527285
                          17  |  -.1206361   .0128411    -9.39   0.000    -.1458059   -.0954663
                          18  |   .0786389   .0143346     5.49   0.000     .0505417    .1067361
                          19  |   .1232256   .0174257     7.07   0.000     .0890695    .1573816
                          20  |   .0298226   .0178602     1.67   0.095    -.0051851    .0648303
                          21  |   .4487376   .0157915    28.42   0.000     .4177848    .4796904
                          22  |  -.2867302   .0156297   -18.35   0.000    -.3173659   -.2560945
                          23  |   .2510922   .0235066    10.68   0.000     .2050171    .2971674
                          24  |  -.1675401   .0146736   -11.42   0.000    -.1963017   -.1387785
                          25  |   .0308224   .0142642     2.16   0.031     .0028633    .0587816
                          26  |   -.053199    .013314    -4.00   0.000    -.0792956   -.0271023
                          27  |  -.2334791   .0149083   -15.66   0.000    -.2627007   -.2042575
                          28  |   .2135278   .0177415    12.04   0.000     .1787527    .2483029
                          29  |    .011761   .0146244     0.80   0.421    -.0169042    .0404262
                          30  |  -.1525114   .0257744    -5.92   0.000    -.2030317   -.1019911
                          31  |   .0210884   .0204999     1.03   0.304    -.0190934    .0612701
                          32  |  -.1912616   .0175541   -10.90   0.000    -.2256695   -.1568538
                          33  |  -.0829131   .0234012    -3.54   0.000    -.1287816   -.0370445
                          34  |  -.2831354   .0135839   -20.84   0.000    -.3097611   -.2565098
                          35  |  -.0679577   .0199224    -3.41   0.001    -.1070075   -.0289078
                          36  |   .0166138   .0122007     1.36   0.173    -.0073007    .0405283
                          38  |   .0977247   .0297295     3.29   0.001      .039452    .1559975
                          39  |  -.0025399   .0129908    -0.20   0.845    -.0280031    .0229233
                          40  |   .3447875    .016316    21.13   0.000     .3128066    .3767684
                          41  |  -.3377835   .0160344   -21.07   0.000    -.3692125   -.3063545
                          42  |  -.0007948   .0128229    -0.06   0.951    -.0259289    .0243392
                          44  |    .163297   .0258683     6.31   0.000     .1125927    .2140013
                          45  |  -.0202714   .0152352    -1.33   0.183    -.0501338    .0095911
                          46  |   .2430771   .0278897     8.72   0.000     .1884105    .2977436
                          47  |   .2196776   .0142916    15.37   0.000     .1916646    .2476906
                          48  |  -.3041931   .0117896   -25.80   0.000    -.3273018   -.2810843
                          49  |  -.5313371   .0173413   -30.64   0.000    -.5653278   -.4973465
                          50  |   .1005237   .0324517     3.10   0.002     .0369154    .1641321
                          51  |  -.3291503   .0136816   -24.06   0.000    -.3559676    -.302333
                          53  |  -.2774458   .0139801   -19.85   0.000    -.3048482   -.2500435
                          54  |   .7406933   .0210753    35.15   0.000     .6993837    .7820028
                          55  |  -.1767177    .014799   -11.94   0.000    -.2057252   -.1477102
                          56  |  -.0795715   .0335577    -2.37   0.018    -.1453478   -.0137952
                              |
                     epi_year |
                        2014  |  -.0286355   .0062144    -4.61   0.000    -.0408164   -.0164545
                        2015  |  -.0050376   .0062301    -0.81   0.419    -.0172493     .007174
                        2016  |  -.0136425   .0062144    -2.20   0.028    -.0258234   -.0014616
                        2017  |  -.0224213   .0062144    -3.61   0.000    -.0346023   -.0102404
                        2018  |  -.0496476   .0062144    -7.99   0.000    -.0618285   -.0374667
                        2019  |   -.057876   .0062144    -9.31   0.000    -.0700569   -.0456951
                        2020  |  -.0932328    .009971    -9.35   0.000    -.1127769   -.0736887
                              |
                     mmwrweek |
                           2  |   .0943287   .0143391     6.58   0.000     .0662228    .1224347
                           3  |   .0435352   .0150767     2.89   0.004     .0139834    .0730871
                           4  |  -.0046308   .0139235    -0.33   0.739    -.0319222    .0226606
                           5  |   .0089999    .013824     0.65   0.515    -.0180965    .0360963
                           6  |   .0616996   .0188315     3.28   0.001      .024788    .0986112
                           7  |   .1805674   .0299012     6.04   0.000     .1219583    .2391766
                           8  |   .2913603   .0444062     6.56   0.000     .2043198    .3784008
                           9  |   .3732969   .0580381     6.43   0.000     .2595366    .4870573
                          10  |   .3626572   .0580381     6.25   0.000     .2488969    .4764176
                          11  |   .3281918   .0580381     5.65   0.000     .2144314    .4419521
                          12  |   .2772211   .0580381     4.78   0.000     .1634607    .3909814
                          13  |   .2442106   .0580381     4.21   0.000     .1304502    .3579709
                          14  |    .220976   .0580381     3.81   0.000     .1072156    .3347363
                          15  |   .1877382   .0580381     3.23   0.001     .0739778    .3014985
                          16  |   .1300835   .0580381     2.24   0.025     .0163232    .2438439
                          17  |   .0777488   .0580381     1.34   0.180    -.0360116    .1915091
                          18  |    .046648   .0580381     0.80   0.422    -.0671123    .1604084
                          19  |   .0195485   .0580381     0.34   0.736    -.0942118    .1333089
                          20  |  -.0182816   .0580381    -0.31   0.753     -.132042    .0954787
                          21  |  -.0234196   .0580381    -0.40   0.687      -.13718    .0903407
                          22  |  -.0630231   .0580381    -1.09   0.278    -.1767834    .0507373
                          23  |  -.0398794   .0580381    -0.69   0.492    -.1536397    .0738809
                          24  |    -.06175   .0580381    -1.06   0.287    -.1755103    .0520104
                          25  |  -.0813471   .0580381    -1.40   0.161    -.1951074    .0324133
                          26  |  -.0945785   .0580381    -1.63   0.103    -.2083389    .0191818
                          27  |  -.1124478   .0580381    -1.94   0.053    -.2262082    .0013125
                          28  |     -.1049   .0580381    -1.81   0.071    -.2186603    .0088604
                          29  |     -.1335   .0580381    -2.30   0.021    -.2472603   -.0197396
                          30  |  -.1346367   .0580381    -2.32   0.020     -.248397   -.0208763
                          31  |  -.1411387   .0580381    -2.43   0.015    -.2548991   -.0273784
                          32  |   -.149596   .0580381    -2.58   0.010    -.2633563   -.0358356
                          33  |  -.1476863   .0580381    -2.54   0.011    -.2614466   -.0339259
                          34  |  -.1430939   .0580381    -2.47   0.014    -.2568543   -.0293336
                          35  |  -.1535518   .0580381    -2.65   0.008    -.2673121   -.0397914
                          36  |  -.1354097   .0580381    -2.33   0.020      -.24917   -.0216493
                          37  |  -.1162672   .0580381    -2.00   0.045    -.2300276   -.0025069
                          38  |  -.1041725   .0580381    -1.79   0.073    -.2179328    .0095879
                          39  |  -.1020354   .0580381    -1.76   0.079    -.2157958    .0117249
                          40  |  -.0629356   .0580304    -1.08   0.278    -.1766808    .0508096
                          41  |  -.0591617   .0580304    -1.02   0.308    -.1729069    .0545836
                          42  |  -.0302889   .0580304    -0.52   0.602    -.1440341    .0834564
                          43  |   -.022832   .0580304    -0.39   0.694    -.1365772    .0909133
                          44  |  -.0224228   .0580304    -0.39   0.699     -.136168    .0913225
                          45  |  -.0082819   .0580304    -0.14   0.887    -.1220271    .1054633
                          46  |   .0037674   .0580304     0.06   0.948    -.1099779    .1175126
                          47  |   .0109969   .0580304     0.19   0.850    -.1027483    .1247422
                          48  |   .0504185   .0580304     0.87   0.385    -.0633267    .1641637
                          49  |   .0999342   .0580304     1.72   0.085     -.013811    .2136794
                          50  |   .0123089   .0420319     0.29   0.770    -.0700777    .0946955
                          51  |  -.0901592   .0278144    -3.24   0.001    -.1446781   -.0356403
                          52  |  -.0969597   .0174602    -5.55   0.000    -.1311833   -.0627361
                          53  |   .0863107   .0292583     2.95   0.003     .0289616    .1436599
                              |
epi_year#c.fluseason_sin_time |
                        2013  |   .7851516   .0648531    12.11   0.000     .6580334    .9122698
                        2014  |   .5757474   .0647532     8.89   0.000     .4488249    .7026699
                        2015  |   .8378202   .0674693    12.42   0.000     .7055739    .9700665
                        2016  |   .2471254   .0647532     3.82   0.000     .1202028    .3740479
                        2017  |    .506053   .0647532     7.82   0.000     .3791305    .6329755
                        2018  |   1.079833   .0647532    16.68   0.000     .9529101    1.206755
                        2019  |   .3367439   .0647532     5.20   0.000     .2098213    .4636664
                        2020  |   .4147721   .0662991     6.26   0.000     .2848196    .5447246
                              |
                        _cons |   1.155233   .0585024    19.75   0.000     1.040563    1.269903
-----------------------------------------------------------------------------------------------

.         predict expected_influ_pneu_deaths_pc
(option xb assumed; fitted values)
(147 missing values generated)

.         gen expected_influ_pneu_deaths = expected_influ_pneu_deaths_pc * population / 100000
(147 missing values generated)

. 
. //gen adj_expected_influ_pneu_deaths = expected_influ_pneu_deaths
. //replace adj_expected_influ_pneu_deaths = expected_influ_pneu_deaths * 93 / 212 if days_to_report 
> <= 7 & days_to_report != .
. //replace adj_expected_influ_pneu_deaths = expected_influ_pneu_deaths * 159 / 212 if days_to_report
>  > 7 & days_to_report <= 14
. //replace adj_expected_influ_pneu_deaths = expected_influ_pneu_deaths * 192 / 212 if days_to_report
>  > 14 & days_to_report <= 21
. gen adj_expected_influ_pneu_deaths = expected_influ_pneu_deaths * (1-exp(-.09246997*days_to_report)
> )
(18,228 missing values generated)

. order adj_expected_influ_pneu_deaths, after(expected_influ_pneu_deaths)

. 
. replace covid_deaths = 5 if covid_deaths == . & total_deaths != . //rough imputation for where data
>  is supressed for 1-9 deaths
(0 real changes made)

. 
. 
. gen cumulative_covdeath = covid_deaths
(18,130 missing values generated)

. replace cumulative_covdeath = cumulative_covdeath + l.cumulative_covdeath if l.cumulative_covdeath 
> != .
(454 real changes made)

. 
. //gen adj_covid_deaths = covid_deaths
. //replace adj_covid_deaths = covid_deaths * 212 / 93 if days_to_report <= 7 & days_to_report != .
. //replace adj_covid_deaths = covid_deaths * 212 / 159 if days_to_report > 7 & days_to_report <= 14
. //replace adj_covid_deaths = covid_deaths * 212 / 192 if days_to_report > 14 & days_to_report <= 21
. 
. gen adj_covid_deaths = covid_deaths / (1-exp(-.09246997*days_to_report))
(18,130 missing values generated)

. gen adj_cumulative_covdeath = adj_covid_deaths
(18,130 missing values generated)

. replace adj_cumulative_covdeath = adj_cumulative_covdeath + l.adj_cumulative_covdeath if l.adj_cumu
> lative_covdeath != .
(454 real changes made)

. 
. gen adj_total_deaths = total_deaths / (1-exp(-.09246997*days_to_report))
(18,130 missing values generated)

. gen adj_pneumon_influ_or_covid = pneumon_influ_or_covid / (1-exp(-.09246997*days_to_report))
(18,130 missing values generated)

. 
. 
. gen covdeath_pc = covid_deaths*100000/population
(18,130 missing values generated)

. gen excess_deaths_pc = (total_deaths-adj_expected_deaths)*100000/population
(18,130 missing values generated)

. gen excess_respir_deaths_pc = (pneumon_influ_or_covid-adj_expected_influ_pneu_deaths)*100000/popula
> tion
(18,228 missing values generated)

. gen adj_excess_deaths_pc = (adj_total_deaths-expected_deaths)*100000/population
(18,130 missing values generated)

. gen adj_excess_respir_deaths_pc = (adj_pneumon_influ_or_covid-expected_influ_pneu_deaths)*100000/po
> pulation
(18,228 missing values generated)

. gen new_pos_pc = new_pos*100000/population
(18,370 missing values generated)

. gen new_neg_pc = new_neg*100000/population
(18,411 missing values generated)

. gen new_tests_pc = new_pos_pc + new_neg_pc
(18,411 missing values generated)

. gen deathincrease_pc = deathincrease*100000/population
(18,334 missing values generated)

. gen adj_covid_deaths_pc = adj_covid_deaths*100000/population
(18,130 missing values generated)

. 
. /*
> gen log_covdeath = log(covid_deaths)
>         //replace log_covdeath = 2 if covid_deaths==0
> gen log_allcause = log(total_deaths)
> gen log_expected = log(adj_expected_deaths)
> gen excess_deaths = log_allcause-log_expected
> */
. 
. save "..\data\weeklydata.dta", replace
file ..\data\weeklydata.dta saved

. 
. 
. reg excess_deaths_pc covdeath_pc [aweight=population] if days_to_report > 14, cluster(fips) nocons
(sum of wgt is 4,712,792,280)

Linear regression                               Number of obs     =        735
                                                F(1, 48)          =    6736.46
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9289
                                                Root MSE          =      1.667

                                  (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
excess_dea~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 covdeath_pc |   1.357013   .0165336    82.08   0.000      1.32377    1.390256
------------------------------------------------------------------------------

. margins, dydx(covdeath_pc)

Average marginal effects                        Number of obs     =        735
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : covdeath_pc

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 covdeath_pc |   1.357013   .0165336    82.08   0.000      1.32377    1.390256
------------------------------------------------------------------------------

. 
. twoway (scatter excess_deaths_pc covdeath_pc if days_to_report > 14, mcolor(%30) yline(0)) (functio
> n y=x, range(0 40))

. 
. reg excess_deaths_pc covdeath_pc [aweight=population] if days_to_report > 14, cluster(fips)
(sum of wgt is 4,712,792,280)

Linear regression                               Number of obs     =        735
                                                F(1, 48)          =    5755.01
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9212
                                                Root MSE          =     1.6659

                                  (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
excess_dea~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 covdeath_pc |   1.364073    .017981    75.86   0.000     1.327919    1.400226
       _cons |  -.0914015   .2143838    -0.43   0.672    -.5224489     .339646
------------------------------------------------------------------------------

. reg excess_deaths_pc c.covdeath_pc c.p_pos [aweight=population] if days_to_report > 14, cluster(fip
> s)
(sum of wgt is 2,568,711,386)

Linear regression                               Number of obs     =        407
                                                F(2, 48)          =    2997.99
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9500
                                                Root MSE          =     1.6633

                                  (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
excess_dea~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 covdeath_pc |   1.334294   .0202494    65.89   0.000      1.29358    1.375008
       p_pos |    .016834   .0140238     1.20   0.236    -.0113627    .0450307
       _cons |  -.1513885   .2621367    -0.58   0.566    -.6784497    .3756726
------------------------------------------------------------------------------

. reg excess_deaths_pc c.covdeath_pc##c.p_pos [aweight=population] if days_to_report > 14, cluster(fi
> ps)
(sum of wgt is 2,568,711,386)

Linear regression                               Number of obs     =        407
                                                F(3, 48)          =    2559.84
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9548
                                                Root MSE          =     1.5836

                                           (Std. Err. adjusted for 49 clusters in fips)
---------------------------------------------------------------------------------------
                      |               Robust
     excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
          covdeath_pc |   1.034926   .0801514    12.91   0.000     .8737708    1.196081
                p_pos |   .0045759   .0105584     0.43   0.667    -.0166531     .025805
                      |
c.covdeath_pc#c.p_pos |   .0079189    .002323     3.41   0.001     .0032482    .0125896
                      |
                _cons |   .2640712   .2326115     1.14   0.262    -.2036256    .7317679
---------------------------------------------------------------------------------------

. reg excess_deaths_pc c.covdeath_pc c.new_pos_pc c.new_neg_pc [aweight=population] if days_to_report
>  > 14, cluster(fips)
(sum of wgt is 2,568,711,386)

Linear regression                               Number of obs     =        407
                                                F(3, 48)          =    5228.67
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9559
                                                Root MSE          =     1.5637

                                  (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
excess_dea~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 covdeath_pc |   1.212258   .0633504    19.14   0.000     1.084884    1.339633
  new_pos_pc |   .0160308   .0071396     2.25   0.029     .0016756     .030386
  new_neg_pc |  -.0030738   .0009077    -3.39   0.001    -.0048988   -.0012488
       _cons |   .5182408   .2031106     2.55   0.014     .1098595    .9266221
------------------------------------------------------------------------------

. reg excess_deaths_pc c.covdeath_pc##c.new_pos_pc c.covdeath_pc##c.new_neg_pc [aweight=population] i
> f days_to_report > 14, cluster(fips)
(sum of wgt is 2,568,711,386)
note: covdeath_pc omitted because of collinearity

Linear regression                               Number of obs     =        407
                                                F(5, 48)          =    2841.81
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9584
                                                Root MSE          =      1.522

                                                (Std. Err. adjusted for 49 clusters in fips)
--------------------------------------------------------------------------------------------
                           |               Robust
          excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------------+----------------------------------------------------------------
               covdeath_pc |    1.24525   .1038818    11.99   0.000     1.036381    1.454118
                new_pos_pc |   .0141439   .0060851     2.32   0.024     .0019091    .0263787
                           |
c.covdeath_pc#c.new_pos_pc |   .0004731   .0002304     2.05   0.045     9.89e-06    .0009363
                           |
               covdeath_pc |          0  (omitted)
                new_neg_pc |  -.0016905   .0009562    -1.77   0.083    -.0036132    .0002321
                           |
c.covdeath_pc#c.new_neg_pc |   -.000351   .0001156    -3.04   0.004    -.0005834   -.0001186
                           |
                     _cons |   .3233775    .216893     1.49   0.143    -.1127151    .7594702
--------------------------------------------------------------------------------------------

. reg excess_deaths_pc c.covdeath_pc c.new_tests_pc [aweight=population] if days_to_report > 14, clus
> ter(fips)
(sum of wgt is 2,568,711,386)

Linear regression                               Number of obs     =        407
                                                F(2, 48)          =    5027.48
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9527
                                                Root MSE          =     1.6166

                                  (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
excess_dea~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 covdeath_pc |   1.405447   .0233609    60.16   0.000     1.358477    1.452417
new_tests_pc |  -.0020447   .0006874    -2.97   0.005    -.0034269   -.0006626
       _cons |   .5729729    .199575     2.87   0.006     .1717004    .9742454
------------------------------------------------------------------------------

. reg excess_deaths_pc c.covdeath_pc##c.new_tests_pc [aweight=population] if days_to_report > 14, clu
> ster(fips)
(sum of wgt is 2,568,711,386)

Linear regression                               Number of obs     =        407
                                                F(3, 48)          =    2180.41
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9543
                                                Root MSE          =     1.5918

                                                  (Std. Err. adjusted for 49 clusters in fips)
----------------------------------------------------------------------------------------------
                             |               Robust
            excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                 covdeath_pc |    1.59603   .1198122    13.32   0.000     1.355132    1.836929
                new_tests_pc |  -.0015019   .0006631    -2.27   0.028     -.002835   -.0001687
                             |
c.covdeath_pc#c.new_tests_pc |  -.0002743    .000141    -1.95   0.058    -.0005577    9.19e-06
                             |
                       _cons |   .3110045   .2221048     1.40   0.168    -.1355672    .7575761
----------------------------------------------------------------------------------------------

. reg excess_deaths_pc c.covdeath_pc##c.new_tests_pc c.covdeath_pc##c.p_pos [aweight=population] if d
> ays_to_report > 14, cluster(fips)
(sum of wgt is 2,568,711,386)
note: covdeath_pc omitted because of collinearity

Linear regression                               Number of obs     =        407
                                                F(5, 48)          =    2243.61
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9559
                                                Root MSE          =     1.5672

                                                  (Std. Err. adjusted for 49 clusters in fips)
----------------------------------------------------------------------------------------------
                             |               Robust
            excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                 covdeath_pc |   1.292428   .1661002     7.78   0.000     .9584614    1.626395
                new_tests_pc |  -.0009501   .0010066    -0.94   0.350     -.002974    .0010738
                             |
c.covdeath_pc#c.new_tests_pc |  -.0001695   .0001126    -1.50   0.139    -.0003959    .0000569
                             |
                 covdeath_pc |          0  (omitted)
                       p_pos |   -.003356     .01193    -0.28   0.780    -.0273429    .0206308
                             |
       c.covdeath_pc#c.p_pos |   .0054429   .0031418     1.73   0.090     -.000874    .0117598
                             |
                       _cons |   .4420229   .2765139     1.60   0.116    -.1139456    .9979914
----------------------------------------------------------------------------------------------

. reg excess_deaths_pc c.covdeath_pc##c.new_tests_pc##c.p_pos [aweight=population] if days_to_report 
> > 14, cluster(fips)
(sum of wgt is 2,568,711,386)

Linear regression                               Number of obs     =        407
                                                F(7, 48)          =    8188.61
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9589
                                                Root MSE          =     1.5168

                                                   (Std. Err. adjusted for 49 clusters in fips)
-----------------------------------------------------------------------------------------------
                              |               Robust
             excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                  covdeath_pc |   1.313461   .2151583     6.10   0.000      .880856    1.746066
                 new_tests_pc |  -.0022346   .0009931    -2.25   0.029    -.0042314   -.0002379
                              |
 c.covdeath_pc#c.new_tests_pc |  -.0004297   .0002218    -1.94   0.059    -.0008757    .0000163
                              |
                        p_pos |  -.0158833   .0095535    -1.66   0.103    -.0350919    .0033253
                              |
        c.covdeath_pc#c.p_pos |  -.0018035   .0048793    -0.37   0.713     -.011614     .008007
                              |
       c.new_tests_pc#c.p_pos |   .0001945   .0000638     3.05   0.004     .0000662    .0003227
                              |
 c.covdeath_pc#c.new_tests_pc#|
                      c.p_pos |   .0000101   6.31e-06     1.60   0.115    -2.57e-06    .0000228
                              |
                        _cons |   .5579786   .1904929     2.93   0.005     .1749668    .9409903
-----------------------------------------------------------------------------------------------

. 
. gen covdeath_pcXp_pos = covdeath_pc * p_pos
(18,458 missing values generated)

. reghv excess_deaths_pc covdeath_pc p_pos covdeath_pcXp_pos if days_to_report > 14, var( new_tests_p
> c covdeath_pc population) twostage cluster(fips)

Multiplicative heteroscedastic regression             Number of obs  =     407
Estimator: 2sls                                       Model chi2(6)  = 852.105
                                                      Prob > chi2    =   0.000
Log Likelihood              =  -855.499               Pseudo R2      =  0.3325
                                                      VWLS R2        =  0.9033
                                  (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
excess_dea~c |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
lp_mean      |
 covdeath_pc |   .9651018   .0951808    10.14   0.000     .7785509    1.151653
       p_pos |   .0084461   .0080673     1.05   0.295    -.0073654    .0242576
covdeath_p~s |   .0092952   .0027415     3.39   0.001     .0039221    .0146684
       _cons |  -.1757293   .2196678    -0.80   0.424    -.6062702    .2548117
-------------+----------------------------------------------------------------
lp_lnvar     |
new_tests_pc |   .0024245    .001657     1.46   0.143    -.0008232    .0056721
 covdeath_pc |  -.0453869   .0931221    -0.49   0.626    -.2279029    .1371291
  population |  -1.26e-08   7.64e-08    -0.17   0.869    -1.62e-07    1.37e-07
       _cons |   .5576546   .9039089     0.62   0.537    -1.213974    2.329283
------------------------------------------------------------------------------

. reghv excess_deaths_pc covdeath_pc p_pos covdeath_pcXp_pos if days_to_report > 14, var( new_tests_p
> c covdeath_pc population) cluster(fips)

iteration 1:  Log-likelihood =    -832.4  |delta-b|     .4777 
iteration 2:  Log-likelihood =    -828.7  |delta-b|     .1622 
iteration 3:  Log-likelihood =    -828.3  |delta-b|    .05415 
iteration 4:  Log-likelihood =    -828.3  |delta-b|     .0304 
iteration 5:  Log-likelihood =    -828.3  |delta-b|   .003628 
iteration 6:  Log-likelihood =    -828.3  |delta-b|   .002624 
iteration 7:  Log-likelihood =    -828.3  |delta-b|  .0008835 
iteration 8:  Log-likelihood =    -828.3  |delta-b|  .0004205 
iteration 9:  Log-likelihood =    -828.3  |delta-b|    .00016 

Multiplicative heteroscedastic regression             Number of obs  =     407
Estimator: mle                                        Model chi2(6)  = 906.534
                                                      Prob > chi2    =   0.000
Log Likelihood              =  -828.285               Pseudo R2      =  0.3537
                                                      VWLS R2        =  0.9001
                                  (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
excess_dea~c |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
lp_mean      |
 covdeath_pc |   1.125114   .0861744    13.06   0.000     .9562157    1.294013
       p_pos |  -.0063171   .0070559    -0.90   0.371    -.0201464    .0075123
covdeath_p~s |   .0061299    .002428     2.52   0.012     .0013712    .0108886
       _cons |   .3396258   .1877746     1.81   0.070    -.0284056    .7076572
-------------+----------------------------------------------------------------
lp_lnvar     |
new_tests_pc |   .0025915   .0006113     4.24   0.000     .0013933    .0037897
 covdeath_pc |  -.0157995   .0351569    -0.45   0.653    -.0847058    .0531068
  population |  -7.78e-08   1.93e-08    -4.02   0.000    -1.16e-07   -3.99e-08
       _cons |   .8818875   .3299419     2.67   0.008     .2352132    1.528562
------------------------------------------------------------------------------

. drop covdeath_pcXp_pos

. 
. 
. 
. reg deathincrease_pc adj_covid_deaths_pc [aweight=population] if days_to_report > 7, cluster(fips)
(sum of wgt is 3,453,559,742)

Linear regression                               Number of obs     =        530
                                                F(1, 48)          =    1003.16
                                                Prob > F          =     0.0000
                                                R-squared         =     0.8949
                                                Root MSE          =     1.3987

                                         (Std. Err. adjusted for 49 clusters in fips)
-------------------------------------------------------------------------------------
                    |               Robust
   deathincrease_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
adj_covid_deaths_pc |    .823644   .0260049    31.67   0.000     .7713577    .8759304
              _cons |   .3682269   .0855745     4.30   0.000     .1961679    .5402858
-------------------------------------------------------------------------------------

. reg deathincrease_pc adj_covid_deaths_pc l.adj_covid_deaths_pc [aweight=population] if days_to_repo
> rt > 7, cluster(fips)
(sum of wgt is 3,445,944,849)

Linear regression                               Number of obs     =        529
                                                F(2, 48)          =    1483.51
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9325
                                                Root MSE          =     1.1233

                                         (Std. Err. adjusted for 49 clusters in fips)
-------------------------------------------------------------------------------------
                    |               Robust
   deathincrease_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
adj_covid_deaths_pc |
                --. |   .4916429   .1298479     3.79   0.000     .2305662    .7527196
                L1. |   .3722701   .1672794     2.23   0.031     .0359322    .7086079
                    |
              _cons |   .3195057   .0676179     4.73   0.000     .1835508    .4554606
-------------------------------------------------------------------------------------

. reg deathincrease_pc c.adj_covid_deaths_pc##c.p_pos [aweight=population] if days_to_report > 7, clu
> ster(fips)
(sum of wgt is 2,882,897,538)

Linear regression                               Number of obs     =        456
                                                F(3, 48)          =     446.95
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9072
                                                Root MSE          =     1.4009

                                                   (Std. Err. adjusted for 49 clusters in fips)
-----------------------------------------------------------------------------------------------
                              |               Robust
             deathincrease_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
          adj_covid_deaths_pc |   1.118214     .03613    30.95   0.000      1.04557    1.190858
                        p_pos |  -.0067614   .0049833    -1.36   0.181     -.016781    .0032581
                              |
c.adj_covid_deaths_pc#c.p_pos |  -.0076794   .0006161   -12.47   0.000    -.0089181   -.0064408
                              |
                        _cons |   .2743662   .0813394     3.37   0.001     .1108224      .43791
-----------------------------------------------------------------------------------------------

. reg deathincrease_pc c.adj_covid_deaths_pc##c.new_tests_pc [aweight=population] if days_to_report >
>  7, cluster(fips)
(sum of wgt is 2,882,897,538)

Linear regression                               Number of obs     =        456
                                                F(3, 48)          =     980.97
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9183
                                                Root MSE          =     1.3145

                                            (Std. Err. adjusted for 49 clusters in fips)
----------------------------------------------------------------------------------------
                       |               Robust
      deathincrease_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------+----------------------------------------------------------------
   adj_covid_deaths_pc |   .7918033   .0616444    12.84   0.000     .6678589    .9157477
          new_tests_pc |   .0029957   .0006765     4.43   0.000     .0016355     .004356
                       |
 c.adj_covid_deaths_pc#|
        c.new_tests_pc |  -.0000605   .0000744    -0.81   0.420    -.0002101    .0000891
                       |
                 _cons |  -.4718051   .1599185    -2.95   0.005    -.7933428   -.1502675
----------------------------------------------------------------------------------------

. reg deathincrease_pc c.adj_covid_deaths_pc##c.new_tests_pc c.l.adj_covid_deaths_pc##c.new_tests_pc 
> [aweight=population] if days_to_report > 7, cluster(fips)
(sum of wgt is 2,882,897,538)
note: new_tests_pc omitted because of collinearity

Linear regression                               Number of obs     =        456
                                                F(5, 48)          =    2891.46
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9471
                                                Root MSE          =     1.0602

                                             (Std. Err. adjusted for 49 clusters in fips)
-----------------------------------------------------------------------------------------
                        |               Robust
       deathincrease_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
    adj_covid_deaths_pc |    .369478   .1216821     3.04   0.004     .1248198    .6141363
           new_tests_pc |   .0026265   .0006907     3.80   0.000     .0012378    .0040153
                        |
  c.adj_covid_deaths_pc#|
         c.new_tests_pc |   .0001498    .000266     0.56   0.576     -.000385    .0006845
                        |
    adj_covid_deaths_pc |
                    L1. |   .6204825    .112413     5.52   0.000     .3944611    .8465039
                        |
           new_tests_pc |          0  (omitted)
                        |
 cL.adj_covid_deaths_pc#|
         c.new_tests_pc |  -.0004035   .0002693    -1.50   0.141    -.0009451    .0001381
                        |
                  _cons |  -.4459986   .1494719    -2.98   0.004    -.7465319   -.1454652
-----------------------------------------------------------------------------------------

. reg deathincrease_pc c.excess_deaths_pc##c.new_tests_pc c.l.excess_deaths_pc##c.new_tests_pc [aweig
> ht=population] if days_to_report > 7, cluster(fips)
(sum of wgt is 2,882,897,538)
note: new_tests_pc omitted because of collinearity

Linear regression                               Number of obs     =        456
                                                F(5, 48)          =     584.18
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9060
                                                Root MSE          =     1.4132

                                                        (Std. Err. adjusted for 49 clusters in fips)
----------------------------------------------------------------------------------------------------
                                   |               Robust
                  deathincrease_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------------------+----------------------------------------------------------------
                  excess_deaths_pc |   .0806313   .0967586     0.83   0.409    -.1139148    .2751774
                      new_tests_pc |   .0041171   .0007782     5.29   0.000     .0025525    .0056817
                                   |
 c.excess_deaths_pc#c.new_tests_pc |    .000187   .0002213     0.85   0.402    -.0002579    .0006319
                                   |
                  excess_deaths_pc |
                               L1. |   .5382299   .1091609     4.93   0.000     .3187473    .7577126
                                   |
                      new_tests_pc |          0  (omitted)
                                   |
cL.excess_deaths_pc#c.new_tests_pc |  -.0002772   .0002147    -1.29   0.203    -.0007089    .0001546
                                   |
                             _cons |  -.6214519   .2315066    -2.68   0.010    -1.086927   -.1559767
----------------------------------------------------------------------------------------------------

. 
. 
. reg excess_deaths_pc covdeath_pc [aweight=population] if days_to_report > 14, cluster(fips)
(sum of wgt is 4,712,792,280)

Linear regression                               Number of obs     =        735
                                                F(1, 48)          =    5755.01
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9212
                                                Root MSE          =     1.6659

                                  (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
excess_dea~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 covdeath_pc |   1.364073    .017981    75.86   0.000     1.327919    1.400226
       _cons |  -.0914015   .2143838    -0.43   0.672    -.5224489     .339646
------------------------------------------------------------------------------

. reg excess_respir_deaths_pc covdeath_pc [aweight=population] if days_to_report > 14, cluster(fips)
(sum of wgt is 4,712,792,280)

Linear regression                               Number of obs     =        735
                                                F(1, 48)          >   99999.00
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9960
                                                Root MSE          =     .27878

                                  (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
excess_res~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 covdeath_pc |   1.050747   .0032735   320.99   0.000     1.044166    1.057329
       _cons |   .0396745   .0261261     1.52   0.135    -.0128556    .0922046
------------------------------------------------------------------------------

. 
. reg excess_deaths_pc c.covdeath_pc##c.p_pos [aweight=population] if days_to_report > 14, cluster(fi
> ps)
(sum of wgt is 2,568,711,386)

Linear regression                               Number of obs     =        407
                                                F(3, 48)          =    2559.84
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9548
                                                Root MSE          =     1.5836

                                           (Std. Err. adjusted for 49 clusters in fips)
---------------------------------------------------------------------------------------
                      |               Robust
     excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
          covdeath_pc |   1.034926   .0801514    12.91   0.000     .8737708    1.196081
                p_pos |   .0045759   .0105584     0.43   0.667    -.0166531     .025805
                      |
c.covdeath_pc#c.p_pos |   .0079189    .002323     3.41   0.001     .0032482    .0125896
                      |
                _cons |   .2640712   .2326115     1.14   0.262    -.2036256    .7317679
---------------------------------------------------------------------------------------

. reg excess_respir_deaths_pc c.covdeath_pc##c.p_pos [aweight=population] if days_to_report > 14, clu
> ster(fips)
(sum of wgt is 2,568,711,386)

Linear regression                               Number of obs     =        407
                                                F(3, 48)          =   36615.82
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9974
                                                Root MSE          =     .28873

                                           (Std. Err. adjusted for 49 clusters in fips)
---------------------------------------------------------------------------------------
                      |               Robust
excess_respir_death~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
          covdeath_pc |   .9707717   .0195314    49.70   0.000     .9315012    1.010042
                p_pos |   .0047397   .0020312     2.33   0.024     .0006557    .0088238
                      |
c.covdeath_pc#c.p_pos |   .0018088   .0005119     3.53   0.001     .0007795    .0028382
                      |
                _cons |   .0791933   .0461164     1.72   0.092      -.01353    .1719165
---------------------------------------------------------------------------------------

. 
. reg f.adj_excess_deaths_pc c.new_pos_pc##c.p_pos [aweight=population] if days_to_report > 14, clust
> er(fips)
(sum of wgt is 2,568,711,386)

Linear regression                               Number of obs     =        407
                                                F(3, 48)          =      35.29
                                                Prob > F          =     0.0000
                                                R-squared         =     0.7378
                                                Root MSE          =     4.2705

                                          (Std. Err. adjusted for 49 clusters in fips)
--------------------------------------------------------------------------------------
F.                   |               Robust
adj_excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
          new_pos_pc |   .0132052   .0152937     0.86   0.392     -.017545    .0439553
               p_pos |   .0529613   .0213379     2.48   0.017     .0100587     .095864
                     |
c.new_pos_pc#c.p_pos |   .0021528   .0004936     4.36   0.000     .0011604    .0031453
                     |
               _cons |   -.416047   .5023666    -0.83   0.412    -1.426123    .5940288
--------------------------------------------------------------------------------------

. reg f.adj_excess_respir_deaths_pc c.new_pos_pc##c.p_pos [aweight=population] if days_to_report > 14
> , cluster(fips)
(sum of wgt is 2,254,525,234)

Linear regression                               Number of obs     =        358
                                                F(3, 48)          =     124.53
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9049
                                                Root MSE          =     1.8911

                                          (Std. Err. adjusted for 49 clusters in fips)
--------------------------------------------------------------------------------------
F.                   |               Robust
adj_excess_respir_~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
          new_pos_pc |   .0327194    .012056     2.71   0.009     .0084792    .0569597
               p_pos |   .0144312   .0091548     1.58   0.122    -.0039757    .0328381
                     |
c.new_pos_pc#c.p_pos |   .0012189   .0004042     3.02   0.004     .0004063    .0020316
                     |
               _cons |   .2442378    .255065     0.96   0.343    -.2686047    .7570803
--------------------------------------------------------------------------------------

. 
. 
. log close
      name:  <unnamed>
       log:  C:\Users\favero\Documents\GitHub\covid-underreporting\data\..\logs\cleandata.txt
  log type:  text
 closed on:  26 May 2020, 22:59:51
-----------------------------------------------------------------------------------------------------
