-----------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\favero\Documents\GitHub\covid-underreporting\code\..\logs\cleandata.txt
  log type:  text
 opened on:  12 Jun 2020, 13:59:53

. 
. use "..\data\population.dta" // start from this file because it has both fips codes and state names

. 
. merge 1:m fips using "..\data\covidtracking.dta", keep(2 3)

    Result                           # of obs.
    -----------------------------------------
    not matched                           440
        from master                         0  (_merge==1)
        from using                        440  (_merge==2)

    matched                             5,065  (_merge==3)
    -----------------------------------------

. drop _merge population risk_standardized_population // merge population back in later because want 
> it merged to all observations, even those missing from the current dataset

. 
. merge 1:1 state date using "..\data\past_reports\12 Jun 2020 cdc_deaths.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                         5,076
        from master                     4,787  (_merge==1)
        from using                        289  (_merge==2)

    matched                               718  (_merge==3)
    -----------------------------------------

. drop _merge

. 
. merge 1:1 state date using "..\data\cdc_historical_deaths.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                        23,693
        from master                     4,875  (_merge==1)
        from using                     18,818  (_merge==2)

    matched                               919  (_merge==3)
    -----------------------------------------

. drop _merge

. 
. drop fips

. merge m:1 state using "..\data\population.dta", keep(1 3)

    Result                           # of obs.
    -----------------------------------------
    not matched                           478
        from master                       478  (_merge==1)
        from using                          0  (_merge==2)

    matched                            24,134  (_merge==3)
    -----------------------------------------

. drop _merge

. order date fips

. sort fips state date

. 
. // bring in delay multipliers, which adjust expected deaths for reporting lag: https://www.cdc.gov/
> nchs/data/vsrr/report001.pdf
. // note: excess deaths do not adjust for how the individual state was doing relative to expectation
> s pre-covid this year
. gen end_week = date + mod(6 - dow(date), 7)

. format end_week %tdCCYYNNDD

. order end_week, after(date)

. gen days_to_report = report_date - end_week
(23,605 missing values generated)

. merge m:1 state days_to_report using "..\data\delay_multipliers.dta", keep(1 3)

    Result                           # of obs.
    -----------------------------------------
    not matched                        23,862
        from master                    23,862  (_merge==1)
        from using                          0  (_merge==2)

    matched                               750  (_merge==3)
    -----------------------------------------

. drop _merge

. replace delay_multiplier = 1 if days_to_report >= 118 & delay_multiplier == . & days_to_report != .
(159 real changes made)

. 
. drop if fips > 56
(478 observations deleted)

. 
. //drop if fips == 9 | fips == 37 // Connecticut and North Carolina's provisional death data look hi
> ghly problematic, so they are not included in analyses using death counts; however, they are kept i
> n the dataset for analysis of hospitalizations
. 
. encode dataqualitygrade, gen(datagrade)

. order datagrade, after(dataqualitygrade)

. drop dataqualitygrade

. 
. drop hash datechecked // new variables added to more recent versions of covidtracking's data that i
> nterfere with following code:

. foreach var of varlist positive-datagrade death-pneumon_influ_or_covid numinfluenzadeaths-percentco
> mplete {
  2.         gen `var'_mis = (`var'==.)
  3. }

. gen dayscollapsed = 1

. sort fips state date

. collapse (firstnm) state report_date epi_week (lastnm) positive-datagrade population risk_standardi
> zed_population delay_multiplier days_to_report death-posneg (sum) deathincrease-pneumon_influ_or_co
> vid numinfluenzadeaths-percentcomplete *_mis dayscollapsed, by(end_week fips)

. foreach var of varlist positive-datagrade {
  2.         replace `var' = . if `var'_mis > 0
  3. }
(0 real changes made)
(16 real changes made, 16 to missing)
(53 real changes made, 53 to missing)
(54 real changes made, 54 to missing)
(51 real changes made, 51 to missing)
(35 real changes made, 35 to missing)
(18 real changes made, 18 to missing)
(30 real changes made, 30 to missing)
(12 real changes made, 12 to missing)
(46 real changes made, 46 to missing)
(51 real changes made, 51 to missing)

. foreach var of varlist death-pneumon_influ_or_covid numinfluenzadeaths-percentcomplete {
  2.         replace `var' = . if `var'_mis == dayscollapsed
  3. }
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(19,069 real changes made, 19,069 to missing)
(19,069 real changes made, 19,069 to missing)
(19,069 real changes made, 19,069 to missing)
(19,069 real changes made, 19,069 to missing)
(19,069 real changes made, 19,069 to missing)
(19,069 real changes made, 19,069 to missing)
(19,069 real changes made, 19,069 to missing)
(19,839 real changes made, 19,839 to missing)
(18,870 real changes made, 18,870 to missing)
(18,870 real changes made, 18,870 to missing)
(18,870 real changes made, 18,870 to missing)
(18,870 real changes made, 18,870 to missing)
(18,870 real changes made, 18,870 to missing)
(18,870 real changes made, 18,870 to missing)
(18,870 real changes made, 18,870 to missing)
(102 real changes made, 102 to missing)
(102 real changes made, 102 to missing)
(102 real changes made, 102 to missing)
(102 real changes made, 102 to missing)

. drop *_mis

. 
. xtset fips end_week, delta(7)
       panel variable:  fips (strongly balanced)
        time variable:  end_week, 20130105 to 20200613
                delta:  7 days

. 
. gen new_pos = d.positive if d.positive>=0
(19,123 missing values generated)

. gen new_neg = d.negative if d.negative>=0
(19,166 missing values generated)

. gen p_pos = new_pos/(new_pos+new_neg)*100
(19,168 missing values generated)

. order new_pos-p_pos, after(negative)

. 
. // dropping CDC expected death data because it appears to have errors
. drop expected_deaths

. 
. 
. // generate expected influenza/pneumonia deaths based on historical patterns
.         gen pneumon_or_influ_fluview = numinfluenzadeaths + numpneumoniadeaths if end_week < date("
> 20200201","YMD")
(1,020 missing values generated)

.         gen mmwrweek = substr(epi_week,-2,2)
(102 missing values generated)

.         gen year = year(end_week)

.         destring mmwrweek, replace
mmwrweek: all characters numeric; replaced as byte
(102 missing values generated)

.         replace mmwrweek = l.mmwrweek + 1 if mmwrweek == . & year == 2020
(102 real changes made)

.         
.         // use 2017-2019 data to calculate for each state the weekly average number of all-cause de
> aths and influenza/pneumonia deaths
.         replace pneumon_or_influ_fluview = .  if year == 2020 | year < 2016
(8,160 real changes made, 8,160 to missing)

.         rename totaldeaths allcause_fluview

.         replace allcause_fluview = .  if year == 2020 | year < 2016
(9,078 real changes made, 9,078 to missing)

.         
.         egen expected_influ_pneu_deaths = mean(pneumon_or_influ_fluview), by(state mmwrweek)
(51 missing values generated)

.         egen expected_deaths = mean(allcause_fluview), by(state mmwrweek)
(51 missing values generated)

.         
.         // Not currently using this method: most year-to-year variation in influenza severity seems
>  to be from weeks 50 to 8; thus, create a sin spike for this period with a year-varying coefficient
.         /*
>         gen flu_year = year + 1 if mmwrweek >= 40
>         gen mmwrweek2 = mmwrweek - 39 if mmwrweek >= 40
>         replace mmwrweek2 = l.mmwrweek2 + 1 if mmwrweek < 40
>         replace mmwrweek2 = mmwrweek + 13 if mmwrweek2 == .
>         gen fluseason = 0 if mmwrweek != .
>         replace fluseason = 1 if (mmwrweek >= 50 | mmwrweek <= 8) & mmwrweek != .
>         gen fluseason_sin_time = sin(fluseason*_pi*(mmwrweek2-10)/12)
>         
>         gen pneumon_or_influ_fluview_pc = pneumon_or_influ_fluview * 100000 / population if end_wee
> k < date("20200201","YMD")
>         gen allcause_fluview_pc = totaldeaths * 100000 / population if end_week < date("20200201","
> YMD")
> 
>         reg pneumon_or_influ_fluview_pc i.fips i.flu_year i.mmwrweek i.flu_year#c.fluseason_sin_tim
> e [aweight=population]
>         predict expected_influ_pneu_deaths_pc
>         gen expected_influ_pneu_deaths = expected_influ_pneu_deaths_pc * population / 100000
>         
>         reg allcause_fluview_pc i.fips i.flu_year i.mmwrweek i.flu_year#c.fluseason_sin_time [aweig
> ht=population]
>         predict expected_allcause_deaths_pc
>         gen expected_allcause_deaths = expected_allcause_deaths_pc * population / 100000
>         */
. 
. gen adj_expected_influ_pneu_deaths = expected_influ_pneu_deaths / delay_multiplier
(18,951 missing values generated)

. order adj_expected_influ_pneu_deaths, after(expected_influ_pneu_deaths)

. gen adj_expected_deaths = expected_deaths / delay_multiplier
(18,951 missing values generated)

. order adj_expected_deaths, after(expected_deaths)

. 
. replace covid_deaths = 5 if covid_deaths == . & total_deaths != . //rough imputation for where data
>  is supressed for 1-9 deaths
(0 real changes made)

. 
. 
. gen cumulative_covid_death = covid_deaths
(18,870 missing values generated)

. replace cumulative_covid_death = cumulative_covid_death + l.cumulative_covid_death if l.cumulative_
> covid_death != .
(589 real changes made)

. 
. 
. gen adj_covid_deaths = covid_deaths * delay_multiplier
(18,951 missing values generated)

. gen adj_cumulative_covid_death = adj_covid_deaths
(18,951 missing values generated)

. replace adj_cumulative_covid_death = adj_cumulative_covid_death + l.adj_cumulative_covid_death if l
> .adj_cumulative_covid_death != .
(512 real changes made)

. 
. gen adj_total_deaths = total_deaths * delay_multiplier
(18,951 missing values generated)

. gen adj_pneumon_influ_or_covid = pneumon_influ_or_covid * delay_multiplier
(18,951 missing values generated)

. 
. 
. gen covid_deaths_pc = covid_deaths*100000/risk_standardized_population
(18,870 missing values generated)

. gen excess_deaths_pc = (total_deaths-adj_expected_deaths)*100000/population
(18,951 missing values generated)

. gen excess_respir_deaths_pc = (pneumon_influ_or_covid-adj_expected_influ_pneu_deaths)*100000/risk_s
> tandardized_population
(18,951 missing values generated)

. gen adj_covid_deaths_pc = adj_covid_deaths*100000/risk_standardized_population
(18,951 missing values generated)

. gen adj_excess_deaths_pc = (adj_total_deaths-expected_deaths)*100000/population
(18,951 missing values generated)

. gen adj_excess_respir_deaths_pc = (adj_pneumon_influ_or_covid-expected_influ_pneu_deaths)*100000/ri
> sk_standardized_population
(18,951 missing values generated)

. gen new_pos_pc = new_pos*100000/population
(19,123 missing values generated)

. gen new_neg_pc = new_neg*100000/population
(19,166 missing values generated)

. gen new_tests_pc = new_pos_pc + new_neg_pc
(19,168 missing values generated)

. gen deathincrease_pc = deathincrease*100000/risk_standardized_population
(19,069 missing values generated)

. 
. /*
> gen log_covid_death = log(covid_deaths)
>         //replace log_covid_death = 2 if covid_deaths==0
> gen log_allcause = log(total_deaths)
> gen log_expected = log(adj_expected_deaths)
> gen excess_deaths = log_allcause-log_expected
> */
. 
. save "..\data\weeklydata.dta", replace
file ..\data\weeklydata.dta saved

. 
. 
. reg excess_deaths_pc covid_deaths_pc [aweight=population] if days_to_report > 14, cluster(fips) noc
> ons
(sum of wgt is 5,366,458,388)

Linear regression                               Number of obs     =        839
                                                F(1, 50)          =    5396.24
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9399
                                                Root MSE          =      1.565

                                     (Std. Err. adjusted for 51 clusters in fips)
---------------------------------------------------------------------------------
                |               Robust
excess_deaths~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
covid_deaths_pc |   1.434679   .0195303    73.46   0.000     1.395451    1.473907
---------------------------------------------------------------------------------

. margins, dydx(covid_deaths_pc)

Average marginal effects                        Number of obs     =        839
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : covid_deaths_pc

---------------------------------------------------------------------------------
                |            Delta-method
                |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
covid_deaths_pc |   1.434679   .0195303    73.46   0.000     1.395451    1.473907
---------------------------------------------------------------------------------

. 
. twoway (scatter excess_deaths_pc covid_deaths_pc if days_to_report > 14, mcolor(%30) yline(0)) (fun
> ction y=x, range(0 40))

. 
. reg excess_deaths_pc covid_deaths_pc [aweight=population] if days_to_report > 14, cluster(fips)
(sum of wgt is 5,366,458,388)

Linear regression                               Number of obs     =        839
                                                F(1, 50)          =    2316.92
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9312
                                                Root MSE          =       1.51

                                     (Std. Err. adjusted for 51 clusters in fips)
---------------------------------------------------------------------------------
                |               Robust
excess_deaths~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
covid_deaths_pc |   1.394488   .0289707    48.13   0.000     1.336298    1.452677
          _cons |   .4490359   .1781205     2.52   0.015     .0912703    .8068015
---------------------------------------------------------------------------------

. reg excess_deaths_pc c.covid_deaths_pc c.p_pos [aweight=population] if days_to_report > 14, cluster
> (fips)
(sum of wgt is 3,167,340,793)

Linear regression                               Number of obs     =        503
                                                F(2, 48)          =    1229.47
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9578
                                                Root MSE          =     1.4012

                                     (Std. Err. adjusted for 49 clusters in fips)
---------------------------------------------------------------------------------
                |               Robust
excess_deaths~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
covid_deaths_pc |   1.371559   .0276768    49.56   0.000     1.315911    1.427207
          p_pos |  -.0008638   .0120025    -0.07   0.943    -.0249964    .0232689
          _cons |   .7313159   .2023103     3.61   0.001     .3245438    1.138088
---------------------------------------------------------------------------------

. reg excess_deaths_pc c.covid_deaths_pc##c.p_pos [aweight=population] if days_to_report > 14, cluste
> r(fips)
(sum of wgt is 3,167,340,793)

Linear regression                               Number of obs     =        503
                                                F(3, 48)          =     985.15
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9638
                                                Root MSE          =        1.3

                                               (Std. Err. adjusted for 49 clusters in fips)
-------------------------------------------------------------------------------------------
                          |               Robust
         excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------------+----------------------------------------------------------------
          covid_deaths_pc |   1.084709   .0854234    12.70   0.000     .9129542    1.256465
                    p_pos |  -.0155223   .0079377    -1.96   0.056    -.0314821    .0004375
                          |
c.covid_deaths_pc#c.p_pos |   .0079224   .0026644     2.97   0.005     .0025653    .0132795
                          |
                    _cons |   1.211519   .1781377     6.80   0.000     .8533495    1.569689
-------------------------------------------------------------------------------------------

. 
. // Note: deathincrease_pc is not age-standardized but adj_covid_deaths_pc is
. reg deathincrease_pc adj_covid_deaths_pc [aweight=population] if days_to_report > 7, cluster(fips)
(sum of wgt is 4,102,520,743)

Linear regression                               Number of obs     =        641
                                                F(1, 48)          =     431.89
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9366
                                                Root MSE          =     .97652

                                         (Std. Err. adjusted for 49 clusters in fips)
-------------------------------------------------------------------------------------
                    |               Robust
   deathincrease_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
adj_covid_deaths_pc |   .8066392   .0388142    20.78   0.000      .728598    .8846804
              _cons |   .2385326   .0607866     3.92   0.000     .1163131    .3607522
-------------------------------------------------------------------------------------

. reg deathincrease_pc adj_covid_deaths_pc l.adj_covid_deaths_pc [aweight=population] if days_to_repo
> rt > 7, cluster(fips)
(sum of wgt is 4,094,985,152)

Linear regression                               Number of obs     =        640
                                                F(2, 48)          =     583.16
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9541
                                                Root MSE          =      .8318

                                         (Std. Err. adjusted for 49 clusters in fips)
-------------------------------------------------------------------------------------
                    |               Robust
   deathincrease_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
adj_covid_deaths_pc |
                --. |   .5736745   .0770555     7.44   0.000      .418744     .728605
                L1. |   .2563598   .1132442     2.26   0.028     .0286672    .4840524
                    |
              _cons |   .2152657    .050491     4.26   0.000     .1137468    .3167846
-------------------------------------------------------------------------------------

. reg deathincrease_pc c.adj_covid_deaths_pc##c.p_pos [aweight=population] if days_to_report > 7, clu
> ster(fips)
(sum of wgt is 3,469,330,012)

Linear regression                               Number of obs     =        550
                                                F(3, 48)          =     153.82
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9518
                                                Root MSE          =     .89954

                                                   (Std. Err. adjusted for 49 clusters in fips)
-----------------------------------------------------------------------------------------------
                              |               Robust
             deathincrease_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
          adj_covid_deaths_pc |   1.074892   .0604052    17.79   0.000     .9534395    1.196345
                        p_pos |   .0006886   .0029877     0.23   0.819    -.0053186    .0066957
                              |
c.adj_covid_deaths_pc#c.p_pos |  -.0073621   .0007849    -9.38   0.000    -.0089402    -.005784
                              |
                        _cons |  -.0327616   .0634024    -0.52   0.608    -.1602407    .0947174
-----------------------------------------------------------------------------------------------

. 
. 
. reg excess_respir_deaths_pc covid_deaths_pc [aweight=population] if days_to_report > 14, cluster(fi
> ps)
(sum of wgt is 5,366,458,388)

Linear regression                               Number of obs     =        839
                                                F(1, 50)          =   85999.53
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9957
                                                Root MSE          =     .27486

                                     (Std. Err. adjusted for 51 clusters in fips)
---------------------------------------------------------------------------------
                |               Robust
excess_respir~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
covid_deaths_pc |   1.050622   .0035826   293.26   0.000     1.043427    1.057818
          _cons |  -.0436998   .0241913    -1.81   0.077    -.0922895    .0048898
---------------------------------------------------------------------------------

. 
. reg excess_deaths_pc c.covid_deaths_pc##c.p_pos [aweight=population] if days_to_report > 14, cluste
> r(fips)
(sum of wgt is 3,167,340,793)

Linear regression                               Number of obs     =        503
                                                F(3, 48)          =     985.15
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9638
                                                Root MSE          =        1.3

                                               (Std. Err. adjusted for 49 clusters in fips)
-------------------------------------------------------------------------------------------
                          |               Robust
         excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------------+----------------------------------------------------------------
          covid_deaths_pc |   1.084709   .0854234    12.70   0.000     .9129542    1.256465
                    p_pos |  -.0155223   .0079377    -1.96   0.056    -.0314821    .0004375
                          |
c.covid_deaths_pc#c.p_pos |   .0079224   .0026644     2.97   0.005     .0025653    .0132795
                          |
                    _cons |   1.211519   .1781377     6.80   0.000     .8533495    1.569689
-------------------------------------------------------------------------------------------

. reg excess_deaths_pc c.covid_deaths_pc##c.p_pos c.covid_deaths_pc##c.end_week [aweight=population] 
> if days_to_report > 14, cluster(fips)
(sum of wgt is 3,167,340,793)
note: covid_deaths_pc omitted because of collinearity

Linear regression                               Number of obs     =        503
                                                F(5, 48)          =    3132.52
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9706
                                                Root MSE          =     1.1739

                                                  (Std. Err. adjusted for 49 clusters in fips)
----------------------------------------------------------------------------------------------
                             |               Robust
            excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
             covid_deaths_pc |   271.3112   45.62366     5.95   0.000     179.5787    363.0437
                       p_pos |  -.0012089   .0073405    -0.16   0.870     -.015968    .0135503
                             |
   c.covid_deaths_pc#c.p_pos |   .0021385   .0014539     1.47   0.148    -.0007848    .0050617
                             |
             covid_deaths_pc |          0  (omitted)
                    end_week |   .0275658   .0054774     5.03   0.000     .0165528    .0385788
                             |
c.covid_deaths_pc#c.end_week |  -.0122616   .0020703    -5.92   0.000    -.0164242   -.0080989
                             |
                       _cons |  -606.0759   120.5954    -5.03   0.000    -848.5493   -363.6026
----------------------------------------------------------------------------------------------

. reg excess_respir_deaths_pc c.covid_deaths_pc##c.p_pos [aweight=population] if days_to_report > 14,
>  cluster(fips)
(sum of wgt is 3,167,340,793)

Linear regression                               Number of obs     =        503
                                                F(3, 48)          =   53305.51
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9975
                                                Root MSE          =     .25666

                                               (Std. Err. adjusted for 49 clusters in fips)
-------------------------------------------------------------------------------------------
                          |               Robust
  excess_respir_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------------+----------------------------------------------------------------
          covid_deaths_pc |   .9778653   .0134085    72.93   0.000     .9509058    1.004825
                    p_pos |   .0037741   .0017435     2.16   0.035     .0002685    .0072796
                          |
c.covid_deaths_pc#c.p_pos |   .0016579   .0003767     4.40   0.000     .0009005    .0024152
                          |
                    _cons |   .0377491   .0328707     1.15   0.256    -.0283418      .10384
-------------------------------------------------------------------------------------------

. reg excess_respir_deaths_pc c.covid_deaths_pc##c.p_pos c.covid_deaths_pc##c.end_week [aweight=popul
> ation] if days_to_report > 14, cluster(fips)
(sum of wgt is 3,167,340,793)
note: covid_deaths_pc omitted because of collinearity

Linear regression                               Number of obs     =        503
                                                F(5, 48)          =   84957.90
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9978
                                                Root MSE          =     .23891

                                                  (Std. Err. adjusted for 49 clusters in fips)
----------------------------------------------------------------------------------------------
                             |               Robust
     excess_respir_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
             covid_deaths_pc |   45.63178   9.684812     4.71   0.000     26.15917     65.1044
                       p_pos |   .0026856   .0019358     1.39   0.172    -.0012067    .0065779
                             |
   c.covid_deaths_pc#c.p_pos |   .0003158   .0002085     1.51   0.136    -.0001033    .0007349
                             |
             covid_deaths_pc |          0  (omitted)
                    end_week |  -.0005729   .0009559    -0.60   0.552    -.0024948     .001349
                             |
c.covid_deaths_pc#c.end_week |  -.0020252   .0004397    -4.61   0.000    -.0029093   -.0011412
                             |
                       _cons |    12.6491   21.05524     0.60   0.551    -29.68529    54.98349
----------------------------------------------------------------------------------------------

. reg excess_deaths_pc c.excess_respir_deaths_pc##c.p_pos [aweight=population] if days_to_report > 14
> , cluster(fips)
(sum of wgt is 3,167,340,793)

Linear regression                               Number of obs     =        503
                                                F(3, 48)          =    1066.19
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9708
                                                Root MSE          =      1.168

                                                       (Std. Err. adjusted for 49 clusters in fips)
---------------------------------------------------------------------------------------------------
                                  |               Robust
                 excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------------------+----------------------------------------------------------------
          excess_respir_deaths_pc |   1.127825   .0738935    15.26   0.000     .9792518    1.276397
                            p_pos |  -.0209232   .0069451    -3.01   0.004    -.0348872   -.0069593
                                  |
c.excess_respir_deaths_pc#c.p_pos |    .005418   .0022195     2.44   0.018     .0009554    .0098807
                                  |
                            _cons |   1.153684   .1636469     7.05   0.000     .8246495    1.482718
---------------------------------------------------------------------------------------------------

. reg excess_deaths_pc c.excess_respir_deaths_pc##c.p_pos c.covid_deaths_pc##c.end_week [aweight=popu
> lation] if days_to_report > 14, cluster(fips)
(sum of wgt is 3,167,340,793)

Linear regression                               Number of obs     =        503
                                                F(6, 48)          =    1268.54
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9781
                                                Root MSE          =     1.0151

                                                       (Std. Err. adjusted for 49 clusters in fips)
---------------------------------------------------------------------------------------------------
                                  |               Robust
                 excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------------------+----------------------------------------------------------------
          excess_respir_deaths_pc |   2.442217   .2794875     8.74   0.000      1.88027    3.004165
                            p_pos |  -.0080443   .0056174    -1.43   0.159    -.0193388    .0032503
                                  |
c.excess_respir_deaths_pc#c.p_pos |   .0013954   .0015186     0.92   0.363     -.001658    .0044488
                                  |
                  covid_deaths_pc |   155.8569   37.64443     4.14   0.000     80.16774    231.5461
                         end_week |   .0288581   .0044461     6.49   0.000     .0199186    .0377976
                                  |
     c.covid_deaths_pc#c.end_week |  -.0071335   .0017061    -4.18   0.000    -.0105639   -.0037031
                                  |
                            _cons |  -634.6107   97.88637    -6.48   0.000    -831.4245    -437.797
---------------------------------------------------------------------------------------------------

. 
. reg f.adj_excess_deaths_pc c.new_pos_pc##c.p_pos [aweight=population] if days_to_report > 14, clust
> er(fips)
(sum of wgt is 3,167,340,793)

Linear regression                               Number of obs     =        503
                                                F(3, 48)          =     144.09
                                                Prob > F          =     0.0000
                                                R-squared         =     0.8011
                                                Root MSE          =      3.254

                                          (Std. Err. adjusted for 49 clusters in fips)
--------------------------------------------------------------------------------------
F.                   |               Robust
adj_excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
          new_pos_pc |   .0487835    .014052     3.47   0.001     .0205301    .0770369
               p_pos |  -.0271884   .0215433    -1.26   0.213    -.0705042    .0161274
                     |
c.new_pos_pc#c.p_pos |   .0015589   .0005199     3.00   0.004     .0005135    .0026042
                     |
               _cons |   1.866977   .5065188     3.69   0.001     .8485531    2.885402
--------------------------------------------------------------------------------------

. reg f.adj_excess_respir_deaths_pc c.new_pos_pc##c.p_pos [aweight=population] if days_to_report > 14
> , cluster(fips)
(sum of wgt is 3,167,340,793)

Linear regression                               Number of obs     =        503
                                                F(3, 48)          =     181.29
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9123
                                                Root MSE          =     1.5812

                                          (Std. Err. adjusted for 49 clusters in fips)
--------------------------------------------------------------------------------------
F.                   |               Robust
adj_excess_respir_~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
          new_pos_pc |   .0363943   .0081718     4.45   0.000     .0199638    .0528249
               p_pos |   .0016167    .011128     0.15   0.885    -.0207577    .0239911
                     |
c.new_pos_pc#c.p_pos |   .0011943   .0003025     3.95   0.000     .0005862    .0018024
                     |
               _cons |   .2536936   .2374816     1.07   0.291     -.223795    .7311823
--------------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  C:\Users\favero\Documents\GitHub\covid-underreporting\code\..\logs\cleandata.txt
  log type:  text
 closed on:  12 Jun 2020, 14:00:08
-----------------------------------------------------------------------------------------------------
