-----------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\favero\Documents\GitHub\covid-underreporting\code\..\logs\cleandata.txt
  log type:  text
 opened on:  21 May 2020, 14:16:52

. 
. use "..\data\population.dta" // start from this file because it has both fips codes and state names

. 
. merge 1:m fips using "..\data\covidtracking.dta", keep(2 3)

    Result                           # of obs.
    -----------------------------------------
    not matched                           330
        from master                         0  (_merge==1)
        from using                        330  (_merge==2)

    matched                             3,943  (_merge==3)
    -----------------------------------------

. drop _merge population // merge population back in later because want it merged to all observations
> , even those missing from the current dataset

. 
. merge 1:1 state date using "..\data\cdc_deaths.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                         3,991
        from master                     3,708  (_merge==1)
        from using                        283  (_merge==2)

    matched                               565  (_merge==3)
    -----------------------------------------

. drop _merge

. 
. merge 1:1 state date using "..\data\cdc_historical_deaths.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                        22,608
        from master                     3,790  (_merge==1)
        from using                     18,818  (_merge==2)

    matched                               766  (_merge==3)
    -----------------------------------------

. drop _merge

. 
. drop fips

. merge m:1 state using "..\data\population.dta", keep(1 3)

    Result                           # of obs.
    -----------------------------------------
    not matched                           362
        from master                       362  (_merge==1)
        from using                          0  (_merge==2)

    matched                            23,012  (_merge==3)
    -----------------------------------------

. drop _merge

. order date fips

. sort fips state date

. 
. drop if fips > 56
(362 observations deleted)

. 
. encode dataqualitygrade, gen(datagrade)

. order datagrade, after(dataqualitygrade)

. drop dataqualitygrade

. 
. gen end_week = date + mod(6 - dow(date), 7)

. format end_week %tdCCYYNNDD

. order end_week, after(date)

. 
. foreach var of varlist positive-datagrade death-pneumon_influ_or_covid numinfluenzadeaths-percentco
> mplete {
  2.         gen `var'_mis = (`var'==.)
  3. }

. gen dayscollapsed = 1

. collapse (firstnm) state report_date epi_week (lastnm) positive-datagrade population death-posneg (
> sum) deathincrease-pneumon_influ_or_covid numinfluenzadeaths-percentcomplete *_mis dayscollapsed, b
> y(end_week fips)

. foreach var of varlist positive-datagrade {
  2.         replace `var' = . if `var'_mis > 0
  3. }
(0 real changes made)
(16 real changes made, 16 to missing)
(51 real changes made, 51 to missing)
(49 real changes made, 49 to missing)
(47 real changes made, 47 to missing)
(32 real changes made, 32 to missing)
(18 real changes made, 18 to missing)
(27 real changes made, 27 to missing)
(12 real changes made, 12 to missing)
(43 real changes made, 43 to missing)
(52 real changes made, 52 to missing)

. foreach var of varlist death-pneumon_influ_or_covid numinfluenzadeaths-percentcomplete {
  2.         replace `var' = . if `var'_mis == dayscollapsed
  3. }
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(19,083 real changes made, 19,083 to missing)
(19,083 real changes made, 19,083 to missing)
(19,083 real changes made, 19,083 to missing)
(19,083 real changes made, 19,083 to missing)
(19,083 real changes made, 19,083 to missing)
(18,870 real changes made, 18,870 to missing)
(18,870 real changes made, 18,870 to missing)
(18,870 real changes made, 18,870 to missing)
(18,870 real changes made, 18,870 to missing)
(18,870 real changes made, 18,870 to missing)
(18,870 real changes made, 18,870 to missing)
(18,870 real changes made, 18,870 to missing)
(102 real changes made, 102 to missing)
(102 real changes made, 102 to missing)
(102 real changes made, 102 to missing)
(102 real changes made, 102 to missing)

. drop *_mis

. 
. xtset fips end_week, delta(7)
       panel variable:  fips (strongly balanced)
        time variable:  end_week, 20130105 to 20200523
                delta:  7 days

. 
. gen new_pos = d.positive if d.positive>=0
(19,120 missing values generated)

. gen new_neg = d.negative if d.negative>=0
(19,162 missing values generated)

. gen p_pos = new_pos/(new_pos+new_neg)*100
(19,162 missing values generated)

. order new_pos-p_pos, after(negative)

. 
. // adjust expected deaths for reporting lag: https://www.cdc.gov/nchs/data/vsrr/report001.pdf
. // maybe also somehow adjust for how the individual state was doing relative to expectations pre-co
> vid
. gen days_to_report = report_date - end_week
(18,870 missing values generated)

. 
. drop if fips == 9 | fips == 37 // Connecticut and North Carolina's data look highly problematic, so
>  dropping them
(772 observations deleted)

. 
. /*
> gen allcause_minus_posscovid = total_deaths - pneumon_influ_or_covid
> gen allcause_minus_posscovid_pc  = allcause_minus_posscovid*1000000/population
> bys days_to_report: sum allcause_minus_posscovid_pc
> gen adj_allcause_minus_posscovid_pc = allcause_minus_posscovid_pc
> replace adj_allcause_minus_posscovid_pc = allcause_minus_posscovid_pc * 212 / 93 if days_to_report 
> <= 7 & days_to_report != .
> replace adj_allcause_minus_posscovid_pc = allcause_minus_posscovid_pc * 212 / 159 if days_to_report
>  > 7 & days_to_report <= 14
> replace adj_allcause_minus_posscovid_pc = allcause_minus_posscovid_pc * 212 / 192 if days_to_report
>  > 14 & days_to_report <= 21
> */
. 
. gen adj_expected_deaths = expected_deaths
(18,130 missing values generated)

. replace adj_expected_deaths = expected_deaths * 93 / 212 if days_to_report <= 7 & days_to_report !=
>  .
(49 real changes made)

. replace adj_expected_deaths = expected_deaths * 159 / 212 if days_to_report > 7 & days_to_report <=
>  14
(49 real changes made)

. replace adj_expected_deaths = expected_deaths * 192 / 212 if days_to_report > 14 & days_to_report <
> = 21
(49 real changes made)

. 
. gen pneumon_or_influ_fluview = numinfluenzadeaths + numpneumoniadeaths if end_week < date("20200201
> ","YMD")
(833 missing values generated)

. gen mmwrweek = substr(epi_week,-2,2)
(98 missing values generated)

. 
. egen expected_influ_pneu_deaths = mean(pneumon_or_influ_fluview), by(fips mmwrweek)
(98 missing values generated)

. gen adj_expected_influ_pneu_deaths = expected_influ_pneu_deaths
(98 missing values generated)

. replace adj_expected_influ_pneu_deaths = expected_influ_pneu_deaths * 93 / 212 if days_to_report <=
>  7 & days_to_report != .
(0 real changes made)

. replace adj_expected_influ_pneu_deaths = expected_influ_pneu_deaths * 159 / 212 if days_to_report >
>  7 & days_to_report <= 14
(49 real changes made)

. replace adj_expected_influ_pneu_deaths = expected_influ_pneu_deaths * 192 / 212 if days_to_report >
>  14 & days_to_report <= 21
(49 real changes made)

. 
. 
. replace covid_deaths = 5 if covid_deaths == . & total_deaths != . //rough imputation for where data
>  is supressed for 1-9 deaths
(0 real changes made)

. 
. 
. gen cumulative_covdeath = covid_deaths
(18,130 missing values generated)

. replace cumulative_covdeath = cumulative_covdeath + l.cumulative_covdeath if l.cumulative_covdeath 
> != .
(408 real changes made)

. 
. gen adj_covid_deaths = covid_deaths
(18,130 missing values generated)

. replace adj_covid_deaths = covid_deaths * 212 / 93 if days_to_report <= 7 & days_to_report != .
(39 real changes made)

. replace adj_covid_deaths = covid_deaths * 212 / 159 if days_to_report > 7 & days_to_report <= 14
(46 real changes made)

. replace adj_covid_deaths = covid_deaths * 212 / 192 if days_to_report > 14 & days_to_report <= 21
(47 real changes made)

. 
. gen adj_cumulative_covdeath = adj_covid_deaths
(18,130 missing values generated)

. replace adj_cumulative_covdeath = adj_cumulative_covdeath + l.adj_cumulative_covdeath if l.adj_cumu
> lative_covdeath != .
(408 real changes made)

. 
. gen covdeath_pc = covid_deaths*1000000/population
(18,130 missing values generated)

. gen excess_deaths_pc = (total_deaths-adj_expected_deaths)*1000000/population
(18,130 missing values generated)

. gen excess_respir_deaths_pc = (pneumon_influ_or_covid-adj_expected_influ_pneu_deaths)*1000000/popul
> ation
(18,179 missing values generated)

. gen new_pos_pc = new_pos*1000000/population
(18,370 missing values generated)

. gen new_neg_pc = new_neg*1000000/population
(18,409 missing values generated)

. gen new_tests_pc = new_pos_pc + new_neg_pc
(18,409 missing values generated)

. gen deathincrease_pc = deathincrease*1000000/population
(18,334 missing values generated)

. gen adj_covid_deaths_pc = adj_covid_deaths*1000000/population
(18,130 missing values generated)

. 
. gen log_covdeath = log(covid_deaths)
(18,483 missing values generated)

.         //replace log_covdeath = 2 if covid_deaths==0
. gen log_allcause = log(total_deaths)
(18,131 missing values generated)

. gen log_expected = log(adj_expected_deaths)
(18,130 missing values generated)

. gen excess_deaths = log_allcause-log_expected
(18,131 missing values generated)

. 
. save "..\data\weeklydata.dta", replace
file ..\data\weeklydata.dta saved

. 
. 
. reg excess_deaths_pc covdeath_pc [aweight=population] if days_to_report > 14, cluster(fips) nocons
(sum of wgt is 4,398,606,128)

Linear regression                               Number of obs     =        686
                                                F(1, 48)          =    2780.90
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9235
                                                Root MSE          =     17.084

                                  (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
excess_dea~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 covdeath_pc |   1.349635   .0255931    52.73   0.000     1.298176    1.401093
------------------------------------------------------------------------------

. margins, dydx(covdeath_pc)

Average marginal effects                        Number of obs     =        686
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : covdeath_pc

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 covdeath_pc |   1.349635   .0255931    52.73   0.000     1.298176    1.401093
------------------------------------------------------------------------------

. 
. twoway (scatter excess_deaths_pc covdeath_pc if days_to_report > 14, mcolor(%30) yline(0)) (functio
> n y=x, range(0 300))

. 
. reg excess_deaths_pc covdeath_pc [aweight=population] if days_to_report > 14, cluster(fips)
(sum of wgt is 4,398,606,128)

Linear regression                               Number of obs     =        686
                                                F(1, 48)          =    3198.30
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9186
                                                Root MSE          =     16.947

                                  (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
excess_dea~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 covdeath_pc |    1.36722   .0241757    56.55   0.000     1.318611    1.415828
       _cons |  -2.382792   2.207638    -1.08   0.286    -6.821547    2.055962
------------------------------------------------------------------------------

. reg excess_deaths_pc c.covdeath_pc c.p_pos [aweight=population] if days_to_report > 14, cluster(fip
> s)
(sum of wgt is 2,254,525,234)

Linear regression                               Number of obs     =        358
                                                F(2, 48)          =    2002.34
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9507
                                                Root MSE          =     17.153

                                  (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
excess_dea~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 covdeath_pc |   1.341508   .0246484    54.43   0.000     1.291949    1.391067
       p_pos |   .2278687   .1528218     1.49   0.142    -.0794001    .5351376
       _cons |  -5.321598   2.492634    -2.13   0.038    -10.33337   -.3098218
------------------------------------------------------------------------------

. reg excess_deaths_pc c.covdeath_pc##c.p_pos [aweight=population] if days_to_report > 14, cluster(fi
> ps)
(sum of wgt is 2,254,525,234)

Linear regression                               Number of obs     =        358
                                                F(3, 48)          =    2847.49
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9602
                                                Root MSE          =     15.444

                                           (Std. Err. adjusted for 49 clusters in fips)
---------------------------------------------------------------------------------------
                      |               Robust
     excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
          covdeath_pc |   .8712449   .0858447    10.15   0.000     .6986425    1.043847
                p_pos |   .0617641   .1063558     0.58   0.564    -.1520786    .2756069
                      |
c.covdeath_pc#c.p_pos |   .0121782   .0024429     4.99   0.000     .0072664      .01709
                      |
                _cons |   .5670926   1.928497     0.29   0.770     -3.31041    4.444596
---------------------------------------------------------------------------------------

. reg excess_deaths_pc c.covdeath_pc c.new_pos_pc c.new_neg_pc [aweight=population] if days_to_report
>  > 14, cluster(fips)
(sum of wgt is 2,254,525,234)

Linear regression                               Number of obs     =        358
                                                F(3, 48)          =    3817.60
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9601
                                                Root MSE          =     15.467

                                  (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
excess_dea~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 covdeath_pc |   1.168068   .0686744    17.01   0.000     1.029989    1.306147
  new_pos_pc |   .0225777   .0077698     2.91   0.006     .0069555       .0382
  new_neg_pc |  -.0046536   .0011857    -3.92   0.000    -.0070375   -.0022696
       _cons |   3.622003    2.27486     1.59   0.118    -.9519098    8.195915
------------------------------------------------------------------------------

. reg excess_deaths_pc c.covdeath_pc##c.new_pos_pc c.covdeath_pc##c.new_neg_pc [aweight=population] i
> f days_to_report > 14, cluster(fips)
(sum of wgt is 2,254,525,234)
note: covdeath_pc omitted because of collinearity

Linear regression                               Number of obs     =        358
                                                F(5, 48)          =    3180.31
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9649
                                                Root MSE          =     14.535

                                                (Std. Err. adjusted for 49 clusters in fips)
--------------------------------------------------------------------------------------------
                           |               Robust
          excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------------+----------------------------------------------------------------
               covdeath_pc |   1.107826   .1470819     7.53   0.000     .8120984    1.403554
                new_pos_pc |   .0208098   .0066377     3.14   0.003     .0074639    .0341558
                           |
c.covdeath_pc#c.new_pos_pc |   .0000968   .0000306     3.16   0.003     .0000353    .0001583
                           |
               covdeath_pc |          0  (omitted)
                new_neg_pc |  -.0025472   .0009806    -2.60   0.012    -.0045189   -.0005755
                           |
c.covdeath_pc#c.new_neg_pc |  -.0000492   9.93e-06    -4.96   0.000    -.0000692   -.0000293
                           |
                     _cons |   1.693892   2.308349     0.73   0.467    -2.947354    6.335139
--------------------------------------------------------------------------------------------

. reg excess_deaths_pc c.covdeath_pc c.new_tests_pc [aweight=population] if days_to_report > 14, clus
> ter(fips)
(sum of wgt is 2,254,525,234)

Linear regression                               Number of obs     =        358
                                                F(2, 48)          =    3354.46
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9547
                                                Root MSE          =     16.459

                                  (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
excess_dea~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 covdeath_pc |   1.444572   .0257468    56.11   0.000     1.392804    1.496339
new_tests_pc |  -.0029655   .0007102    -4.18   0.000    -.0043934   -.0015375
       _cons |   4.090286   2.254677     1.81   0.076    -.4430462    8.623619
------------------------------------------------------------------------------

. reg excess_deaths_pc c.covdeath_pc##c.new_tests_pc [aweight=population] if days_to_report > 14, clu
> ster(fips)
(sum of wgt is 2,254,525,234)

Linear regression                               Number of obs     =        358
                                                F(3, 48)          =    3172.04
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9566
                                                Root MSE          =     16.124

                                                  (Std. Err. adjusted for 49 clusters in fips)
----------------------------------------------------------------------------------------------
                             |               Robust
            excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                 covdeath_pc |   1.673101   .1472909    11.36   0.000     1.376953    1.969249
                new_tests_pc |  -.0024177   .0006606    -3.66   0.001    -.0037458   -.0010895
                             |
c.covdeath_pc#c.new_tests_pc |  -.0000326    .000018    -1.81   0.076    -.0000687    3.55e-06
                             |
                       _cons |     1.3119   2.441518     0.54   0.594    -3.597102    6.220902
----------------------------------------------------------------------------------------------

. reg excess_deaths_pc c.covdeath_pc##c.new_tests_pc c.covdeath_pc##c.p_pos [aweight=population] if d
> ays_to_report > 14, cluster(fips)
(sum of wgt is 2,254,525,234)
note: covdeath_pc omitted because of collinearity

Linear regression                               Number of obs     =        358
                                                F(5, 48)          =    3241.83
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9610
                                                Root MSE          =     15.335

                                                  (Std. Err. adjusted for 49 clusters in fips)
----------------------------------------------------------------------------------------------
                             |               Robust
            excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                 covdeath_pc |   1.093754   .2013642     5.43   0.000     .6888844    1.498624
                new_tests_pc |  -.0011166   .0011644    -0.96   0.342    -.0034577    .0012245
                             |
c.covdeath_pc#c.new_tests_pc |  -.0000127   .0000128    -0.99   0.327    -.0000385    .0000131
                             |
                 covdeath_pc |          0  (omitted)
                       p_pos |  -.0022922   .1252277    -0.02   0.985    -.2540793    .2494949
                             |
       c.covdeath_pc#c.p_pos |   .0098991   .0034392     2.88   0.006     .0029841    .0168141
                             |
                       _cons |   2.511905   2.962779     0.85   0.401    -3.445162    8.468973
----------------------------------------------------------------------------------------------

. reg excess_deaths_pc c.covdeath_pc##c.new_tests_pc##c.p_pos [aweight=population] if days_to_report 
> > 14, cluster(fips)
(sum of wgt is 2,254,525,234)

Linear regression                               Number of obs     =        358
                                                F(7, 48)          =    7175.36
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9653
                                                Root MSE          =     14.492

                                                   (Std. Err. adjusted for 49 clusters in fips)
-----------------------------------------------------------------------------------------------
                              |               Robust
             excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                  covdeath_pc |   1.099362   .2569318     4.28   0.000     .5827661    1.615958
                 new_tests_pc |  -.0031893   .0010577    -3.02   0.004     -.005316   -.0010626
                              |
 c.covdeath_pc#c.new_tests_pc |  -.0000467   .0000242    -1.93   0.060    -.0000954    1.99e-06
                              |
                        p_pos |  -.1594146   .0991408    -1.61   0.114    -.3587504    .0399212
                              |
        c.covdeath_pc#c.p_pos |   .0005983   .0046083     0.13   0.897    -.0086673    .0098638
                              |
       c.new_tests_pc#c.p_pos |   .0002688   .0000717     3.75   0.000     .0001247    .0004129
                              |
 c.covdeath_pc#c.new_tests_pc#|
                      c.p_pos |   1.32e-06   5.47e-07     2.41   0.020     2.20e-07    2.42e-06
                              |
                        _cons |   4.497864   2.245972     2.00   0.051    -.0179659    9.013693
-----------------------------------------------------------------------------------------------

. 
. reghv excess_deaths_pc covdeath_pc if days_to_report > 14, var( p_pos population) twostage cluster(
> fips)

Multiplicative heteroscedastic regression             Number of obs  =     358
Estimator: 2sls                                       Model chi2(3)  = 595.919
                                                      Prob > chi2    =   0.000
Log Likelihood              = -1663.652               Pseudo R2      =  0.1519
                                                      VWLS R2        =  0.8038
                                  (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
excess_dea~c |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
lp_mean      |
 covdeath_pc |   1.352072    .043206    31.29   0.000      1.26739    1.436754
       _cons |  -6.894174   2.349127    -2.93   0.003    -11.49838   -2.289969
-------------+----------------------------------------------------------------
lp_lnvar     |
       p_pos |   .0185794   .0584591     0.32   0.751    -.0959984    .1331571
  population |  -3.35e-08   1.01e-07    -0.33   0.739    -2.31e-07    1.64e-07
       _cons |    5.80962   2.442076     2.38   0.017     1.023239      10.596
------------------------------------------------------------------------------

. reghv excess_deaths_pc covdeath_pc if days_to_report > 14, var( p_pos population) cluster(fips)

iteration 1:  Log-likelihood =     -1645  |delta-b|     1.756 
iteration 2:  Log-likelihood =     -1626  |delta-b|      3.67 
iteration 3:  Log-likelihood =     -1623  |delta-b|     1.316 
iteration 4:  Log-likelihood =     -1623  |delta-b|     .3939 
iteration 5:  Log-likelihood =     -1623  |delta-b|    .07117 
iteration 6:  Log-likelihood =     -1623  |delta-b|    .02289 
iteration 7:  Log-likelihood =     -1623  |delta-b|   .005806 
iteration 8:  Log-likelihood =     -1623  |delta-b|   .001991 

Multiplicative heteroscedastic regression             Number of obs  =     358
Estimator: mle                                        Model chi2(3)  = 676.662
                                                      Prob > chi2    =   0.000
Log Likelihood              = -1623.281               Pseudo R2      =  0.1725
                                                      VWLS R2        =  0.9040
                                  (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
excess_dea~c |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
lp_mean      |
 covdeath_pc |   1.351164   .0303009    44.59   0.000     1.291775    1.410552
       _cons |  -3.121793   2.016403    -1.55   0.122     -7.07387    .8302844
-------------+----------------------------------------------------------------
lp_lnvar     |
       p_pos |   .0055109   .0152099     0.36   0.717    -.0242999    .0353216
  population |  -8.16e-08   2.83e-08    -2.89   0.004    -1.37e-07   -2.62e-08
       _cons |   6.668256   .5284807    12.62   0.000     5.632452    7.704059
------------------------------------------------------------------------------

. 
. 
. 
. reg deathincrease_pc adj_covid_deaths_pc [aweight=population] if days_to_report > 7, cluster(fips)
(sum of wgt is 3,139,373,590)

Linear regression                               Number of obs     =        481
                                                F(1, 48)          =     659.00
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9225
                                                Root MSE          =     12.314

                                         (Std. Err. adjusted for 49 clusters in fips)
-------------------------------------------------------------------------------------
                    |               Robust
   deathincrease_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
adj_covid_deaths_pc |   .8638556   .0336509    25.67   0.000     .7961959    .9315154
              _cons |   2.419353   .5923358     4.08   0.000     1.228383    3.610324
-------------------------------------------------------------------------------------

. reg deathincrease_pc adj_covid_deaths_pc l.adj_covid_deaths_pc [aweight=population] if days_to_repo
> rt > 7, cluster(fips)
(sum of wgt is 3,131,758,697)

Linear regression                               Number of obs     =        480
                                                F(2, 48)          =    1327.31
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9494
                                                Root MSE          =     9.9719

                                         (Std. Err. adjusted for 49 clusters in fips)
-------------------------------------------------------------------------------------
                    |               Robust
   deathincrease_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
adj_covid_deaths_pc |
                --. |   .5632046   .0999476     5.63   0.000     .3622465    .7641627
                L1. |   .3398416   .1445495     2.35   0.023     .0492053    .6304779
                    |
              _cons |   2.421244   .5130085     4.72   0.000     1.389771    3.452716
-------------------------------------------------------------------------------------

. reg deathincrease_pc c.adj_covid_deaths_pc##c.p_pos [aweight=population] if days_to_report > 7, clu
> ster(fips)
(sum of wgt is 2,568,711,386)

Linear regression                               Number of obs     =        407
                                                F(3, 48)          =     293.16
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9339
                                                Root MSE          =     12.253

                                                   (Std. Err. adjusted for 49 clusters in fips)
-----------------------------------------------------------------------------------------------
                              |               Robust
             deathincrease_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
          adj_covid_deaths_pc |   1.169278   .0502544    23.27   0.000     1.068234    1.270321
                        p_pos |  -.0013201   .0531488    -0.02   0.980     -.108183    .1055428
                              |
c.adj_covid_deaths_pc#c.p_pos |  -.0080398   .0013408    -6.00   0.000    -.0107357   -.0053439
                              |
                        _cons |   .5157169     .67275     0.77   0.447    -.8369376    1.868371
-----------------------------------------------------------------------------------------------

. reg deathincrease_pc c.adj_covid_deaths_pc##c.new_tests_pc [aweight=population] if days_to_report >
>  7, cluster(fips)
(sum of wgt is 2,568,711,386)

Linear regression                               Number of obs     =        407
                                                F(3, 48)          =    3889.75
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9292
                                                Root MSE          =      12.68

                                            (Std. Err. adjusted for 49 clusters in fips)
----------------------------------------------------------------------------------------
                       |               Robust
      deathincrease_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------+----------------------------------------------------------------
   adj_covid_deaths_pc |   .8837279   .0910039     9.71   0.000     .7007523    1.066703
          new_tests_pc |   .0023216   .0004693     4.95   0.000     .0013781    .0032651
                       |
 c.adj_covid_deaths_pc#|
        c.new_tests_pc |  -.0000115   9.35e-06    -1.23   0.226    -.0000303    7.34e-06
                       |
                 _cons |  -3.276774   .9359856    -3.50   0.001    -5.158699   -1.394849
----------------------------------------------------------------------------------------

. reg deathincrease_pc c.adj_covid_deaths_pc##c.new_tests_pc c.l.adj_covid_deaths_pc##c.new_tests_pc 
> [aweight=population] if days_to_report > 7, cluster(fips)
(sum of wgt is 2,568,711,386)
note: new_tests_pc omitted because of collinearity

Linear regression                               Number of obs     =        407
                                                F(5, 48)          =    1544.57
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9675
                                                Root MSE          =     8.6116

                                             (Std. Err. adjusted for 49 clusters in fips)
-----------------------------------------------------------------------------------------
                        |               Robust
       deathincrease_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
    adj_covid_deaths_pc |  -.1000176   .2171393    -0.46   0.647    -.5366054    .3365702
           new_tests_pc |   .0018945   .0005116     3.70   0.001     .0008659    .0029232
                        |
  c.adj_covid_deaths_pc#|
         c.new_tests_pc |   .0000891   .0000261     3.41   0.001     .0000366    .0001416
                        |
    adj_covid_deaths_pc |
                    L1. |   1.245162   .2403276     5.18   0.000     .7619509    1.728373
                        |
           new_tests_pc |          0  (omitted)
                        |
 cL.adj_covid_deaths_pc#|
         c.new_tests_pc |  -.0001258   .0000276    -4.56   0.000    -.0001813   -.0000703
                        |
                  _cons |  -2.104796   .9685552    -2.17   0.035    -4.052207   -.1573855
-----------------------------------------------------------------------------------------

. reg deathincrease_pc c.excess_deaths_pc##c.new_tests_pc c.l.excess_deaths_pc##c.new_tests_pc [aweig
> ht=population] if days_to_report > 7, cluster(fips)
(sum of wgt is 2,568,711,386)
note: new_tests_pc omitted because of collinearity

Linear regression                               Number of obs     =        407
                                                F(5, 48)          =     622.93
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9206
                                                Root MSE          =     13.459

                                                        (Std. Err. adjusted for 49 clusters in fips)
----------------------------------------------------------------------------------------------------
                                   |               Robust
                  deathincrease_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------------------+----------------------------------------------------------------
                  excess_deaths_pc |  -.1051605   .1454447    -0.72   0.473    -.3975967    .1872757
                      new_tests_pc |   .0039403   .0007197     5.48   0.000     .0024932    .0053873
                                   |
 c.excess_deaths_pc#c.new_tests_pc |   .0000499     .00002     2.50   0.016     9.74e-06      .00009
                                   |
                  excess_deaths_pc |
                               L1. |   .7442923   .1721928     4.32   0.000     .3980754    1.090509
                                   |
                      new_tests_pc |          0  (omitted)
                                   |
cL.excess_deaths_pc#c.new_tests_pc |  -.0000592   .0000215    -2.75   0.008    -.0001024    -.000016
                                   |
                             _cons |  -3.803209   2.013645    -1.89   0.065    -7.851913    .2454953
----------------------------------------------------------------------------------------------------

. 
. 
. reg excess_deaths_pc covdeath_pc [aweight=population] if days_to_report > 14, cluster(fips)
(sum of wgt is 4,398,606,128)

Linear regression                               Number of obs     =        686
                                                F(1, 48)          =    3198.30
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9186
                                                Root MSE          =     16.947

                                  (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
excess_dea~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 covdeath_pc |    1.36722   .0241757    56.55   0.000     1.318611    1.415828
       _cons |  -2.382792   2.207638    -1.08   0.286    -6.821547    2.055962
------------------------------------------------------------------------------

. reg excess_respir_deaths_pc covdeath_pc [aweight=population] if days_to_report > 14, cluster(fips)
(sum of wgt is 4,398,606,128)

Linear regression                               Number of obs     =        686
                                                F(1, 48)          =   19279.48
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9948
                                                Root MSE          =      3.176

                                  (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
excess_res~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 covdeath_pc |   1.058919   .0076263   138.85   0.000     1.043585    1.074253
       _cons |  -.5811705   .3323857    -1.75   0.087    -1.249477    .0871358
------------------------------------------------------------------------------

. 
. reg excess_deaths_pc c.covdeath_pc##c.p_pos [aweight=population] if days_to_report > 14, cluster(fi
> ps)
(sum of wgt is 2,254,525,234)

Linear regression                               Number of obs     =        358
                                                F(3, 48)          =    2847.49
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9602
                                                Root MSE          =     15.444

                                           (Std. Err. adjusted for 49 clusters in fips)
---------------------------------------------------------------------------------------
                      |               Robust
     excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
          covdeath_pc |   .8712449   .0858447    10.15   0.000     .6986425    1.043847
                p_pos |   .0617641   .1063558     0.58   0.564    -.1520786    .2756069
                      |
c.covdeath_pc#c.p_pos |   .0121782   .0024429     4.99   0.000     .0072664      .01709
                      |
                _cons |   .5670926   1.928497     0.29   0.770     -3.31041    4.444596
---------------------------------------------------------------------------------------

. reg excess_respir_deaths_pc c.covdeath_pc##c.p_pos [aweight=population] if days_to_report > 14, clu
> ster(fips)
(sum of wgt is 2,254,525,234)

Linear regression                               Number of obs     =        358
                                                F(3, 48)          =   77460.61
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9973
                                                Root MSE          =     3.0198

                                           (Std. Err. adjusted for 49 clusters in fips)
---------------------------------------------------------------------------------------
                      |               Robust
excess_respir_death~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
          covdeath_pc |   .9393303   .0146087    64.30   0.000     .9099575    .9687031
                p_pos |   .0442768   .0227662     1.94   0.058    -.0014976    .0900512
                      |
c.covdeath_pc#c.p_pos |   .0027133   .0003085     8.80   0.000     .0020931    .0033335
                      |
                _cons |     .39487   .4847166     0.81   0.419    -.5797181    1.369458
---------------------------------------------------------------------------------------

. 
. reg f.excess_deaths_pc c.new_pos_pc##c.p_pos [aweight=population] if days_to_report > 14, cluster(f
> ips)
(sum of wgt is 2,254,525,234)

Linear regression                               Number of obs     =        358
                                                F(3, 48)          =      94.91
                                                Prob > F          =     0.0000
                                                R-squared         =     0.8243
                                                Root MSE          =     32.815

                                          (Std. Err. adjusted for 49 clusters in fips)
--------------------------------------------------------------------------------------
                     |               Robust
  F.excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
          new_pos_pc |   .0131169   .0165209     0.79   0.431    -.0201007    .0463344
               p_pos |   .2310137   .1889435     1.22   0.227    -.1488827      .61091
                     |
c.new_pos_pc#c.p_pos |   .0020868   .0006017     3.47   0.001      .000877    .0032965
                     |
               _cons |   2.237316   3.976445     0.56   0.576    -5.757862     10.2325
--------------------------------------------------------------------------------------

. reg f.excess_respir_deaths_pc c.new_pos_pc##c.p_pos [aweight=population] if days_to_report > 14, cl
> uster(fips)
(sum of wgt is 2,254,525,234)

Linear regression                               Number of obs     =        358
                                                F(3, 48)          =     118.22
                                                Prob > F          =     0.0000
                                                R-squared         =     0.8936
                                                Root MSE          =     18.999

                                          (Std. Err. adjusted for 49 clusters in fips)
--------------------------------------------------------------------------------------
F.                   |               Robust
excess_respir_deat~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
          new_pos_pc |   .0192697   .0125464     1.54   0.131    -.0059564    .0444959
               p_pos |   .1139819   .0884355     1.29   0.204    -.0638296    .2917933
                     |
c.new_pos_pc#c.p_pos |   .0014266   .0004515     3.16   0.003     .0005187    .0023345
                     |
               _cons |    2.71139   2.557627     1.06   0.294    -2.431064    7.853844
--------------------------------------------------------------------------------------

. 
. 
. log close
      name:  <unnamed>
       log:  C:\Users\favero\Documents\GitHub\covid-underreporting\code\..\logs\cleandata.txt
  log type:  text
 closed on:  21 May 2020, 14:17:03
-----------------------------------------------------------------------------------------------------
