--------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\favero\Documents\GitHub\covid-underreporting\code\..\logs\cleandata.txt
  log type:  text
 opened on:   9 May 2020, 18:05:34

. 
. use "..\data\population.dta" // start from this file because it has both fips codes and state names

. 
. merge 1:m fips using "..\data\covidtracking.dta", keep(2 3)

    Result                           # of obs.
    -----------------------------------------
    not matched                           270
        from master                         0  (_merge==1)
        from using                        270  (_merge==2)

    matched                             3,331  (_merge==3)
    -----------------------------------------

. drop _merge population // merge population back in later because want it merged to all observations, even those missing 
> from the current dataset

. 
. merge 1:1 state date using "..\data\cdc_deaths.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                         3,417
        from master                     3,138  (_merge==1)
        from using                        279  (_merge==2)

    matched                               463  (_merge==3)
    -----------------------------------------

. drop _merge

. 
. drop fips

. merge m:1 state using "..\data\population.dta", keep(1 3)

    Result                           # of obs.
    -----------------------------------------
    not matched                           298
        from master                       298  (_merge==1)
        from using                          0  (_merge==2)

    matched                             3,582  (_merge==3)
    -----------------------------------------

. drop _merge

. order date fips

. sort fips state date

. 
. drop if fips > 56
(298 observations deleted)

. 
. encode dataqualitygrade, gen(datagrade)

. order datagrade, after(dataqualitygrade)

. drop dataqualitygrade

. 
. gen end_week = date + mod(6 - dow(date), 7)

. format end_week %tdCCYYNNDD

. order end_week, after(date)

. 
. foreach var of varlist positive-datagrade death-pneumon_influ_and_covid {
  2.         gen `var'_mis = (`var'==.)
  3. }

. collapse (firstnm) state report_date (lastnm) positive-datagrade population (sum) death-pneumon_influ_and_covid *_mis, b
> y(end_week fips)

. foreach var of varlist positive-datagrade {
  2.         replace `var' = . if `var'_mis > 0
  3. }
(0 real changes made)
(16 real changes made, 16 to missing)
(50 real changes made, 50 to missing)
(46 real changes made, 46 to missing)
(47 real changes made, 47 to missing)
(29 real changes made, 29 to missing)
(17 real changes made, 17 to missing)
(26 real changes made, 26 to missing)
(12 real changes made, 12 to missing)
(42 real changes made, 42 to missing)
(51 real changes made, 51 to missing)

. foreach var of varlist death-pneumon_influ_and_covid {
  2.         replace `var' = . if `var'_mis > 6 | report_date == .
  3. }
(109 real changes made, 109 to missing)
(269 real changes made, 269 to missing)
(52 real changes made, 52 to missing)
(52 real changes made, 52 to missing)
(52 real changes made, 52 to missing)
(52 real changes made, 52 to missing)
(52 real changes made, 52 to missing)
(52 real changes made, 52 to missing)
(52 real changes made, 52 to missing)
(52 real changes made, 52 to missing)
(168 real changes made, 168 to missing)
(53 real changes made, 53 to missing)
(61 real changes made, 61 to missing)
(100 real changes made, 100 to missing)
(196 real changes made, 196 to missing)
(269 real changes made, 269 to missing)
(88 real changes made, 88 to missing)

. drop *_mis

. 
. xtset fips end_week, delta(7)
       panel variable:  fips (unbalanced)
        time variable:  end_week, 20200125 to 20200509
                delta:  7 days

. 
. gen new_pos = d.positive if d.positive>=0
(302 missing values generated)

. gen new_neg = d.negative if d.negative>=0
(344 missing values generated)

. gen p_pos = new_pos/(new_pos+new_neg)*100
(344 missing values generated)

. order new_pos-p_pos, after(negative)

. 
. // adjust expected deaths for reporting lag: https://www.cdc.gov/nchs/data/vsrr/report001.pdf
. // maybe also somehow adjust for how the individual state was doing relative to expectations pre-covid
. gen days_to_report = report_date - end_week
(52 missing values generated)

. 
. drop if fips == 9 | fips == 37 // Connecticut and North Carolina's data look highly problematic, so dropping them
(30 observations deleted)

. 
. 
. //gen allcause_minus_posscovid = total_deaths - pneumon_influ_and_covid
. //gen allcause_pc  = allcause_minus_posscovid*1000000/population
. //bys days_to_report: sum allcause_minus_posscovid_pc
. 
. gen adj_expected_deaths = expected_deaths
(51 missing values generated)

. replace adj_expected_deaths = expected_deaths * 93 / 212 if days_to_report <= 7 & days_to_report != .
(48 real changes made)

. replace adj_expected_deaths = expected_deaths * 159 / 212 if days_to_report > 7 & days_to_report <= 14
(49 real changes made)

. replace adj_expected_deaths = expected_deaths * 192 / 212 if days_to_report > 14 & days_to_report <= 21
(49 real changes made)

. 
. egen cumulative_covdeath = sum(covid_deaths), by(fips)

. 
. gen covdeath_pc = covid_deaths*1000000/population
(165 missing values generated)

. gen excess_deaths_pc = (total_deaths-adj_expected_deaths)*1000000/population
(51 missing values generated)

. gen new_pos_pc = new_pos*1000000/population
(290 missing values generated)

. gen new_neg_pc = new_neg*1000000/population
(329 missing values generated)

. gen new_tests_pc = new_pos_pc + new_neg_pc
(329 missing values generated)

. 
. gen log_covdeath = log(covid_deaths)
(529 missing values generated)

.         //replace log_covdeath = 2 if covid_deaths==0
. gen log_allcause = log(total_deaths)
(51 missing values generated)

. gen log_expected = log(adj_expected_deaths)
(51 missing values generated)

. gen excess_deaths = log_allcause-log_expected
(51 missing values generated)

. 
. 
. reg excess_deaths_pc covdeath_pc [aweight=population] if days_to_report > 14, cluster(fips) nocons
(sum of wgt is 3,395,110,779)

Linear regression                               Number of obs     =        499
                                                F(1, 48)          =    3843.12
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9121
                                                Root MSE          =     18.559

                                  (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
excess_dea~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 covdeath_pc |   1.489316    .024024    61.99   0.000     1.441013     1.53762
------------------------------------------------------------------------------

. margins, dydx(covdeath_pc)

Average marginal effects                        Number of obs     =        499
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : covdeath_pc

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 covdeath_pc |   1.489316    .024024    61.99   0.000     1.441013     1.53762
------------------------------------------------------------------------------

. 
. twoway (scatter excess_deaths_pc covdeath_pc if days_to_report > 14, mcolor(%30) yline(0)) (function y=x, range(0 300))

. 
. reg excess_deaths_pc covdeath_pc [aweight=population] if days_to_report > 14, cluster(fips)
(sum of wgt is 3,395,110,779)

Linear regression                               Number of obs     =        499
                                                F(1, 48)          =    3630.62
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9057
                                                Root MSE          =     18.516

                                  (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
excess_dea~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 covdeath_pc |   1.501544     .02492    60.25   0.000     1.451439    1.551649
       _cons |  -1.583705   2.685701    -0.59   0.558     -6.98367    3.816259
------------------------------------------------------------------------------

. reg excess_deaths_pc c.covdeath_pc c.p_pos [aweight=population] if days_to_report > 14, cluster(fips)
(sum of wgt is 1,346,784,908)

Linear regression                               Number of obs     =        184
                                                F(2, 47)          =    2445.30
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9521
                                                Root MSE          =      18.83

                                  (Std. Err. adjusted for 48 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
excess_dea~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 covdeath_pc |   1.472024    .031027    47.44   0.000     1.409606    1.534442
       p_pos |   .1849169   .1847189     1.00   0.322    -.1866896    .5565234
       _cons |  -3.436991   3.809735    -0.90   0.372    -11.10119    4.227207
------------------------------------------------------------------------------

. reg excess_deaths_pc c.covdeath_pc##c.p_pos [aweight=population] if days_to_report > 14, cluster(fips)
(sum of wgt is 1,346,784,908)

Linear regression                               Number of obs     =        184
                                                F(3, 47)          =    3479.25
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9555
                                                Root MSE          =     18.195

                                           (Std. Err. adjusted for 48 clusters in fips)
---------------------------------------------------------------------------------------
                      |               Robust
     excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
          covdeath_pc |   1.078948   .1974406     5.46   0.000     .6817492    1.476148
                p_pos |   .0547623   .1477235     0.37   0.713    -.2424191    .3519438
                      |
c.covdeath_pc#c.p_pos |   .0095019   .0043476     2.19   0.034     .0007556    .0182482
                      |
                _cons |   1.798768   3.679971     0.49   0.627    -5.604379    9.201915
---------------------------------------------------------------------------------------

. reg excess_deaths_pc c.covdeath_pc c.new_pos_pc c.new_neg_pc [aweight=population] if days_to_report > 14, cluster(fips)
(sum of wgt is 1,346,784,908)

Linear regression                               Number of obs     =        184
                                                F(3, 47)          =    3026.20
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9574
                                                Root MSE          =     17.804

                                  (Std. Err. adjusted for 48 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
excess_dea~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 covdeath_pc |   1.359758   .1395117     9.75   0.000     1.079097     1.64042
  new_pos_pc |    .016717   .0118768     1.41   0.166    -.0071761    .0406101
  new_neg_pc |  -.0058815   .0014894    -3.95   0.000    -.0088778   -.0028852
       _cons |   6.200647   3.176819     1.95   0.057    -.1902891    12.59158
------------------------------------------------------------------------------

. reg excess_deaths_pc c.covdeath_pc##c.new_pos_pc c.covdeath_pc##c.new_neg_pc [aweight=population] if days_to_report > 14
> , cluster(fips)
(sum of wgt is 1,346,784,908)
note: covdeath_pc omitted because of collinearity

Linear regression                               Number of obs     =        184
                                                F(5, 47)          =    2426.13
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9599
                                                Root MSE          =     17.372

                                                (Std. Err. adjusted for 48 clusters in fips)
--------------------------------------------------------------------------------------------
                           |               Robust
          excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------------+----------------------------------------------------------------
               covdeath_pc |   1.522784   .1967029     7.74   0.000     1.127069    1.918499
                new_pos_pc |   .0108866   .0096009     1.13   0.263     -.008428    .0302012
                           |
c.covdeath_pc#c.new_pos_pc |   .0000678   .0000539     1.26   0.215    -.0000407    .0001763
                           |
               covdeath_pc |          0  (omitted)
                new_neg_pc |  -.0030259   .0013462    -2.25   0.029    -.0057341   -.0003177
                           |
c.covdeath_pc#c.new_neg_pc |  -.0000794   .0000299    -2.65   0.011    -.0001396   -.0000192
                           |
                     _cons |   2.669077   3.254812     0.82   0.416    -3.878761    9.216915
--------------------------------------------------------------------------------------------

. reg excess_deaths_pc c.covdeath_pc c.new_tests_pc [aweight=population] if days_to_report > 14, cluster(fips)
(sum of wgt is 1,346,784,908)

Linear regression                               Number of obs     =        184
                                                F(2, 47)          =    2736.29
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9539
                                                Root MSE          =     18.471

                                  (Std. Err. adjusted for 48 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
excess_dea~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 covdeath_pc |   1.580723   .0403689    39.16   0.000     1.499511    1.661935
new_tests_pc |  -.0032849   .0011856    -2.77   0.008      -.00567   -.0008999
       _cons |   4.366316   3.145248     1.39   0.172    -1.961108    10.69374
------------------------------------------------------------------------------

. reg excess_deaths_pc c.covdeath_pc##c.new_tests_pc [aweight=population] if days_to_report > 14, cluster(fips)
(sum of wgt is 1,346,784,908)

Linear regression                               Number of obs     =        184
                                                F(3, 47)          =    5729.81
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9553
                                                Root MSE          =      18.24

                                                  (Std. Err. adjusted for 48 clusters in fips)
----------------------------------------------------------------------------------------------
                             |               Robust
            excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                 covdeath_pc |   1.799163   .1328769    13.54   0.000     1.531849    2.066477
                new_tests_pc |  -.0029473   .0012127    -2.43   0.019     -.005387   -.0005076
                             |
c.covdeath_pc#c.new_tests_pc |  -.0000315   .0000191    -1.65   0.106      -.00007    6.97e-06
                             |
                       _cons |    1.57604   3.743993     0.42   0.676    -5.955902    9.107982
----------------------------------------------------------------------------------------------

. reg excess_deaths_pc c.covdeath_pc##c.new_tests_pc c.covdeath_pc##c.p_pos [aweight=population] if days_to_report > 14, c
> luster(fips)
(sum of wgt is 1,346,784,908)
note: covdeath_pc omitted because of collinearity

Linear regression                               Number of obs     =        184
                                                F(5, 47)          =    2779.34
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9575
                                                Root MSE          =     17.873

                                                  (Std. Err. adjusted for 48 clusters in fips)
----------------------------------------------------------------------------------------------
                             |               Robust
            excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                 covdeath_pc |    1.42638    .291252     4.90   0.000      .840457    2.012304
                new_tests_pc |  -.0017275   .0018909    -0.91   0.366    -.0055314    .0020765
                             |
c.covdeath_pc#c.new_tests_pc |   -.000032   .0000187    -1.72   0.093    -.0000695    5.53e-06
                             |
                 covdeath_pc |          0  (omitted)
                       p_pos |  -.0569877    .173655    -0.33   0.744    -.4063366    .2923611
                             |
       c.covdeath_pc#c.p_pos |   .0081702   .0054442     1.50   0.140    -.0027821    .0191224
                             |
                       _cons |   3.323386    4.86704     0.68   0.498    -6.467836    13.11461
----------------------------------------------------------------------------------------------

. reg excess_deaths_pc c.covdeath_pc##c.new_tests_pc##c.p_pos [aweight=population] if days_to_report > 14, cluster(fips)
(sum of wgt is 1,346,784,908)

Linear regression                               Number of obs     =        184
                                                F(7, 47)          =    3511.83
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9615
                                                Root MSE          =     17.106

                                                          (Std. Err. adjusted for 48 clusters in fips)
------------------------------------------------------------------------------------------------------
                                     |               Robust
                    excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------------------------+----------------------------------------------------------------
                         covdeath_pc |   2.054351   .3216755     6.39   0.000     1.407224    2.701479
                        new_tests_pc |  -.0042408   .0013831    -3.07   0.004    -.0070232   -.0014584
                                     |
        c.covdeath_pc#c.new_tests_pc |  -.0001803   .0000485    -3.72   0.001    -.0002779   -.0000827
                                     |
                               p_pos |  -.1761649    .142189    -1.24   0.222    -.4622122    .1098824
                                     |
               c.covdeath_pc#c.p_pos |  -.0165929   .0073575    -2.26   0.029    -.0313942   -.0017916
                                     |
              c.new_tests_pc#c.p_pos |   .0002419    .000093     2.60   0.012     .0000548     .000429
                                     |
c.covdeath_pc#c.new_tests_pc#c.p_pos |   4.23e-06   1.15e-06     3.67   0.001     1.91e-06    6.56e-06
                                     |
                               _cons |   3.500363   4.010958     0.87   0.387    -4.568644    11.56937
------------------------------------------------------------------------------------------------------

. 
. reghv excess_deaths_pc covdeath_pc if days_to_report > 14, var( p_pos population) twostage cluster(fips)

Multiplicative heteroscedastic regression             Number of obs  =     184
Estimator: 2sls                                       Model chi2(3)  = 356.544
                                                      Prob > chi2    =   0.000
Log Likelihood              =  -855.827               Pseudo R2      =  0.1724
                                                      VWLS R2        =  0.7839
                                  (Std. Err. adjusted for 48 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
excess_dea~c |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
lp_mean      |
 covdeath_pc |    1.47132   .0571734    25.73   0.000     1.359262    1.583378
       _cons |  -5.724425   2.339528    -2.45   0.014    -10.30981   -1.139036
-------------+----------------------------------------------------------------
lp_lnvar     |
       p_pos |   .0245365   .0616839     0.40   0.691    -.0963616    .1454347
  population |  -6.67e-09   1.42e-07    -0.05   0.963    -2.85e-07    2.72e-07
       _cons |   5.748966   1.425448     4.03   0.000      2.95514    8.542793
------------------------------------------------------------------------------

. reghv excess_deaths_pc covdeath_pc if days_to_report > 14, var( p_pos population) cluster(fips)

iteration 1:  Log-likelihood =    -847.4  |delta-b|     1.233 
iteration 2:  Log-likelihood =    -840.3  |delta-b|     4.829 
iteration 3:  Log-likelihood =    -839.5  |delta-b|     1.743 
iteration 4:  Log-likelihood =    -839.4  |delta-b|     .2197 
iteration 5:  Log-likelihood =    -839.4  |delta-b|    .05266 
iteration 6:  Log-likelihood =    -839.4  |delta-b|     .0135 
iteration 7:  Log-likelihood =    -839.4  |delta-b|   .003799 
iteration 8:  Log-likelihood =    -839.4  |delta-b|  .0009137 

Multiplicative heteroscedastic regression             Number of obs  =     184
Estimator: mle                                        Model chi2(3)  = 389.312
                                                      Prob > chi2    =   0.000
Log Likelihood              =  -839.443               Pseudo R2      =  0.1882
                                                      VWLS R2        =  0.8039
                                  (Std. Err. adjusted for 48 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
excess_dea~c |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
lp_mean      |
 covdeath_pc |    1.43174   .0483709    29.60   0.000     1.336935    1.526545
       _cons |  -1.393904    2.78699    -0.50   0.617    -6.856303    4.068496
-------------+----------------------------------------------------------------
lp_lnvar     |
       p_pos |   .0435606   .0149468     2.91   0.004     .0142653    .0728559
  population |  -6.24e-08   3.11e-08    -2.01   0.045    -1.23e-07   -1.48e-09
       _cons |   6.070109   .4098379    14.81   0.000     5.266842    6.873377
------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  C:\Users\favero\Documents\GitHub\covid-underreporting\code\..\logs\cleandata.txt
  log type:  text
 closed on:   9 May 2020, 18:05:37
--------------------------------------------------------------------------------------------------------------------------
