-----------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\favero\Documents\GitHub\covid-underreporting\code\..\logs\cleandata.txt
  log type:  text
 opened on:  19 Jun 2020, 16:30:10

. 
. use "..\data\population.dta" // start from this file because it has both fips codes and state names

. 
. merge 1:m fips using "..\data\covidtracking.dta", keep(2 3)

    Result                           # of obs.
    -----------------------------------------
    not matched                           475
        from master                         0  (_merge==1)
        from using                        475  (_merge==2)

    matched                             5,422  (_merge==3)
    -----------------------------------------

. drop _merge population risk_standardized_population // merge population back in later because want 
> it merged to all observations, even those missing from the current dataset

. 
. merge 1:1 state date using "..\data\past_reports\19 Jun 2020 cdc_deaths.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                         5,419
        from master                     5,128  (_merge==1)
        from using                        291  (_merge==2)

    matched                               769  (_merge==3)
    -----------------------------------------

. drop _merge

. 
. merge 1:1 state date using "..\data\cdc_historical_deaths.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                        24,087
        from master                     5,269  (_merge==1)
        from using                     18,818  (_merge==2)

    matched                               919  (_merge==3)
    -----------------------------------------

. drop _merge

. 
. drop fips

. merge m:1 state using "..\data\population.dta", keep(1 3)

    Result                           # of obs.
    -----------------------------------------
    not matched                           515
        from master                       515  (_merge==1)
        from using                          0  (_merge==2)

    matched                            24,491  (_merge==3)
    -----------------------------------------

. drop _merge

. replace state = "Puerto Rico" if state == "PR"
(95 real changes made)

. replace fips = 72 if state=="Puerto Rico"
(115 real changes made)

. order date fips

. sort fips state date

. 
. // bring in delay multipliers, which adjust expected deaths for reporting lag: https://www.cdc.gov/
> nchs/data/vsrr/report001.pdf
. // note: excess deaths do not adjust for how the individual state was doing relative to expectation
> s pre-covid this year
. gen end_week = date + mod(6 - dow(date), 7)

. format end_week %tdCCYYNNDD

. order end_week, after(date)

. gen days_to_report = report_date - end_week
(23,946 missing values generated)

. merge m:1 state days_to_report using "..\data\delay_multipliers.dta", keep(1 3)

    Result                           # of obs.
    -----------------------------------------
    not matched                        24,256
        from master                    24,256  (_merge==1)
        from using                          0  (_merge==2)

    matched                               750  (_merge==3)
    -----------------------------------------

. drop _merge

. replace delay_multiplier = 1 if days_to_report >= 118 & delay_multiplier == . & days_to_report != .
(212 real changes made)

. 
. drop if fips == . & state != "United States"
(380 observations deleted)

. 
. //drop if fips == 9 | fips == 37 // Connecticut and North Carolina's provisional death data look hi
> ghly problematic, so they are not included in analyses using death counts; however, they are kept i
> n the dataset for analysis of hospitalizations
. 
. encode dataqualitygrade, gen(datagrade)

. order datagrade, after(dataqualitygrade)

. drop dataqualitygrade

. 
. drop hash datechecked // new variables added to more recent versions of covidtracking's data that i
> nterfere with following code:

. foreach var of varlist positive-datagrade death-pneumon_influ_or_covid numinfluenzadeaths-percentco
> mplete {
  2.         gen `var'_mis = (`var'==.)
  3. }

. gen dayscollapsed = 1

. sort fips state date

. collapse (firstnm) state report_date epi_week (lastnm) positive-datagrade population risk_standardi
> zed_population delay_multiplier days_to_report death-posneg (sum) deathincrease-pneumon_influ_or_co
> vid numinfluenzadeaths-percentcomplete *_mis dayscollapsed, by(end_week fips)

. foreach var of varlist positive-datagrade {
  2.         replace `var' = . if `var'_mis > 0
  3. }
(13 real changes made, 13 to missing)
(24 real changes made, 24 to missing)
(60 real changes made, 60 to missing)
(61 real changes made, 61 to missing)
(51 real changes made, 51 to missing)
(41 real changes made, 41 to missing)
(18 real changes made, 18 to missing)
(36 real changes made, 36 to missing)
(12 real changes made, 12 to missing)
(46 real changes made, 46 to missing)
(63 real changes made, 63 to missing)

. foreach var of varlist death-pneumon_influ_or_covid numinfluenzadeaths-percentcomplete {
  2.         replace `var' = . if `var'_mis == dayscollapsed
  3. }
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(19,096 real changes made, 19,096 to missing)
(19,096 real changes made, 19,096 to missing)
(19,096 real changes made, 19,096 to missing)
(19,096 real changes made, 19,096 to missing)
(19,096 real changes made, 19,096 to missing)
(19,096 real changes made, 19,096 to missing)
(19,096 real changes made, 19,096 to missing)
(19,931 real changes made, 19,931 to missing)
(18,871 real changes made, 18,871 to missing)
(18,871 real changes made, 18,871 to missing)
(18,871 real changes made, 18,871 to missing)
(18,871 real changes made, 18,871 to missing)
(18,871 real changes made, 18,871 to missing)
(18,871 real changes made, 18,871 to missing)
(18,871 real changes made, 18,871 to missing)
(194 real changes made, 194 to missing)
(194 real changes made, 194 to missing)
(194 real changes made, 194 to missing)
(194 real changes made, 194 to missing)

. drop *_mis

. 
. xtset fips end_week, delta(7)
       panel variable:  fips (unbalanced)
        time variable:  end_week, 20130105 to 20200620
                delta:  7 days

. 
. gen new_pos = d.positive if d.positive>=0
(19,164 missing values generated)

. gen new_neg = d.negative if d.negative>=0
(19,207 missing values generated)

. gen p_pos = new_pos/(new_pos+new_neg)*100
(19,209 missing values generated)

. order new_pos-p_pos, after(negative)

. 
. // dropping CDC expected death data because it appears to have errors
. drop expected_deaths

. 
. 
. // generate expected influenza/pneumonia deaths based on historical patterns
.         gen pneumon_or_influ_fluview = numinfluenzadeaths + numpneumoniadeaths if end_week < date("
> 20200201","YMD")
(1,112 missing values generated)

.         gen mmwrweek = substr(epi_week,-2,2)
(194 missing values generated)

.         gen year = year(end_week)

.         destring mmwrweek, replace
mmwrweek: all characters numeric; replaced as byte
(194 missing values generated)

.         replace mmwrweek = l.mmwrweek + 1 if mmwrweek == . & year == 2020
(153 real changes made)

.         
.         // use 2017-2019 data to calculate for each state the weekly average number of all-cause de
> aths and influenza/pneumonia deaths
.         replace pneumon_or_influ_fluview = .  if year == 2020 | year < 2016
(8,160 real changes made, 8,160 to missing)

.         rename totaldeaths allcause_fluview

.         replace allcause_fluview = .  if year == 2020 | year < 2016
(9,078 real changes made, 9,078 to missing)

.         
.         egen expected_influ_pneu_deaths = mean(pneumon_or_influ_fluview), by(state mmwrweek)
(92 missing values generated)

.         egen expected_deaths = mean(allcause_fluview), by(state mmwrweek)
(92 missing values generated)

.         
.         // Not currently using this method: most year-to-year variation in influenza severity seems
>  to be from weeks 50 to 8; thus, create a sin spike for this period with a year-varying coefficient
.         /*
>         gen flu_year = year + 1 if mmwrweek >= 40
>         gen mmwrweek2 = mmwrweek - 39 if mmwrweek >= 40
>         replace mmwrweek2 = l.mmwrweek2 + 1 if mmwrweek < 40
>         replace mmwrweek2 = mmwrweek + 13 if mmwrweek2 == .
>         gen fluseason = 0 if mmwrweek != .
>         replace fluseason = 1 if (mmwrweek >= 50 | mmwrweek <= 8) & mmwrweek != .
>         gen fluseason_sin_time = sin(fluseason*_pi*(mmwrweek2-10)/12)
>         
>         gen pneumon_or_influ_fluview_pc = pneumon_or_influ_fluview * 100000 / population if end_wee
> k < date("20200201","YMD")
>         gen allcause_fluview_pc = totaldeaths * 100000 / population if end_week < date("20200201","
> YMD")
> 
>         reg pneumon_or_influ_fluview_pc i.fips i.flu_year i.mmwrweek i.flu_year#c.fluseason_sin_tim
> e [aweight=population]
>         predict expected_influ_pneu_deaths_pc
>         gen expected_influ_pneu_deaths = expected_influ_pneu_deaths_pc * population / 100000
>         
>         reg allcause_fluview_pc i.fips i.flu_year i.mmwrweek i.flu_year#c.fluseason_sin_time [aweig
> ht=population]
>         predict expected_allcause_deaths_pc
>         gen expected_allcause_deaths = expected_allcause_deaths_pc * population / 100000
>         */
. 
. gen adj_expected_influ_pneu_deaths = expected_influ_pneu_deaths / delay_multiplier
(18,992 missing values generated)

. order adj_expected_influ_pneu_deaths, after(expected_influ_pneu_deaths)

. gen adj_expected_deaths = expected_deaths / delay_multiplier
(18,992 missing values generated)

. order adj_expected_deaths, after(expected_deaths)

. 
. replace covid_deaths = 5 if covid_deaths == . & total_deaths != . //rough imputation for where data
>  is supressed for 1-9 deaths
(0 real changes made)

. 
. 
. gen cumulative_covid_death = covid_deaths
(18,871 missing values generated)

. replace cumulative_covid_death = cumulative_covid_death + l.cumulative_covid_death if l.cumulative_
> covid_death != .
(671 real changes made)

. 
. 
. gen adj_covid_deaths = covid_deaths * delay_multiplier
(18,969 missing values generated)

. gen adj_cumulative_covid_death = adj_covid_deaths
(18,969 missing values generated)

. replace adj_cumulative_covid_death = adj_cumulative_covid_death + l.adj_cumulative_covid_death if l
> .adj_cumulative_covid_death != .
(579 real changes made)

. 
. gen adj_total_deaths = total_deaths * delay_multiplier
(18,969 missing values generated)

. gen adj_pneumon_influ_or_covid = pneumon_influ_or_covid * delay_multiplier
(18,969 missing values generated)

. 
. 
. gen covid_deaths_pc = covid_deaths*100000/risk_standardized_population
(18,911 missing values generated)

. gen excess_deaths_pc = (total_deaths-adj_expected_deaths)*100000/population
(18,992 missing values generated)

. gen excess_respir_deaths_pc = (pneumon_influ_or_covid-adj_expected_influ_pneu_deaths)*100000/risk_s
> tandardized_population
(18,992 missing values generated)

. gen adj_covid_deaths_pc = adj_covid_deaths*100000/risk_standardized_population
(18,992 missing values generated)

. gen adj_excess_deaths_pc = (adj_total_deaths-expected_deaths)*100000/population
(18,992 missing values generated)

. gen adj_excess_respir_deaths_pc = (adj_pneumon_influ_or_covid-expected_influ_pneu_deaths)*100000/ri
> sk_standardized_population
(18,992 missing values generated)

. gen new_pos_pc = new_pos*100000/population
(19,164 missing values generated)

. gen new_neg_pc = new_neg*100000/population
(19,207 missing values generated)

. gen new_tests_pc = new_pos_pc + new_neg_pc
(19,209 missing values generated)

. gen deathincrease_pc = deathincrease*100000/risk_standardized_population
(19,110 missing values generated)

. gen hospitalizedcurrently_pc = hospitalizedcurrently * 100000 / population
(19,492 missing values generated)

. 
. /*
> gen log_covid_death = log(covid_deaths)
>         //replace log_covid_death = 2 if covid_deaths==0
> gen log_allcause = log(total_deaths)
> gen log_expected = log(adj_expected_deaths)
> gen excess_deaths = log_allcause-log_expected
> */
. 
. save "..\data\weeklydata.dta", replace
file ..\data\weeklydata.dta saved

. 
. preserve

. drop if fips==. | fips==72
(41 observations deleted)

. 
. reg excess_deaths_pc covid_deaths_pc [aweight=population] if days_to_report > 14, cluster(fips) noc
> ons
(sum of wgt is 5,693,625,822)

Linear regression                               Number of obs     =        890
                                                F(1, 50)          =    5504.17
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9380
                                                Root MSE          =     1.5484

                                     (Std. Err. adjusted for 51 clusters in fips)
---------------------------------------------------------------------------------
                |               Robust
excess_deaths~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
covid_deaths_pc |   1.419348   .0191312    74.19   0.000     1.380921    1.457774
---------------------------------------------------------------------------------

. margins, dydx(covid_deaths_pc)

Average marginal effects                        Number of obs     =        890
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : covid_deaths_pc

---------------------------------------------------------------------------------
                |            Delta-method
                |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
covid_deaths_pc |   1.419348   .0191312    74.19   0.000     1.380921    1.457774
---------------------------------------------------------------------------------

. 
. twoway (scatter excess_deaths_pc covid_deaths_pc if days_to_report > 14, mcolor(%30) yline(0)) (fun
> ction y=x, range(0 40))

. 
. reg excess_deaths_pc covid_deaths_pc [aweight=population] if days_to_report > 14, cluster(fips)
(sum of wgt is 5,693,625,822)

Linear regression                               Number of obs     =        890
                                                F(1, 50)          =    2231.03
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9281
                                                Root MSE          =     1.4975

                                     (Std. Err. adjusted for 51 clusters in fips)
---------------------------------------------------------------------------------
                |               Robust
excess_deaths~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
covid_deaths_pc |   1.379031   .0291958    47.23   0.000     1.320389    1.437672
          _cons |   .4321973    .171611     2.52   0.015     .0875064    .7768881
---------------------------------------------------------------------------------

. reg excess_deaths_pc c.covid_deaths_pc c.p_pos [aweight=population] if days_to_report > 14, cluster
> (fips)
(sum of wgt is 3,469,330,012)

Linear regression                               Number of obs     =        550
                                                F(2, 48)          =    1147.19
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9529
                                                Root MSE          =     1.4207

                                     (Std. Err. adjusted for 49 clusters in fips)
---------------------------------------------------------------------------------
                |               Robust
excess_deaths~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
covid_deaths_pc |   1.356742   .0283259    47.90   0.000     1.299789    1.413695
          p_pos |   .0016549   .0122067     0.14   0.893    -.0228883     .026198
          _cons |   .6359772   .2005029     3.17   0.003     .2328391    1.039115
---------------------------------------------------------------------------------

. reg excess_deaths_pc c.covid_deaths_pc##c.p_pos [aweight=population] if days_to_report > 14, cluste
> r(fips)
(sum of wgt is 3,469,330,012)

Linear regression                               Number of obs     =        550
                                                F(3, 48)          =    1109.86
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9604
                                                Root MSE          =     1.3036

                                               (Std. Err. adjusted for 49 clusters in fips)
-------------------------------------------------------------------------------------------
                          |               Robust
         excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------------+----------------------------------------------------------------
          covid_deaths_pc |   1.043495    .080035    13.04   0.000     .8825735    1.204416
                    p_pos |  -.0149957   .0080588    -1.86   0.069    -.0311991    .0012076
                          |
c.covid_deaths_pc#c.p_pos |   .0087223    .002634     3.31   0.002     .0034262    .0140183
                          |
                    _cons |   1.170439   .1772645     6.60   0.000     .8140244    1.526853
-------------------------------------------------------------------------------------------

. 
. // Note: deathincrease_pc is not age-standardized but adj_covid_deaths_pc is
. reg deathincrease_pc adj_covid_deaths_pc [aweight=population] if days_to_report > 7, cluster(fips)
(sum of wgt is 4,415,731,892)

Linear regression                               Number of obs     =        690
                                                F(1, 48)          =     489.80
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9344
                                                Root MSE          =     .96272

                                         (Std. Err. adjusted for 49 clusters in fips)
-------------------------------------------------------------------------------------
                    |               Robust
   deathincrease_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
adj_covid_deaths_pc |   .8161431   .0368771    22.13   0.000     .7419968    .8902894
              _cons |   .2356495   .0591673     3.98   0.000     .1166857    .3546134
-------------------------------------------------------------------------------------

. reg deathincrease_pc adj_covid_deaths_pc l.adj_covid_deaths_pc [aweight=population] if days_to_repo
> rt > 7, cluster(fips)
(sum of wgt is 4,408,196,301)

Linear regression                               Number of obs     =        689
                                                F(2, 48)          =     609.24
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9534
                                                Root MSE          =     .81231

                                         (Std. Err. adjusted for 49 clusters in fips)
-------------------------------------------------------------------------------------
                    |               Robust
   deathincrease_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
adj_covid_deaths_pc |
                --. |   .5714284   .0792474     7.21   0.000     .4120908     .730766
                L1. |   .2693793    .112733     2.39   0.021     .0427143    .4960442
                    |
              _cons |   .2057817   .0480752     4.28   0.000     .1091201    .3024433
-------------------------------------------------------------------------------------

. reg deathincrease_pc c.adj_covid_deaths_pc##c.p_pos [aweight=population] if days_to_report > 7, clu
> ster(fips)
(sum of wgt is 3,781,120,670)

Linear regression                               Number of obs     =        598
                                                F(3, 48)          =     172.73
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9513
                                                Root MSE          =     .87187

                                                   (Std. Err. adjusted for 49 clusters in fips)
-----------------------------------------------------------------------------------------------
                              |               Robust
             deathincrease_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
          adj_covid_deaths_pc |   1.100499   .0540784    20.35   0.000     .9917674    1.209231
                        p_pos |   .0012324   .0030258     0.41   0.686    -.0048513     .007316
                              |
c.adj_covid_deaths_pc#c.p_pos |  -.0077968   .0006689   -11.66   0.000    -.0091418   -.0064518
                              |
                        _cons |   -.068745   .0579134    -1.19   0.241    -.1851876    .0476977
-----------------------------------------------------------------------------------------------

. 
. 
. reg excess_respir_deaths_pc covid_deaths_pc [aweight=population] if days_to_report > 14, cluster(fi
> ps)
(sum of wgt is 5,693,625,822)

Linear regression                               Number of obs     =        890
                                                F(1, 50)          =   76956.09
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9956
                                                Root MSE          =     .27223

                                     (Std. Err. adjusted for 51 clusters in fips)
---------------------------------------------------------------------------------
                |               Robust
excess_respir~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
covid_deaths_pc |   1.049627   .0037837   277.41   0.000     1.042027    1.057227
          _cons |  -.0503038   .0239442    -2.10   0.041    -.0983971   -.0022105
---------------------------------------------------------------------------------

. 
. reg excess_deaths_pc c.covid_deaths_pc##c.p_pos [aweight=population] if days_to_report > 14, cluste
> r(fips)
(sum of wgt is 3,469,330,012)

Linear regression                               Number of obs     =        550
                                                F(3, 48)          =    1109.86
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9604
                                                Root MSE          =     1.3036

                                               (Std. Err. adjusted for 49 clusters in fips)
-------------------------------------------------------------------------------------------
                          |               Robust
         excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------------+----------------------------------------------------------------
          covid_deaths_pc |   1.043495    .080035    13.04   0.000     .8825735    1.204416
                    p_pos |  -.0149957   .0080588    -1.86   0.069    -.0311991    .0012076
                          |
c.covid_deaths_pc#c.p_pos |   .0087223    .002634     3.31   0.002     .0034262    .0140183
                          |
                    _cons |   1.170439   .1772645     6.60   0.000     .8140244    1.526853
-------------------------------------------------------------------------------------------

. reg excess_deaths_pc c.covid_deaths_pc##c.p_pos c.covid_deaths_pc##c.end_week [aweight=population] 
> if days_to_report > 14, cluster(fips)
(sum of wgt is 3,469,330,012)
note: covid_deaths_pc omitted because of collinearity

Linear regression                               Number of obs     =        550
                                                F(5, 48)          =    3262.10
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9671
                                                Root MSE          =     1.1906

                                                  (Std. Err. adjusted for 49 clusters in fips)
----------------------------------------------------------------------------------------------
                             |               Robust
            excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
             covid_deaths_pc |   265.5126   44.30199     5.99   0.000     176.4374    354.5877
                       p_pos |  -.0003906   .0074593    -0.05   0.958    -.0153885    .0146074
                             |
   c.covid_deaths_pc#c.p_pos |   .0025333   .0013836     1.83   0.073    -.0002486    .0053152
                             |
             covid_deaths_pc |          0  (omitted)
                    end_week |   .0248475   .0050437     4.93   0.000     .0147065    .0349884
                             |
c.covid_deaths_pc#c.end_week |  -.0119992   .0020104    -5.97   0.000    -.0160415   -.0079569
                             |
                       _cons |  -546.3094   111.0625    -4.92   0.000    -769.6154   -323.0033
----------------------------------------------------------------------------------------------

. reg excess_respir_deaths_pc c.covid_deaths_pc##c.p_pos [aweight=population] if days_to_report > 14,
>  cluster(fips)
(sum of wgt is 3,469,330,012)

Linear regression                               Number of obs     =        550
                                                F(3, 48)          =   54881.17
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9974
                                                Root MSE          =     .25363

                                               (Std. Err. adjusted for 49 clusters in fips)
-------------------------------------------------------------------------------------------
                          |               Robust
  excess_respir_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------------+----------------------------------------------------------------
          covid_deaths_pc |   .9771158   .0136653    71.50   0.000       .94964    1.004592
                    p_pos |    .004228   .0017521     2.41   0.020     .0007053    .0077508
                          |
c.covid_deaths_pc#c.p_pos |   .0016638    .000386     4.31   0.000     .0008877    .0024399
                          |
                    _cons |   .0214353   .0320938     0.67   0.507    -.0430937    .0859643
-------------------------------------------------------------------------------------------

. reg excess_respir_deaths_pc c.covid_deaths_pc##c.p_pos c.covid_deaths_pc##c.end_week [aweight=popul
> ation] if days_to_report > 14, cluster(fips)
(sum of wgt is 3,469,330,012)
note: covid_deaths_pc omitted because of collinearity

Linear regression                               Number of obs     =        550
                                                F(5, 48)          >   99999.00
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9977
                                                Root MSE          =     .23771

                                                  (Std. Err. adjusted for 49 clusters in fips)
----------------------------------------------------------------------------------------------
                             |               Robust
     excess_respir_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
             covid_deaths_pc |   41.96104   9.272875     4.53   0.000     23.31668    60.60541
                       p_pos |   .0028154   .0019519     1.44   0.156     -.001109    .0067399
                             |
   c.covid_deaths_pc#c.p_pos |   .0003872   .0001801     2.15   0.037     .0000252    .0007493
                             |
             covid_deaths_pc |          0  (omitted)
                    end_week |  -.0005772   .0008901    -0.65   0.520    -.0023668    .0012124
                             |
c.covid_deaths_pc#c.end_week |  -.0018587    .000421    -4.41   0.000    -.0027052   -.0010121
                             |
                       _cons |   12.73888   19.60963     0.65   0.519    -26.68892    52.16667
----------------------------------------------------------------------------------------------

. reg excess_deaths_pc c.excess_respir_deaths_pc##c.p_pos [aweight=population] if days_to_report > 14
> , cluster(fips)
(sum of wgt is 3,469,330,012)

Linear regression                               Number of obs     =        550
                                                F(3, 48)          =    1153.20
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9678
                                                Root MSE          =     1.1768

                                                       (Std. Err. adjusted for 49 clusters in fips)
---------------------------------------------------------------------------------------------------
                                  |               Robust
                 excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------------------+----------------------------------------------------------------
          excess_respir_deaths_pc |   1.089866    .068632    15.88   0.000      .951872     1.22786
                            p_pos |  -.0208048   .0071181    -2.92   0.005    -.0351166    -.006493
                                  |
c.excess_respir_deaths_pc#c.p_pos |   .0061598   .0021802     2.83   0.007     .0017762    .0105434
                                  |
                            _cons |   1.127801   .1634334     6.90   0.000     .7991961    1.456406
---------------------------------------------------------------------------------------------------

. reg excess_deaths_pc c.excess_respir_deaths_pc##c.p_pos c.covid_deaths_pc##c.end_week [aweight=popu
> lation] if days_to_report > 14, cluster(fips)
(sum of wgt is 3,469,330,012)

Linear regression                               Number of obs     =        550
                                                F(6, 48)          =    1527.55
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9754
                                                Root MSE          =     1.0314

                                                       (Std. Err. adjusted for 49 clusters in fips)
---------------------------------------------------------------------------------------------------
                                  |               Robust
                 excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------------------+----------------------------------------------------------------
          excess_respir_deaths_pc |   2.474743   .3244024     7.63   0.000     1.822488    3.126998
                            p_pos |  -.0076317    .005625    -1.36   0.181    -.0189415    .0036782
                                  |
c.excess_respir_deaths_pc#c.p_pos |    .001555   .0014247     1.09   0.281    -.0013096    .0044197
                                  |
                  covid_deaths_pc |   158.2865   37.40614     4.23   0.000     83.07646    233.4966
                         end_week |   .0261617   .0039887     6.56   0.000     .0181418    .0341815
                                  |
     c.covid_deaths_pc#c.end_week |  -.0072459   .0016931    -4.28   0.000    -.0106501   -.0038418
                                  |
                            _cons |  -575.3166   87.82839    -6.55   0.000    -751.9074   -398.7258
---------------------------------------------------------------------------------------------------

. 
. reg f.adj_excess_deaths_pc c.new_pos_pc##c.p_pos [aweight=population] if days_to_report > 14, clust
> er(fips)
(sum of wgt is 3,469,330,012)

Linear regression                               Number of obs     =        550
                                                F(3, 48)          =     173.83
                                                Prob > F          =     0.0000
                                                R-squared         =     0.8052
                                                Root MSE          =     3.0277

                                          (Std. Err. adjusted for 49 clusters in fips)
--------------------------------------------------------------------------------------
F.                   |               Robust
adj_excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
          new_pos_pc |   .0399891   .0125194     3.19   0.002     .0148171     .065161
               p_pos |  -.0259657   .0208898    -1.24   0.220    -.0679675     .016036
                     |
c.new_pos_pc#c.p_pos |   .0017232   .0004859     3.55   0.001     .0007462    .0027003
                     |
               _cons |   1.824748   .4851714     3.76   0.000     .8492459    2.800251
--------------------------------------------------------------------------------------

. reg f.adj_excess_respir_deaths_pc c.new_pos_pc##c.p_pos [aweight=population] if days_to_report > 14
> , cluster(fips)
(sum of wgt is 3,469,330,012)

Linear regression                               Number of obs     =        550
                                                F(3, 48)          =     205.58
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9108
                                                Root MSE          =     1.5171

                                          (Std. Err. adjusted for 49 clusters in fips)
--------------------------------------------------------------------------------------
F.                   |               Robust
adj_excess_respir_~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
          new_pos_pc |    .034314   .0077511     4.43   0.000     .0187293    .0498987
               p_pos |   .0029337   .0108799     0.27   0.789    -.0189419    .0248093
                     |
c.new_pos_pc#c.p_pos |   .0012212   .0002861     4.27   0.000     .0006459    .0017965
                     |
               _cons |   .2342727   .2326809     1.01   0.319    -.2335637     .702109
--------------------------------------------------------------------------------------

. 
. restore

. 
. log close
      name:  <unnamed>
       log:  C:\Users\favero\Documents\GitHub\covid-underreporting\code\..\logs\cleandata.txt
  log type:  text
 closed on:  19 Jun 2020, 16:30:23
-----------------------------------------------------------------------------------------------------
