-----------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\favero\Documents\GitHub\covid-underreporting\code\..\logs\cleandata.txt
  log type:  text
 opened on:  20 May 2020, 10:06:14

. 
. use "..\data\population.dta" // start from this file because it has both fips codes and state names

. 
. merge 1:m fips using "..\data\covidtracking.dta", keep(2 3)

    Result                           # of obs.
    -----------------------------------------
    not matched                           315
        from master                         0  (_merge==1)
        from using                        315  (_merge==2)

    matched                             3,790  (_merge==3)
    -----------------------------------------

. drop _merge population // merge population back in later because want it merged to all observations
> , even those missing from the current dataset

. 
. merge 1:1 state date using "..\data\cdc_deaths.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                         3,872
        from master                     3,591  (_merge==1)
        from using                        281  (_merge==2)

    matched                               514  (_merge==3)
    -----------------------------------------

. drop _merge

. 
. merge 1:1 state date using "..\data\cdc_1920deaths.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                         6,494
        from master                     3,583  (_merge==1)
        from using                      2,911  (_merge==2)

    matched                               803  (_merge==3)
    -----------------------------------------

. drop _merge

. 
. append using "..\data\cdc_1418deaths.dta"

. 
. drop fips

. merge m:1 state using "..\data\population.dta", keep(1 3)

    Result                           # of obs.
    -----------------------------------------
    not matched                           662
        from master                       662  (_merge==1)
        from using                          0  (_merge==2)

    matched                            20,207  (_merge==3)
    -----------------------------------------

. drop _merge

. order date fips

. sort fips state date

. 
. drop if fips > 56
(662 observations deleted)

. 
. encode dataqualitygrade, gen(datagrade)

. order datagrade, after(dataqualitygrade)

. drop dataqualitygrade

. 
. gen end_week = date + mod(6 - dow(date), 7)

. format end_week %tdCCYYNNDD

. order end_week, after(date)

. 
. rename septicemiaa40a41 septicemia

. rename malignantneoplasmsc00c97 malignantneoplasms

. rename diabetesmellituse10e14 diabetesmellitus

. rename alzheimerdiseaseg30 alzheimerdisease

. rename influenzaandpneumoniaj10j18 influenzaandpneumonia

. rename chroniclowerrespiratorydiseasesj chroniclowerresp

. rename otherdiseasesofrespiratorysystem otherrespiratory

. rename nephritisnephroticsyndromeandnep nephritis

. rename symptomssignsandabnormalclinical symptomssignsandabnormal

. rename diseasesofhearti00i09i11i13i20i5 diseasesofheart

. rename cerebrovasculardiseasesi60i69 cerebrovasculardiseases

. 
. foreach var of varlist positive-datagrade death-pneumon_influ_or_covid allcause-mmwrweek {
  2.         gen `var'_mis = (`var'==.)
  3. }

. gen dayscollapsed = 1

. collapse (firstnm) state report_date (lastnm) positive-datagrade population death-posneg (sum) deat
> hincrease-pneumon_influ_or_covid allcause-mmwrweek *_mis dayscollapsed, by(end_week fips)

. foreach var of varlist positive-datagrade {
  2.         replace `var' = . if `var'_mis > 0
  3. }
(0 real changes made)
(16 real changes made, 16 to missing)
(51 real changes made, 51 to missing)
(49 real changes made, 49 to missing)
(47 real changes made, 47 to missing)
(32 real changes made, 32 to missing)
(18 real changes made, 18 to missing)
(27 real changes made, 27 to missing)
(12 real changes made, 12 to missing)
(43 real changes made, 43 to missing)
(52 real changes made, 52 to missing)

. foreach var of varlist death-pneumon_influ_or_covid allcause-mmwrweek {
  2.         replace `var' = . if `var'_mis == dayscollapsed
  3. }
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(16,431 real changes made, 16,431 to missing)
(16,431 real changes made, 16,431 to missing)
(16,431 real changes made, 16,431 to missing)
(16,431 real changes made, 16,431 to missing)
(16,431 real changes made, 16,431 to missing)
(16,269 real changes made, 16,269 to missing)
(16,269 real changes made, 16,269 to missing)
(16,269 real changes made, 16,269 to missing)
(16,269 real changes made, 16,269 to missing)
(16,269 real changes made, 16,269 to missing)
(16,269 real changes made, 16,269 to missing)
(16,269 real changes made, 16,269 to missing)
(80 real changes made, 80 to missing)
(80 real changes made, 80 to missing)
(80 real changes made, 80 to missing)
(80 real changes made, 80 to missing)
(80 real changes made, 80 to missing)
(80 real changes made, 80 to missing)
(80 real changes made, 80 to missing)
(80 real changes made, 80 to missing)
(80 real changes made, 80 to missing)
(80 real changes made, 80 to missing)
(80 real changes made, 80 to missing)
(80 real changes made, 80 to missing)
(80 real changes made, 80 to missing)
(80 real changes made, 80 to missing)
(80 real changes made, 80 to missing)

. drop *_mis

. 
. xtset fips end_week, delta(7)
       panel variable:  fips (strongly balanced)
        time variable:  end_week, 20140104 to 20200523
                delta:  7 days

. 
. gen new_pos = d.positive if d.positive>=0
(16,468 missing values generated)

. gen new_neg = d.negative if d.negative>=0
(16,510 missing values generated)

. gen p_pos = new_pos/(new_pos+new_neg)*100
(16,511 missing values generated)

. order new_pos-p_pos, after(negative)

. 
. // adjust expected deaths for reporting lag: https://www.cdc.gov/nchs/data/vsrr/report001.pdf
. // maybe also somehow adjust for how the individual state was doing relative to expectations pre-co
> vid
. gen days_to_report = report_date - end_week
(16,269 missing values generated)

. 
. drop if fips == 9 | fips == 37 // Connecticut and North Carolina's data look highly problematic, so
>  dropping them
(668 observations deleted)

. 
. /*
> gen allcause_minus_posscovid = total_deaths - pneumon_influ_or_covid
> gen allcause_minus_posscovid_pc  = allcause_minus_posscovid*1000000/population
> bys days_to_report: sum allcause_minus_posscovid_pc
> gen adj_allcause_minus_posscovid_pc = allcause_minus_posscovid_pc
> replace adj_allcause_minus_posscovid_pc = allcause_minus_posscovid_pc * 212 / 93 if days_to_report 
> <= 7 & days_to_report != .
> replace adj_allcause_minus_posscovid_pc = allcause_minus_posscovid_pc * 212 / 159 if days_to_report
>  > 7 & days_to_report <= 14
> replace adj_allcause_minus_posscovid_pc = allcause_minus_posscovid_pc * 212 / 192 if days_to_report
>  > 14 & days_to_report <= 21
> */
. 
. gen adj_expected_deaths = expected_deaths
(15,631 missing values generated)

. replace adj_expected_deaths = expected_deaths * 93 / 212 if days_to_report <= 7 & days_to_report !=
>  .
(49 real changes made)

. replace adj_expected_deaths = expected_deaths * 159 / 212 if days_to_report > 7 & days_to_report <=
>  14
(49 real changes made)

. replace adj_expected_deaths = expected_deaths * 192 / 212 if days_to_report > 14 & days_to_report <
> = 21
(49 real changes made)

. 
. 
. gen pneumon_or_influ = pneumon_influ_or_covid- covid_deaths
(15,631 missing values generated)

. reg pneumon_or_influ influenzaandpneumonia if total_deaths== allcause, nocons

      Source |       SS           df       MS      Number of obs   =       330
-------------+----------------------------------   F(1, 329)       =   5351.69
       Model |  3900815.01         1  3900815.01   Prob > F        =    0.0000
    Residual |  239805.994       329  728.893599   R-squared       =    0.9421
-------------+----------------------------------   Adj R-squared   =    0.9419
       Total |     4140621       330  12547.3364   Root MSE        =    26.998

---------------------------------------------------------------------------------------
     pneumon_or_influ |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
influenzaandpneumonia |    2.85868   .0390769    73.16   0.000     2.781808    2.935552
---------------------------------------------------------------------------------------

. 
. egen expected_influ_pneu_deaths = mean(2.85868*influenzaandpneumonia) if mmwrweek != ., by(fips mmw
> rweek)
(72 missing values generated)

. gen adj_expected_influ_pneu_deaths = expected_influ_pneu_deaths
(72 missing values generated)

. replace adj_expected_influ_pneu_deaths = expected_influ_pneu_deaths * 93 / 212 if days_to_report <=
>  7 & days_to_report != .
(47 real changes made)

. replace adj_expected_influ_pneu_deaths = expected_influ_pneu_deaths * 159 / 212 if days_to_report >
>  7 & days_to_report <= 14
(49 real changes made)

. replace adj_expected_influ_pneu_deaths = expected_influ_pneu_deaths * 192 / 212 if days_to_report >
>  14 & days_to_report <= 21
(49 real changes made)

. 
. 
. replace covid_deaths = 5 if covid_deaths == . & total_deaths != . //rough imputation for where data
>  is supressed for 1-9 deaths
(0 real changes made)

. 
. 
. gen cumulative_covdeath = covid_deaths
(15,631 missing values generated)

. replace cumulative_covdeath = cumulative_covdeath + l.cumulative_covdeath if l.cumulative_covdeath 
> != .
(360 real changes made)

. 
. gen adj_covid_deaths = covid_deaths
(15,631 missing values generated)

. replace adj_covid_deaths = covid_deaths * 212 / 93 if days_to_report <= 7 & days_to_report != .
(41 real changes made)

. replace adj_covid_deaths = covid_deaths * 212 / 159 if days_to_report > 7 & days_to_report <= 14
(47 real changes made)

. replace adj_covid_deaths = covid_deaths * 212 / 192 if days_to_report > 14 & days_to_report <= 21
(48 real changes made)

. 
. gen adj_cumulative_covdeath = adj_covid_deaths
(15,631 missing values generated)

. replace adj_cumulative_covdeath = adj_cumulative_covdeath + l.adj_cumulative_covdeath if l.adj_cumu
> lative_covdeath != .
(360 real changes made)

. 
. gen covdeath_pc = covid_deaths*1000000/population
(15,631 missing values generated)

. gen excess_deaths_pc = (total_deaths-adj_expected_deaths)*1000000/population
(15,631 missing values generated)

. gen excess_respir_deaths_pc = (pneumon_influ_or_covid-adj_expected_influ_pneu_deaths)*1000000/popul
> ation
(15,633 missing values generated)

. gen new_pos_pc = new_pos*1000000/population
(15,822 missing values generated)

. gen new_neg_pc = new_neg*1000000/population
(15,861 missing values generated)

. gen new_tests_pc = new_pos_pc + new_neg_pc
(15,861 missing values generated)

. gen deathincrease_pc = deathincrease*1000000/population
(15,786 missing values generated)

. gen adj_covid_deaths_pc = adj_covid_deaths*1000000/population
(15,631 missing values generated)

. 
. gen log_covdeath = log(covid_deaths)
(15,978 missing values generated)

.         //replace log_covdeath = 2 if covid_deaths==0
. gen log_allcause = log(total_deaths)
(15,633 missing values generated)

. gen log_expected = log(adj_expected_deaths)
(15,631 missing values generated)

. gen excess_deaths = log_allcause-log_expected
(15,633 missing values generated)

. 
. save "..\data\weeklydata.dta", replace
file ..\data\weeklydata.dta saved

. 
. 
. reg excess_deaths_pc covdeath_pc [aweight=population] if days_to_report > 14, cluster(fips) nocons
(sum of wgt is 4,084,419,976)

Linear regression                               Number of obs     =        637
                                                F(1, 48)          =    4915.76
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9282
                                                Root MSE          =     16.362

                                  (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
excess_dea~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 covdeath_pc |   1.404445   .0200313    70.11   0.000     1.364169    1.444721
------------------------------------------------------------------------------

. margins, dydx(covdeath_pc)

Average marginal effects                        Number of obs     =        637
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : covdeath_pc

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 covdeath_pc |   1.404445   .0200313    70.11   0.000     1.364169    1.444721
------------------------------------------------------------------------------

. 
. twoway (scatter excess_deaths_pc covdeath_pc if days_to_report > 14, mcolor(%30) yline(0)) (functio
> n y=x, range(0 300))

. 
. reg excess_deaths_pc covdeath_pc [aweight=population] if days_to_report > 14, cluster(fips)
(sum of wgt is 4,084,419,976)

Linear regression                               Number of obs     =        637
                                                F(1, 48)          =    5149.52
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9242
                                                Root MSE          =     16.254

                                  (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
excess_dea~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 covdeath_pc |   1.419227   .0197774    71.76   0.000     1.379462    1.458992
       _cons |  -2.072732   2.264179    -0.92   0.365    -6.625169    2.479706
------------------------------------------------------------------------------

. reg excess_deaths_pc c.covdeath_pc c.p_pos [aweight=population] if days_to_report > 14, cluster(fip
> s)
(sum of wgt is 1,940,339,082)

Linear regression                               Number of obs     =        309
                                                F(2, 48)          =    3425.65
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9603
                                                Root MSE          =     15.858

                                  (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
excess_dea~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 covdeath_pc |   1.397707   .0223279    62.60   0.000     1.352814      1.4426
       p_pos |   .1451277   .1429138     1.02   0.315    -.1422198    .4324751
       _cons |  -3.357612   2.242676    -1.50   0.141    -7.866814     1.15159
------------------------------------------------------------------------------

. reg excess_deaths_pc c.covdeath_pc##c.p_pos [aweight=population] if days_to_report > 14, cluster(fi
> ps)
(sum of wgt is 1,940,339,082)

Linear regression                               Number of obs     =        309
                                                F(3, 48)          =    4033.91
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9661
                                                Root MSE          =     14.674

                                           (Std. Err. adjusted for 49 clusters in fips)
---------------------------------------------------------------------------------------
                      |               Robust
     excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
          covdeath_pc |   .9630227   .1284443     7.50   0.000     .7047682    1.221277
                p_pos |   .0229218   .1084014     0.21   0.833    -.1950339    .2408775
                      |
c.covdeath_pc#c.p_pos |    .010894   .0033992     3.20   0.002     .0040596    .0177285
                      |
                _cons |   1.213287   1.949726     0.62   0.537    -2.706899    5.133474
---------------------------------------------------------------------------------------

. reg excess_deaths_pc c.covdeath_pc c.new_pos_pc c.new_neg_pc [aweight=population] if days_to_report
>  > 14, cluster(fips)
(sum of wgt is 1,940,339,082)

Linear regression                               Number of obs     =        309
                                                F(3, 48)          =    5371.78
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9657
                                                Root MSE          =     14.771

                                  (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
excess_dea~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 covdeath_pc |   1.201468   .0798247    15.05   0.000     1.040969    1.361966
  new_pos_pc |   .0217014    .008367     2.59   0.013     .0048784    .0385244
  new_neg_pc |  -.0036493   .0013563    -2.69   0.010    -.0063764   -.0009222
       _cons |   1.904077   2.218603     0.86   0.395    -2.556723    6.364877
------------------------------------------------------------------------------

. reg excess_deaths_pc c.covdeath_pc##c.new_pos_pc c.covdeath_pc##c.new_neg_pc [aweight=population] i
> f days_to_report > 14, cluster(fips)
(sum of wgt is 1,940,339,082)
note: covdeath_pc omitted because of collinearity

Linear regression                               Number of obs     =        309
                                                F(5, 48)          =    4297.28
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9699
                                                Root MSE          =     13.883

                                                (Std. Err. adjusted for 49 clusters in fips)
--------------------------------------------------------------------------------------------
                           |               Robust
          excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------------+----------------------------------------------------------------
               covdeath_pc |   1.161211   .1802982     6.44   0.000     .7986973    1.523725
                new_pos_pc |   .0189666    .007216     2.63   0.011     .0044578    .0334754
                           |
c.covdeath_pc#c.new_pos_pc |    .000102   .0000365     2.79   0.007     .0000286    .0001754
                           |
               covdeath_pc |          0  (omitted)
                new_neg_pc |  -.0015328   .0009864    -1.55   0.127     -.003516    .0004505
                           |
c.covdeath_pc#c.new_neg_pc |  -.0000573   .0000131    -4.39   0.000    -.0000836    -.000031
                           |
                     _cons |    .310216   2.177995     0.14   0.887    -4.068936    4.689368
--------------------------------------------------------------------------------------------

. reg excess_deaths_pc c.covdeath_pc c.new_tests_pc [aweight=population] if days_to_report > 14, clus
> ter(fips)
(sum of wgt is 1,940,339,082)

Linear regression                               Number of obs     =        309
                                                F(2, 48)          =    4394.70
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9612
                                                Root MSE          =     15.677

                                  (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
excess_dea~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 covdeath_pc |   1.462679   .0243588    60.05   0.000     1.413702    1.511655
new_tests_pc |  -.0018312   .0007571    -2.42   0.019    -.0033533    -.000309
       _cons |   2.076708   2.125387     0.98   0.333    -2.196668    6.350085
------------------------------------------------------------------------------

. reg excess_deaths_pc c.covdeath_pc##c.new_tests_pc [aweight=population] if days_to_report > 14, clu
> ster(fips)
(sum of wgt is 1,940,339,082)

Linear regression                               Number of obs     =        309
                                                F(3, 48)          =    4357.30
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9630
                                                Root MSE          =     15.338

                                                  (Std. Err. adjusted for 49 clusters in fips)
----------------------------------------------------------------------------------------------
                             |               Robust
            excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                 covdeath_pc |   1.701272   .1448764    11.74   0.000     1.409979    1.992565
                new_tests_pc |  -.0014435   .0007179    -2.01   0.050    -.0028871   -3.23e-08
                             |
c.covdeath_pc#c.new_tests_pc |  -.0000337   .0000178    -1.89   0.065    -.0000694    2.11e-06
                             |
                       _cons |  -.2835554   2.348929    -0.12   0.904    -5.006393    4.439282
----------------------------------------------------------------------------------------------

. reg excess_deaths_pc c.covdeath_pc##c.new_tests_pc c.covdeath_pc##c.p_pos [aweight=population] if d
> ays_to_report > 14, cluster(fips)
(sum of wgt is 1,940,339,082)
note: covdeath_pc omitted because of collinearity

Linear regression                               Number of obs     =        309
                                                F(5, 48)          =    5154.80
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9664
                                                Root MSE          =     14.657

                                                  (Std. Err. adjusted for 49 clusters in fips)
----------------------------------------------------------------------------------------------
                             |               Robust
            excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
                 covdeath_pc |    1.12759   .2269862     4.97   0.000     .6712033    1.583976
                new_tests_pc |   -.000143   .0012232    -0.12   0.907    -.0026025    .0023164
                             |
c.covdeath_pc#c.new_tests_pc |   -.000015   .0000138    -1.09   0.280    -.0000427    .0000126
                             |
                 covdeath_pc |          0  (omitted)
                       p_pos |  -.0004038   .1207811    -0.00   0.997    -.2432505    .2424429
                             |
       c.covdeath_pc#c.p_pos |   .0097527   .0042912     2.27   0.028     .0011246    .0183808
                             |
                       _cons |   .7722906   2.724301     0.28   0.778    -4.705284    6.249866
----------------------------------------------------------------------------------------------

. reg excess_deaths_pc c.covdeath_pc##c.new_tests_pc##c.p_pos [aweight=population] if days_to_report 
> > 14, cluster(fips)
(sum of wgt is 1,940,339,082)

Linear regression                               Number of obs     =        309
                                                F(7, 48)          =    9339.37
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9703
                                                Root MSE          =     13.838

                                                   (Std. Err. adjusted for 49 clusters in fips)
-----------------------------------------------------------------------------------------------
                              |               Robust
             excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                  covdeath_pc |   1.338669   .2947187     4.54   0.000     .7460973     1.93124
                 new_tests_pc |  -.0020782   .0010349    -2.01   0.050    -.0041591    2.69e-06
                              |
 c.covdeath_pc#c.new_tests_pc |   -.000083   .0000271    -3.06   0.004    -.0001375   -.0000284
                              |
                        p_pos |  -.1040148   .0979258    -1.06   0.293    -.3009079    .0928783
                              |
        c.covdeath_pc#c.p_pos |  -.0051222   .0053624    -0.96   0.344     -.015904    .0056597
                              |
       c.new_tests_pc#c.p_pos |   .0002414   .0000754     3.20   0.002     .0000897     .000393
                              |
 c.covdeath_pc#c.new_tests_pc#|
                      c.p_pos |   2.29e-06   6.10e-07     3.76   0.000     1.07e-06    3.52e-06
                              |
                        _cons |   1.621569   2.009815     0.81   0.424    -2.419436    5.662574
-----------------------------------------------------------------------------------------------

. 
. reghv excess_deaths_pc covdeath_pc if days_to_report > 14, var( p_pos population) twostage cluster(
> fips)

Multiplicative heteroscedastic regression             Number of obs  =     309
Estimator: 2sls                                       Model chi2(3)  = 543.325
                                                      Prob > chi2    =   0.000
Log Likelihood              = -1422.264               Pseudo R2      =  0.1604
                                                      VWLS R2        =  0.8091
                                  (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
excess_dea~c |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
lp_mean      |
 covdeath_pc |   1.411778   .0390103    36.19   0.000     1.335319    1.488236
       _cons |  -5.905129   2.282672    -2.59   0.010    -10.37908   -1.431174
-------------+----------------------------------------------------------------
lp_lnvar     |
       p_pos |   .0185465   .0465606     0.40   0.690    -.0727107    .1098036
  population |  -1.48e-08   1.11e-07    -0.13   0.894    -2.32e-07    2.03e-07
       _cons |   5.463095   2.300984     2.37   0.018      .953249     9.97294
------------------------------------------------------------------------------

. reghv excess_deaths_pc covdeath_pc if days_to_report > 14, var( p_pos population) cluster(fips)

iteration 1:  Log-likelihood =     -1398  |delta-b|     1.655 
iteration 2:  Log-likelihood =     -1375  |delta-b|     4.387 
iteration 3:  Log-likelihood =     -1373  |delta-b|     1.053 
iteration 4:  Log-likelihood =     -1373  |delta-b|      .282 
iteration 5:  Log-likelihood =     -1373  |delta-b|    .05764 
iteration 6:  Log-likelihood =     -1373  |delta-b|    .04219 
iteration 7:  Log-likelihood =     -1373  |delta-b|    .02079 
iteration 8:  Log-likelihood =     -1373  |delta-b|    .01171 
iteration 9:  Log-likelihood =     -1373  |delta-b|   .006318 
iteration 10:  Log-likelihood =     -1373  |delta-b|   .003465 
iteration 11:  Log-likelihood =     -1373  |delta-b|   .001891 
iteration 12:  Log-likelihood =     -1373  |delta-b|   .001035 

Multiplicative heteroscedastic regression             Number of obs  =     309
Estimator: mle                                        Model chi2(3)  = 641.266
                                                      Prob > chi2    =   0.000
Log Likelihood              = -1373.293               Pseudo R2      =  0.1893
                                                      VWLS R2        =  0.9180
                                  (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
excess_dea~c |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
lp_mean      |
 covdeath_pc |   1.397901   .0228038    61.30   0.000     1.353207    1.442596
       _cons |  -1.757103   1.953242    -0.90   0.368    -5.585386    2.071181
-------------+----------------------------------------------------------------
lp_lnvar     |
       p_pos |   .0108652    .013215     0.82   0.411    -.0150357    .0367661
  population |  -8.77e-08   2.80e-08    -3.13   0.002    -1.43e-07   -3.27e-08
       _cons |   6.446039   .4640283    13.89   0.000      5.53656    7.355518
------------------------------------------------------------------------------

. 
. 
. 
. reg deathincrease_pc adj_covid_deaths_pc [aweight=population] if days_to_report > 7, cluster(fips)
(sum of wgt is 2,825,187,438)

Linear regression                               Number of obs     =        432
                                                F(1, 48)          =     999.70
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9155
                                                Root MSE          =     12.852

                                         (Std. Err. adjusted for 49 clusters in fips)
-------------------------------------------------------------------------------------
                    |               Robust
   deathincrease_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
adj_covid_deaths_pc |   .8657424   .0273813    31.62   0.000     .8106887    .9207962
              _cons |   1.868962   .4770991     3.92   0.000     .9096902    2.828234
-------------------------------------------------------------------------------------

. reg deathincrease_pc adj_covid_deaths_pc l.adj_covid_deaths_pc [aweight=population] if days_to_repo
> rt > 7, cluster(fips)
(sum of wgt is 2,817,572,545)

Linear regression                               Number of obs     =        431
                                                F(2, 48)          =    1488.86
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9453
                                                Root MSE          =      10.36

                                         (Std. Err. adjusted for 49 clusters in fips)
-------------------------------------------------------------------------------------
                    |               Robust
   deathincrease_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
adj_covid_deaths_pc |
                --. |   .5571477   .1383976     4.03   0.000     .2788807    .8354147
                L1. |   .3533735   .1859327     1.90   0.063    -.0204693    .7272162
                    |
              _cons |   1.988536   .4541072     4.38   0.000     1.075493     2.90158
-------------------------------------------------------------------------------------

. reg deathincrease_pc c.adj_covid_deaths_pc##c.p_pos [aweight=population] if days_to_report > 7, clu
> ster(fips)
(sum of wgt is 2,254,525,234)

Linear regression                               Number of obs     =        358
                                                F(3, 48)          =     526.36
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9183
                                                Root MSE          =     13.799

                                                   (Std. Err. adjusted for 49 clusters in fips)
-----------------------------------------------------------------------------------------------
                              |               Robust
             deathincrease_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
          adj_covid_deaths_pc |   1.084867   .0608527    17.83   0.000     .9625142    1.207219
                        p_pos |   .0418143   .0694564     0.60   0.550    -.0978372    .1814658
                              |
c.adj_covid_deaths_pc#c.p_pos |  -.0058012   .0015085    -3.85   0.000    -.0088342   -.0027681
                              |
                        _cons |   .2388712    .618623     0.39   0.701    -1.004954    1.482696
-----------------------------------------------------------------------------------------------

. reg deathincrease_pc c.adj_covid_deaths_pc##c.new_tests_pc [aweight=population] if days_to_report >
>  7, cluster(fips)
(sum of wgt is 2,254,525,234)

Linear regression                               Number of obs     =        358
                                                F(3, 48)          =    2867.39
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9191
                                                Root MSE          =     13.727

                                            (Std. Err. adjusted for 49 clusters in fips)
----------------------------------------------------------------------------------------
                       |               Robust
      deathincrease_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------+----------------------------------------------------------------
   adj_covid_deaths_pc |   .8965252   .0862197    10.40   0.000     .7231689    1.069881
          new_tests_pc |   .0021705   .0005576     3.89   0.000     .0010494    .0032915
                       |
 c.adj_covid_deaths_pc#|
        c.new_tests_pc |  -.0000125   .0000104    -1.20   0.236    -.0000334    8.43e-06
                       |
                 _cons |  -2.859639   1.046701    -2.73   0.009    -4.964173    -.755106
----------------------------------------------------------------------------------------

. reg deathincrease_pc c.adj_covid_deaths_pc##c.new_tests_pc c.l.adj_covid_deaths_pc##c.new_tests_pc 
> [aweight=population] if days_to_report > 7, cluster(fips)
(sum of wgt is 2,254,525,234)
note: new_tests_pc omitted because of collinearity

Linear regression                               Number of obs     =        358
                                                F(5, 48)          =    7292.22
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9694
                                                Root MSE          =     8.4722

                                             (Std. Err. adjusted for 49 clusters in fips)
-----------------------------------------------------------------------------------------
                        |               Robust
       deathincrease_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
    adj_covid_deaths_pc |  -.2469868   .2769078    -0.89   0.377    -.8037473    .3097737
           new_tests_pc |   .0017497   .0004874     3.59   0.001     .0007697    .0027298
                        |
  c.adj_covid_deaths_pc#|
         c.new_tests_pc |   .0001096   .0000321     3.41   0.001      .000045    .0001741
                        |
    adj_covid_deaths_pc |
                    L1. |   1.491845   .2803392     5.32   0.000     .9281849    2.055504
                        |
           new_tests_pc |          0  (omitted)
                        |
 cL.adj_covid_deaths_pc#|
         c.new_tests_pc |  -.0001572   .0000319    -4.93   0.000    -.0002214   -.0000931
                        |
                  _cons |  -1.735136   .8243254    -2.10   0.041    -3.392553   -.0777187
-----------------------------------------------------------------------------------------

. reg deathincrease_pc c.excess_deaths_pc##c.new_tests_pc c.l.excess_deaths_pc##c.new_tests_pc [aweig
> ht=population] if days_to_report > 7, cluster(fips)
(sum of wgt is 2,254,525,234)
note: new_tests_pc omitted because of collinearity

Linear regression                               Number of obs     =        358
                                                F(5, 48)          =     858.74
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9317
                                                Root MSE          =     12.652

                                                        (Std. Err. adjusted for 49 clusters in fips)
----------------------------------------------------------------------------------------------------
                                   |               Robust
                  deathincrease_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------------------+----------------------------------------------------------------
                  excess_deaths_pc |  -.1028886   .1428455    -0.72   0.475    -.3900988    .1843216
                      new_tests_pc |   .0035568   .0008128     4.38   0.000     .0019226    .0051909
                                   |
 c.excess_deaths_pc#c.new_tests_pc |   .0000481   .0000187     2.57   0.013     .0000105    .0000857
                                   |
                  excess_deaths_pc |
                               L1. |     .76294   .1897293     4.02   0.000     .3814637    1.144416
                                   |
                      new_tests_pc |          0  (omitted)
                                   |
cL.excess_deaths_pc#c.new_tests_pc |  -.0000593    .000023    -2.59   0.013    -.0001055   -.0000132
                                   |
                             _cons |  -2.913056   1.990593    -1.46   0.150    -6.915411      1.0893
----------------------------------------------------------------------------------------------------

. 
. 
. reg excess_deaths_pc covdeath_pc [aweight=population] if days_to_report > 14, cluster(fips)
(sum of wgt is 4,084,419,976)

Linear regression                               Number of obs     =        637
                                                F(1, 48)          =    5149.52
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9242
                                                Root MSE          =     16.254

                                  (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
excess_dea~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 covdeath_pc |   1.419227   .0197774    71.76   0.000     1.379462    1.458992
       _cons |  -2.072732   2.264179    -0.92   0.365    -6.625169    2.479706
------------------------------------------------------------------------------

. reg excess_respir_deaths_pc covdeath_pc [aweight=population] if days_to_report > 14, cluster(fips)
(sum of wgt is 4,084,419,976)

Linear regression                               Number of obs     =        637
                                                F(1, 48)          =   21763.90
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9928
                                                Root MSE          =     3.5767

                                  (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
excess_res~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 covdeath_pc |   1.047741   .0071021   147.53   0.000     1.033462    1.062021
       _cons |    .943114    .488296     1.93   0.059     -.038671    1.924899
------------------------------------------------------------------------------

. 
. reg excess_deaths_pc c.covdeath_pc##c.p_pos [aweight=population] if days_to_report > 14, cluster(fi
> ps)
(sum of wgt is 1,940,339,082)

Linear regression                               Number of obs     =        309
                                                F(3, 48)          =    4033.91
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9661
                                                Root MSE          =     14.674

                                           (Std. Err. adjusted for 49 clusters in fips)
---------------------------------------------------------------------------------------
                      |               Robust
     excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
          covdeath_pc |   .9630227   .1284443     7.50   0.000     .7047682    1.221277
                p_pos |   .0229218   .1084014     0.21   0.833    -.1950339    .2408775
                      |
c.covdeath_pc#c.p_pos |    .010894   .0033992     3.20   0.002     .0040596    .0177285
                      |
                _cons |   1.213287   1.949726     0.62   0.537    -2.706899    5.133474
---------------------------------------------------------------------------------------

. reg excess_respir_deaths_pc c.covdeath_pc##c.p_pos [aweight=population] if days_to_report > 14, clu
> ster(fips)
(sum of wgt is 1,940,339,082)

Linear regression                               Number of obs     =        309
                                                F(3, 48)          =   83563.31
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9969
                                                Root MSE          =     3.2126

                                           (Std. Err. adjusted for 49 clusters in fips)
---------------------------------------------------------------------------------------
                      |               Robust
excess_respir_death~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
          covdeath_pc |   .9469161   .0210054    45.08   0.000      .904682    .9891503
                p_pos |   .0093965    .017559     0.54   0.595    -.0259083    .0447013
                      |
c.covdeath_pc#c.p_pos |   .0021927   .0004564     4.80   0.000      .001275    .0031104
                      |
                _cons |   2.699174   .5986245     4.51   0.000     1.495559    3.902789
---------------------------------------------------------------------------------------

. 
. reg f.excess_deaths_pc c.new_pos_pc##c.p_pos [aweight=population] if days_to_report > 14, cluster(f
> ips)
(sum of wgt is 1,940,339,082)

Linear regression                               Number of obs     =        309
                                                F(3, 48)          =     147.17
                                                Prob > F          =     0.0000
                                                R-squared         =     0.8083
                                                Root MSE          =     35.308

                                          (Std. Err. adjusted for 49 clusters in fips)
--------------------------------------------------------------------------------------
                     |               Robust
  F.excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
          new_pos_pc |   .0229593   .0282025     0.81   0.420    -.0337455    .0796642
               p_pos |   .2381199   .2186037     1.09   0.281    -.2014123    .6776522
                     |
c.new_pos_pc#c.p_pos |   .0017811   .0009106     1.96   0.056    -.0000498     .003612
                     |
               _cons |   2.062423   5.654768     0.36   0.717    -9.307249     13.4321
--------------------------------------------------------------------------------------

. reg f.excess_respir_deaths_pc c.new_pos_pc##c.p_pos [aweight=population] if days_to_report > 14, cl
> uster(fips)
(sum of wgt is 1,940,339,082)

Linear regression                               Number of obs     =        309
                                                F(3, 48)          =     228.58
                                                Prob > F          =     0.0000
                                                R-squared         =     0.8693
                                                Root MSE          =     20.775

                                          (Std. Err. adjusted for 49 clusters in fips)
--------------------------------------------------------------------------------------
F.                   |               Robust
excess_respir_deat~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
          new_pos_pc |    .022009   .0206037     1.07   0.291    -.0194175    .0634356
               p_pos |   .0851554   .1077467     0.79   0.433    -.1314838    .3017946
                     |
c.new_pos_pc#c.p_pos |   .0012264   .0006652     1.84   0.071    -.0001111    .0025639
                     |
               _cons |    5.04907   3.768584     1.34   0.187    -2.528177    12.62632
--------------------------------------------------------------------------------------

. 
. 
. log close
      name:  <unnamed>
       log:  C:\Users\favero\Documents\GitHub\covid-underreporting\code\..\logs\cleandata.txt
  log type:  text
 closed on:  20 May 2020, 10:06:26
-----------------------------------------------------------------------------------------------------
