-------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\favero\Documents\GitHub\covid-underreporting\code\..\logs\deaths_to_hospitalizations.txt
  log type:  text
 opened on:  11 Jul 2020, 10:18:45

. 
. use "..\data\covidtracking.dta"

. 
. drop if state == "NJ" & date == date("2020/06/25", "YMD") // highly unusual datapoint; I'm guessing NJ must have reported a b
> unch of backlogged deaths in batch (adding probable deaths to their reporting?); at any rate, getting dropping because this d
> ata point doesn't appear to be present in graph I'm reproducing
(1 observation deleted)

. 
. preserve

. 
. *** Reproduce the original (misleading) graph created by someone else (https://bit.ly/3eh5QXS) ***
. 
. codebook state if date == date("2020/03/17", "YMD") & deathincrease > 0 & deathincrease != .

-------------------------------------------------------------------------------------------------------------------------------
state                                                                                                               (unlabeled)
-------------------------------------------------------------------------------------------------------------------------------

                  type:  string (str2)

         unique values:  9                        missing "":  0/9

            tabulation:  Freq.  Value
                             1  "CA"
                             1  "FL"
                             1  "IL"
                             1  "IN"
                             1  "LA"
                             1  "MI"
                             1  "NJ"
                             1  "TX"
                             1  "WA"

. codebook state if date == date("2020/03/18", "YMD") & deathincrease > 0 & deathincrease != .

-------------------------------------------------------------------------------------------------------------------------------
state                                                                                                               (unlabeled)
-------------------------------------------------------------------------------------------------------------------------------

                  type:  string (str2)

         unique values:  15                       missing "":  0/15

              examples:  "FL"
                         "MD"
                         "NV"
                         "PA"

. codebook state if date == date("2020/03/19", "YMD") & deathincrease > 0 & deathincrease != .

-------------------------------------------------------------------------------------------------------------------------------
state                                                                                                               (unlabeled)
-------------------------------------------------------------------------------------------------------------------------------

                  type:  string (str2)

         unique values:  15                       missing "":  0/15

              examples:  "FL"
                         "LA"
                         "MO"
                         "OK"

. codebook state if date == date("2020/03/20", "YMD") & deathincrease > 0 & deathincrease != .

-------------------------------------------------------------------------------------------------------------------------------
state                                                                                                               (unlabeled)
-------------------------------------------------------------------------------------------------------------------------------

                  type:  string (str2)

         unique values:  19                       missing "":  0/19

              examples:  "CT"
                         "IL"
                         "MI"
                         "OH"

. codebook state if date == date("2020/03/21", "YMD") & deathincrease > 0 & deathincrease != .

-------------------------------------------------------------------------------------------------------------------------------
state                                                                                                               (unlabeled)
-------------------------------------------------------------------------------------------------------------------------------

                  type:  string (str2)

         unique values:  22                       missing "":  0/22

              examples:  "CT"
                         "IN"
                         "MI"
                         "NV"

. codebook state if date == date("2020/03/22", "YMD") & deathincrease > 0 & deathincrease != .

-------------------------------------------------------------------------------------------------------------------------------
state                                                                                                               (unlabeled)
-------------------------------------------------------------------------------------------------------------------------------

                  type:  string (str2)

         unique values:  24                       missing "":  0/24

              examples:  "CT"
                         "IN"
                         "MI"
                         "OR"

. 
. codebook state if date >= date("2020/03/17", "YMD") & date <=date("2020/03/21", "YMD") & deathincrease > 0 & deathincrease !=
>  .

-------------------------------------------------------------------------------------------------------------------------------
state                                                                                                               (unlabeled)
-------------------------------------------------------------------------------------------------------------------------------

                  type:  string (str2)

         unique values:  31                       missing "":  0/80

              examples:  "FL"
                         "LA"
                         "MO"
                         "OR"

. 
. 
. // Commented out because original graph kept these observations
. //keep if hospitalizedcurrently != .
. 
. collapse (sum) hospitalizedcurrently deathincrease, by(date)

. 
. replace hospitalizedcurrently = . if hospitalizedcurrently == 0
(55 real changes made, 55 to missing)

. 
. tsset date
        time variable:  date, 20200122 to 20200710
                delta:  1 day

. 
. keep if date >= date("2020/03/17", "YMD") &  date < date("2020/07/07", "YMD")
(59 observations deleted)

. 
. forvalues i = 1/6 {
  2.     gen l`i'_hospitalizedcurrently = l`i'.hospitalizedcurrently
  3.     gen l`i'_deathincrease = l`i'.deathincrease
  4. }
(1 missing value generated)
(1 missing value generated)
(2 missing values generated)
(2 missing values generated)
(3 missing values generated)
(3 missing values generated)
(4 missing values generated)
(4 missing values generated)
(5 missing values generated)
(5 missing values generated)
(6 missing values generated)
(6 missing values generated)

. 
. egen hospitalizedcurrently_7d = rowtotal(hospitalizedcurrently l?_hospitalizedcurrently)

. egen deathincrease_7d = rowtotal(deathincrease l?_deathincrease)

. gen deaths_as_p_of_hosp_7d = deathincrease_7d / hospitalizedcurrently_7d * 100

. drop l?_*

. 
. gen hosp_in_10s = hospitalizedcurrently / 10

. 
. la var deathincrease "Daily COVID-19 Deaths"

. la var hosp_in_10s "COVID-19 Hospitalization (Divided by 10 for Comparison)"

. la var deaths_as_p_of_hosp_7d "Deaths as a share of Hospitalizations (7-Day Average)"

. format date %tdnn/dd

. 
. twoway (bar hosp_in_10s date, yaxis(1) color(gs14)) (bar deathincrease date, yaxis(1) color(blue)) (line deaths_as_p_of_hosp_
> 7d date, yaxis(2) color(orange)), tlabel(17mar2020(14)7jul2020) legend(col(1)) ylabel(0(1000)7000, axis(1) angle(0)) ylabel(0
>  "0%" 1 "1%" 2 "2%" 3 "3%" 4 "4%" 5 "5%" 6 "6%" 7 "7%" 8 "8%", axis(2) angle(0)) ytitle("") ytitle("", axis(2)) xtitle("") ti
> tle("Replication of original (highly misleading) graph") note("covidtrendlines.com; data from covidtracking.com (CC BY-NC-4.0
> )" "original graph at https://bit.ly/3eh5QXS")

. graph export "`dropbox'/misleading_graph.png", replace
(file C:\Users\favero\Dropbox\covid-trendlines/misleading_graph.png written in PNG format)

. 
. list date deaths_as_p_of_hosp_7d if deaths_as_p_of_hosp_7d >= 6

     +-----------------+
     | date   deaths~d |
     |-----------------|
  1. | 3/17   6.769231 |
  2. | 3/18   7.152497 |
  3. | 3/19   7.290133 |
  4. | 3/20   6.958333 |
  6. | 3/22   6.192622 |
     +-----------------+

. list date deaths_as_p_of_hosp_7d if date <= date("2020/03/22", "YMD")

     +-----------------+
     | date   deaths~d |
     |-----------------|
  1. | 3/17   6.769231 |
  2. | 3/18   7.152497 |
  3. | 3/19   7.290133 |
  4. | 3/20   6.958333 |
  5. | 3/21   5.943691 |
     |-----------------|
  6. | 3/22   6.192622 |
     +-----------------+

. 
. restore

. 
. *** Creating a better graph (still doesn't account for lag between hospitalizations and deaths) ***
. 
. //Repeat process except now I drop any observations were current hospitalizations variable is missing:
. keep if hospitalizedcurrently != .
(2,623 observations deleted)

. 
. tab state if date == date("2020/03/17", "YMD")

      state |      Freq.     Percent        Cum.
------------+-----------------------------------
         NY |          1      100.00      100.00
------------+-----------------------------------
      Total |          1      100.00

. tab state if date == date("2020/03/18", "YMD")

      state |      Freq.     Percent        Cum.
------------+-----------------------------------
         NY |          1      100.00      100.00
------------+-----------------------------------
      Total |          1      100.00

. tab state if date == date("2020/03/19", "YMD")

      state |      Freq.     Percent        Cum.
------------+-----------------------------------
         NY |          1      100.00      100.00
------------+-----------------------------------
      Total |          1      100.00

. tab state if date == date("2020/03/20", "YMD")

      state |      Freq.     Percent        Cum.
------------+-----------------------------------
         NY |          1      100.00      100.00
------------+-----------------------------------
      Total |          1      100.00

. tab state if date == date("2020/03/21", "YMD")

      state |      Freq.     Percent        Cum.
------------+-----------------------------------
         NY |          1      100.00      100.00
------------+-----------------------------------
      Total |          1      100.00

. tab state if date == date("2020/03/22", "YMD")

      state |      Freq.     Percent        Cum.
------------+-----------------------------------
         AR |          1       25.00       25.00
         CO |          1       25.00       50.00
         CT |          1       25.00       75.00
         NY |          1       25.00      100.00
------------+-----------------------------------
      Total |          4      100.00

. 
. collapse (sum) hospitalizedcurrently deathincrease, by(date)

. 
. replace hospitalizedcurrently = . if hospitalizedcurrently == 0
(0 real changes made)

. 
. tsset date
        time variable:  date, 20200317 to 20200710
                delta:  1 day

. 
. keep if date >= date("2020/03/17", "YMD") &  date < date("2020/07/07", "YMD")
(4 observations deleted)

. 
. forvalues i = 1/6 {
  2.     gen l`i'_hospitalizedcurrently = l`i'.hospitalizedcurrently
  3.     gen l`i'_deathincrease = l`i'.deathincrease
  4. }
(1 missing value generated)
(1 missing value generated)
(2 missing values generated)
(2 missing values generated)
(3 missing values generated)
(3 missing values generated)
(4 missing values generated)
(4 missing values generated)
(5 missing values generated)
(5 missing values generated)
(6 missing values generated)
(6 missing values generated)

. 
. egen hospitalizedcurrently_7d = rowtotal(hospitalizedcurrently l?_hospitalizedcurrently)

. egen deathincrease_7d = rowtotal(deathincrease l?_deathincrease)

. gen deaths_as_p_of_hosp_7d = deathincrease_7d / hospitalizedcurrently_7d * 100

. drop l?_*

. 
. gen hosp_in_10s = hospitalizedcurrently / 10

. 
. la var deathincrease "Daily COVID-19 Deaths"

. la var hosp_in_10s "COVID-19 Hospitalization (Divided by 10 for Comparison)"

. la var deaths_as_p_of_hosp_7d "Deaths as a share of Hospitalizations (7-Day Average)"

. format date %tdnn/dd

. 
. twoway (bar hosp_in_10s date, yaxis(1) color(gs14)) (bar deathincrease date, yaxis(1) color(blue)) (line deaths_as_p_of_hosp_
> 7d date, yaxis(2) color(orange)), tlabel(17mar2020(14)7jul2020) legend(col(1)) ylabel(0(1000)7000, axis(1) angle(0)) ylabel(0
>  "0%" 1 "1%" 2 "2%" 3 "3%" 4 "4%" 5 "5%" 6 "6%" 7 "7%" 8 "8%", axis(2) angle(0)) ytitle("") ytitle("", axis(2)) xtitle("") ti
> tle("Only counting deaths from states reporting hospitalizations") note("covidtrendlines.com; data from covidtracking.com (CC
>  BY-NC-4.0)" "original graph at https://bit.ly/3eh5QXS")

. graph export "`dropbox'/corrected_graph.png", replace
(file C:\Users\favero\Dropbox\covid-trendlines/corrected_graph.png written in PNG format)

. 
. log close
      name:  <unnamed>
       log:  C:\Users\favero\Documents\GitHub\covid-underreporting\code\..\logs\deaths_to_hospitalizations.txt
  log type:  text
 closed on:  11 Jul 2020, 10:19:03
-------------------------------------------------------------------------------------------------------------------------------
