-----------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\favero\Documents\GitHub\covid-underreporting\data\..\logs\estimating_reporting_
> delays.txt
  log type:  text
 opened on:  24 May 2020, 22:20:24

. 
. insheet using "..\data\past_reports\nationwide_historical_reports.csv"
(9 vars, 362 obs)

. 
. rename end_week end_week_str

. rename report_date report_date_str

. gen end_week = date(end_week_str, "MDY")

. gen report_date = date(report_date_str, "MDY")

. format end_week %tdCCYYNNDD

. format report_date %tdCCYYNNDD

. 
. gen days_to_report = report_date - end_week

. sum days_to_report

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
days_to_re~t |        362    45.35359    27.05605          2        108

. gen days_since_first_report = days_to_report - r(min)

. 
. order end_week report_date days_to_report

. sort end_week report_date

. 
. destring covid_deaths- pneumon_influ_or_covid, replace ignore(",")
covid_deaths: character , removed; replaced as int
total_deaths: character , removed; replaced as long
percent_of_expected_deaths already numeric; no replace
pneumonia_deaths: character , removed; replaced as int
pneumonia_and_covid_deaths: character , removed; replaced as int
influenza_deaths: contains characters not specified in ignore(); no replace
pneumon_influ_or_covid: character , removed; replaced as int
(150 missing values generated)

. 
. //following code commented out because it only works with weekly data:
. /*
> xtset end_week report_date, delta(7)
> gen growth_total_deaths = f.total_deaths / total_deaths
> bys days_to_report: sum growth_total_deaths
> gen est_real_total_deaths = 1.005286 * total_deaths if days_to_report==70
> replace est_real_total_deaths = 1.005286 * 1.007821 * total_deaths if days_to_report==63
> replace est_real_total_deaths = 1.005286 * 1.007821 * 1.014075 * total_deaths if days_to_report==56
> replace est_real_total_deaths = 1.005286 * 1.007821 * 1.014075 * 1.015894 * total_deaths if days_to
> _report==49
> replace est_real_total_deaths = 1.005286 * 1.007821 * 1.014075 * 1.015894 * 1.01353 * total_deaths 
> if days_to_report==42
> replace est_real_total_deaths = 1.005286 * 1.007821 * 1.014075 * 1.015894 * 1.01353 * 1.014131 * to
> tal_deaths if days_to_report==35
> replace est_real_total_deaths = 1.005286 * 1.007821 * 1.014075 * 1.015894 * 1.01353 * 1.014131 * 1.
> 024915 * total_deaths if days_to_report==28
> replace est_real_total_deaths = 1.005286 * 1.007821 * 1.014075 * 1.015894 * 1.01353 * 1.014131 * 1.
> 024915 * 1.055341 * total_deaths if days_to_report==21
> replace est_real_total_deaths = 1.005286 * 1.007821 * 1.014075 * 1.015894 * 1.01353 * 1.014131 * 1.
> 024915 * 1.055341 * 1.163302 * total_deaths if days_to_report==14
> replace est_real_total_deaths = 1.005286 * 1.007821 * 1.014075 * 1.015894 * 1.01353 * 1.014131 * 1.
> 024915 * 1.055341 * 1.163302 * 1.733615 * total_deaths if days_to_report==7
> */
. 
. // create week marker, with new weeks starting on Fridays (since there's always a Friday report ava
> ilable)
. gen weeks_to_report = .
(362 missing values generated)

. forvalues i=0/20 {
  2.     replace weeks_to_report = `i' if days_to_report + 1 >= 7*`i' & days_to_report + 1 < 7*(`i'+1
> )
  3. }
(22 real changes made)
(29 real changes made)
(29 real changes made)
(29 real changes made)
(29 real changes made)
(29 real changes made)
(29 real changes made)
(29 real changes made)
(29 real changes made)
(29 real changes made)
(24 real changes made)
(19 real changes made)
(14 real changes made)
(12 real changes made)
(7 real changes made)
(3 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. sort end_week report_date

. egen ts = fill(0 1)

. xtset end_week ts
       panel variable:  end_week (unbalanced)
        time variable:  ts, 0 to 361
                delta:  1 unit

. gen growth_per_day = (f.total_deaths - total_deaths)/(f.days_to_report - days_to_report)/total_deat
> hs
(16 missing values generated)

. bys weeks_to_report: sum growth_per_day

-----------------------------------------------------------------------------------------------------
-> weeks_to_report = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
growth_per~y |         21     .440044    .5810846          0   2.641183

-----------------------------------------------------------------------------------------------------
-> weeks_to_report = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
growth_per~y |         28    .0895274    .0773751          0   .3825459

-----------------------------------------------------------------------------------------------------
-> weeks_to_report = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
growth_per~y |         28    .0246416     .020427          0   .0901504

-----------------------------------------------------------------------------------------------------
-> weeks_to_report = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
growth_per~y |         28    .0089075    .0074117          0   .0324942

-----------------------------------------------------------------------------------------------------
-> weeks_to_report = 4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
growth_per~y |         28    .0040937    .0035068          0   .0164343

-----------------------------------------------------------------------------------------------------
-> weeks_to_report = 5

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
growth_per~y |         28    .0024522    .0025452          0   .0121391

-----------------------------------------------------------------------------------------------------
-> weeks_to_report = 6

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
growth_per~y |         28    .0025176    .0041383          0   .0171491

-----------------------------------------------------------------------------------------------------
-> weeks_to_report = 7

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
growth_per~y |         28    .0026866    .0042603          0   .0153098

-----------------------------------------------------------------------------------------------------
-> weeks_to_report = 8

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
growth_per~y |         28     .002019    .0027957          0   .0106145

-----------------------------------------------------------------------------------------------------
-> weeks_to_report = 9

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
growth_per~y |         28    .0011061    .0012293          0   .0037464

-----------------------------------------------------------------------------------------------------
-> weeks_to_report = 10

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
growth_per~y |         23      .00074    .0008737          0   .0028992

-----------------------------------------------------------------------------------------------------
-> weeks_to_report = 11

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
growth_per~y |         18     .001124    .0022301          0   .0092544

-----------------------------------------------------------------------------------------------------
-> weeks_to_report = 12

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
growth_per~y |         13    .0006215    .0008737   .0000699   .0029319

-----------------------------------------------------------------------------------------------------
-> weeks_to_report = 13

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
growth_per~y |         11    .0006019    .0008714    .000058   .0028639

-----------------------------------------------------------------------------------------------------
-> weeks_to_report = 14

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
growth_per~y |          6     .000233    .0002319   .0000232   .0006436

-----------------------------------------------------------------------------------------------------
-> weeks_to_report = 15

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
growth_per~y |          2    .0001506    .0000819   .0000927   .0002085


. gen est_real_total_deaths = total_deaths

. forvalues i=0/15 {
  2.     local j = 15-`i'
  3.         sum growth_per_day if weeks_to_report == `j'
  4.         replace est_real_total_deaths = est_real_total_deaths * (r(mean)*min(7, 7*(`j'+1) - (day
> s_to_report + 1)) + 1) if weeks_to_report <= `j'
  5. }

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
growth_per~y |          2    .0001506    .0000819   .0000927   .0002085
(362 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
growth_per~y |          6     .000233    .0002319   .0000232   .0006436
(359 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
growth_per~y |         11    .0006019    .0008714    .000058   .0028639
(352 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
growth_per~y |         13    .0006215    .0008737   .0000699   .0029319
(340 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
growth_per~y |         18     .001124    .0022301          0   .0092544
(326 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
growth_per~y |         23      .00074    .0008737          0   .0028992
(307 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
growth_per~y |         28    .0011061    .0012293          0   .0037464
(283 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
growth_per~y |         28     .002019    .0027957          0   .0106145
(254 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
growth_per~y |         28    .0026866    .0042603          0   .0153098
(225 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
growth_per~y |         28    .0025176    .0041383          0   .0171491
(196 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
growth_per~y |         28    .0024522    .0025452          0   .0121391
(167 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
growth_per~y |         28    .0040937    .0035068          0   .0164343
(138 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
growth_per~y |         28    .0089075    .0074117          0   .0324942
(109 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
growth_per~y |         28    .0246416     .020427          0   .0901504
(80 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
growth_per~y |         28    .0895274    .0773751          0   .3825459
(51 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
growth_per~y |         21     .440044    .5810846          0   2.641183
(22 real changes made)

. order est_real_total_deaths

. 
. 
. capture program drop reporting_delays

. program reporting_delays
  1.         args lnf detected time alpha lnsigma
  2.         quietly replace `lnf' = ///
>                 ln(normalden( $ML_y1,  `alpha' - `alpha'*exp(-(exp(`time') * $ML_y2 )), exp(`lnsigm
> a'+`detected'*$ML_y2 )))
  3. end

. 
. ml model lf reporting_delays ///
>         (detected: total_deaths = ) ///
>         (time: days_to_report = ) ///
>         (alpha: i.end_week) ///
>         (lnsigma: )

. ml maximize

initial:       log likelihood =     -<inf>  (could not be evaluated)
feasible:      log likelihood = -42351.085
rescale:       log likelihood = -42351.085
rescale eq:    log likelihood = -41601.159
Iteration 0:   log likelihood = -41601.159  (not concave)
Iteration 1:   log likelihood = -34941.319  (not concave)
Iteration 2:   log likelihood = -29583.991  (not concave)
Iteration 3:   log likelihood = -27274.447  (not concave)
Iteration 4:   log likelihood = -25591.454  (not concave)
Iteration 5:   log likelihood = -24335.489  (not concave)
Iteration 6:   log likelihood = -17124.632  (not concave)
Iteration 7:   log likelihood = -9493.1095  (not concave)
Iteration 8:   log likelihood = -8097.0613  (not concave)
Iteration 9:   log likelihood = -7896.6909  (not concave)
Iteration 10:  log likelihood = -6875.6775  (not concave)
Iteration 11:  log likelihood = -6619.4919  (not concave)
Iteration 12:  log likelihood = -5418.4058  (not concave)
Iteration 13:  log likelihood = -5272.7689  (not concave)
Iteration 14:  log likelihood = -4761.9679  (not concave)
Iteration 15:  log likelihood =  -4390.161  (not concave)
Iteration 16:  log likelihood = -3998.7464  (not concave)
Iteration 17:  log likelihood = -3719.7577  (not concave)
Iteration 18:  log likelihood = -3630.9747  (not concave)
Iteration 19:  log likelihood = -3580.3947  (not concave)
Iteration 20:  log likelihood = -3553.3535  (not concave)
Iteration 21:  log likelihood = -3532.3456  (not concave)
Iteration 22:  log likelihood =  -3524.436  (not concave)
Iteration 23:  log likelihood = -3516.4675  (not concave)
Iteration 24:  log likelihood = -3501.4861  (not concave)
Iteration 25:  log likelihood = -3488.5532  (not concave)
Iteration 26:  log likelihood = -3475.9463  (not concave)
Iteration 27:  log likelihood = -3465.1873  (not concave)
Iteration 28:  log likelihood = -3454.8622  (not concave)
Iteration 29:  log likelihood = -3444.7297  (not concave)
Iteration 30:  log likelihood = -3433.8901  (not concave)
Iteration 31:  log likelihood = -3414.8654  (not concave)
Iteration 32:  log likelihood = -3388.7144  (not concave)
Iteration 33:  log likelihood = -3347.4958  (not concave)
Iteration 34:  log likelihood = -3328.6383  (not concave)
Iteration 35:  log likelihood = -3310.6586  (not concave)
Iteration 36:  log likelihood = -3285.1611  (not concave)
Iteration 37:  log likelihood = -3251.4377  (not concave)
Iteration 38:  log likelihood = -3229.4906  (not concave)
Iteration 39:  log likelihood = -3205.8473  (not concave)
Iteration 40:  log likelihood = -3072.3852  
Iteration 41:  log likelihood = -3040.1045  
Iteration 42:  log likelihood = -3031.6947  
Iteration 43:  log likelihood = -3031.5697  
Iteration 44:  log likelihood = -3031.5695  

                                                Number of obs     =        362
                                                Wald chi2(0)      =          .
Log likelihood = -3031.5695                     Prob > chi2       =          .

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
detected     |
       _cons |  -.0266043    .001588   -16.75   0.000    -.0297166   -.0234919
-------------+----------------------------------------------------------------
time         |
       _cons |  -2.380871   .0220013  -108.21   0.000    -2.423993    -2.33775
-------------+----------------------------------------------------------------
alpha        |
    end_week |
      21953  |   454.3453   94.48004     4.81   0.000     269.1679    639.5228
      21960  |  -292.9107   107.0257    -2.74   0.006    -502.6771   -83.14424
      21967  |  -328.6614   123.3824    -2.66   0.008    -570.4864   -86.83643
      21974  |  -148.9088   145.2916    -1.02   0.305    -433.6752    135.8576
      21981  |  -388.3062   171.9004    -2.26   0.024    -725.2249   -51.38758
      21988  |  -1813.021   207.2282    -8.75   0.000    -2219.181   -1406.861
      21995  |  -1138.415   254.6778    -4.47   0.000    -1637.575   -639.2559
      22002  |     3092.6   322.5721     9.59   0.000     2460.371     3724.83
      22009  |   12058.17   429.0041    28.11   0.000     11217.34       12899
      22016  |   19064.63   582.4709    32.73   0.000        17923    20206.25
      22023  |   17187.11   770.9522    22.29   0.000     15676.07    18698.14
      22030  |   12296.52   1056.291    11.64   0.000     10226.22    14366.81
      22037  |   6962.127   1554.189     4.48   0.000     3915.972    10008.28
      22044  |   2278.949   2820.845     0.81   0.419    -3249.807    7807.704
      22051  |  -11517.32   11090.53    -1.04   0.299    -33254.36    10219.72
             |
       _cons |   57277.68   62.33254   918.90   0.000     57155.51    57399.85
-------------+----------------------------------------------------------------
lnsigma      |
       _cons |   8.162161   .0810442   100.71   0.000     8.003318    8.321005
------------------------------------------------------------------------------

. 
. display "k="exp(_b[#2:_cons])
k=.09246996

. 
. gen delay_adj_total_deaths = total_deaths / (1-exp(-exp(_b[#2:_cons])*days_to_report))

. 
. 
. 
. 
. egen min_realdeaths = max(total_deaths), by(end_week)

. 
. 
. capture program drop reporting_delays

. program reporting_delays
  1.         args lnf detected time missed_realdeaths lnsigma delta
  2.         quietly replace `lnf' = ///
>                 ln(normalden( $ML_y1,  ($ML_y3 + exp(`missed_realdeaths')) - (1-1/exp(`delta'))*($M
> L_y3 + exp(`missed_realdeaths'))*exp(-(exp(`time') * $ML_y2 )), exp(`lnsigma'+`detected'*$ML_y2 )))
  3. end

. 
. ml model lf reporting_delays ///
>         (detected: total_deaths = ) ///
>         (time: days_to_report = ) ///
>         (missed_realdeaths: min_realdeaths = i.end_week) ///
>         (lnsigma: ) ///
>         (delta: ) if end_week < date("20200510","YMD")

. ml maximize

initial:       log likelihood =     -<inf>  (could not be evaluated)
feasible:      log likelihood = -44423.752
rescale:       log likelihood = -44423.752
rescale eq:    log likelihood = -41617.888
Iteration 0:   log likelihood = -41617.888  (not concave)
Iteration 1:   log likelihood = -40835.702  (not concave)
Iteration 2:   log likelihood = -40449.574  (not concave)
Iteration 3:   log likelihood = -31675.142  (not concave)
Iteration 4:   log likelihood =  -27283.75  (not concave)
Iteration 5:   log likelihood = -11681.899  (not concave)
Iteration 6:   log likelihood = -11614.202  (not concave)
Iteration 7:   log likelihood = -11590.134  (not concave)
Iteration 8:   log likelihood = -7173.8618  (not concave)
Iteration 9:   log likelihood = -7165.1886  (not concave)
Iteration 10:  log likelihood =  -6949.456  (not concave)
Iteration 11:  log likelihood = -5250.0865  (not concave)
Iteration 12:  log likelihood = -4746.4603  (not concave)
Iteration 13:  log likelihood = -4472.8264  (not concave)
Iteration 14:  log likelihood = -4029.4551  (not concave)
Iteration 15:  log likelihood = -3997.5625  (not concave)
Iteration 16:  log likelihood = -3948.5896  (not concave)
Iteration 17:  log likelihood = -3910.5292  (not concave)
Iteration 18:  log likelihood = -3904.8183  (not concave)
Iteration 19:  log likelihood = -3777.1583  (not concave)
Iteration 20:  log likelihood = -3679.0196  (not concave)
Iteration 21:  log likelihood = -3613.1575  (not concave)
Iteration 22:  log likelihood = -3566.8625  (not concave)
Iteration 23:  log likelihood = -3532.0753  (not concave)
Iteration 24:  log likelihood = -3497.8526  (not concave)
Iteration 25:  log likelihood = -3190.9642  (not concave)
Iteration 26:  log likelihood = -3190.0567  (not concave)
Iteration 27:  log likelihood = -3187.8063  (not concave)
Iteration 28:  log likelihood = -3173.7788  (not concave)
Iteration 29:  log likelihood = -3167.5235  (not concave)
Iteration 30:  log likelihood = -3158.6859  (not concave)
Iteration 31:  log likelihood = -3097.5592  (not concave)
Iteration 32:  log likelihood = -3094.7977  (not concave)
Iteration 33:  log likelihood =  -3092.772  (not concave)
Iteration 34:  log likelihood = -3070.5631  (not concave)
Iteration 35:  log likelihood = -3044.7815  (not concave)
Iteration 36:  log likelihood = -3042.6613  (not concave)
Iteration 37:  log likelihood = -3039.6748  (not concave)
Iteration 38:  log likelihood = -3032.7848  (not concave)
Iteration 39:  log likelihood = -3021.0958  (not concave)
Iteration 40:  log likelihood = -3007.6095  
Iteration 41:  log likelihood =  -2987.639  
Iteration 42:  log likelihood = -2980.9064  (not concave)
Iteration 43:  log likelihood = -2980.8914  
Iteration 44:  log likelihood = -2980.1389  (not concave)
Iteration 45:  log likelihood = -2980.1058  
Iteration 46:  log likelihood = -2980.0609  
Iteration 47:  log likelihood = -2980.0602  (not concave)
Iteration 48:  log likelihood = -2978.4319  (backed up)
Iteration 49:  log likelihood = -2977.8168  
Iteration 50:  log likelihood = -2977.5879  
Iteration 51:  log likelihood = -2977.5849  
Iteration 52:  log likelihood = -2977.5849  

                                                Number of obs     =        360
                                                Wald chi2(0)      =          .
Log likelihood = -2977.5849                     Prob > chi2       =          .

-----------------------------------------------------------------------------------
                  |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
detected          |
            _cons |  -.0497988   .0011753   -42.37   0.000    -.0521024   -.0474952
------------------+----------------------------------------------------------------
time              |
            _cons |  -2.884713   .0149724  -192.67   0.000    -2.914058   -2.855367
------------------+----------------------------------------------------------------
missed_realdeaths |
         end_week |
           21953  |  -104.9219          .        .       .            .           .
           21960  |   .8063505   .5616827     1.44   0.151    -.2945273    1.907228
           21967  |  -189.1723          .        .       .            .           .
           21974  |   2.259427   .4955493     4.56   0.000     1.288168    3.230686
           21981  |   2.914458   .4963114     5.87   0.000     1.941705     3.88721
           21988  |   3.169998   .5031083     6.30   0.000     2.183924    4.156073
           21995  |   3.762521   .5043756     7.46   0.000     2.773963    4.751079
           22002  |   4.361142   .5054386     8.63   0.000     3.370501    5.351784
           22009  |   4.885683   .5063787     9.65   0.000     3.893199    5.878167
           22016  |   5.333181   .5086641    10.48   0.000     4.336217    6.330144
           22023  |   5.625307    .514044    10.94   0.000       4.6178    6.632815
           22030  |   5.767365   .5257164    10.97   0.000     4.736979     6.79775
           22037  |     5.7799   .5640376    10.25   0.000     4.674407    6.885394
           22044  |    6.00382   .6249334     9.61   0.000     4.778973    7.228667
                  |
            _cons |   3.694614   .5061779     7.30   0.000     2.702523    4.686704
------------------+----------------------------------------------------------------
lnsigma           |
            _cons |   9.122542   .0652712   139.76   0.000     8.994612    9.250471
------------------+----------------------------------------------------------------
delta             |
            _cons |   1.252401   .0785704    15.94   0.000     1.098405    1.406396
-----------------------------------------------------------------------------------

. 
. display "k="exp(_b[#2:_cons])
k=.05587083

. display "beta=limit*"1/exp(_b[#5:_cons])
beta=limit*.28581781

. display "alpha="(1-1/exp(_b[#5:_cons]))
alpha=.71418219

. 
. gen delay_adj_total_deaths2 = total_deaths / (1-(1-1/exp(_b[#5:_cons]))*exp(-exp(_b[#2:_cons])*days
> _to_report))

. 
. 
. capture program drop reporting_delays

. program reporting_delays
  1.         args lnf time detected0 missed_realdeaths lnsigma
  2.         quietly replace `lnf' = ///
>                 ln(normalden( $ML_y1,  -(1/exp(`time')) * log( ($ML_y3 + exp(`missed_realdeaths') -
>  $ML_y2 )/(($ML_y3 + exp(`missed_realdeaths'))*1/(1+exp(-`detected0'))) ), exp(`lnsigma')))
  3. end

. 
. ml model lf reporting_delays ///
>         (time: days_since_first_report = ) ///
>         (detected0: total_deaths = ) ///
>         (missed_realdeaths: min_realdeaths = i.end_week) ///
>         (lnsigma: ) if end_week < date("20200501","YMD")

. ml maximize

initial:       log likelihood =     -<inf>  (could not be evaluated)
feasible:      log likelihood = -37911.008
rescale:       log likelihood = -2051.5987
rescale eq:    log likelihood = -1437.4799
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 0:   log likelihood = -1437.4799  (not concave)
Iteration 1:   log likelihood = -1423.1561  (not concave)
numerical derivatives are approximate
nearby values are missing
Iteration 2:   log likelihood = -1371.1928  (not concave)
Iteration 3:   log likelihood = -1239.2757  (not concave)
Iteration 4:   log likelihood = -1159.3083  (not concave)
Iteration 5:   log likelihood = -1152.0821  (not concave)
Iteration 6:   log likelihood = -1108.5092  
Iteration 7:   log likelihood = -1073.2632  
Iteration 8:   log likelihood = -1071.4836  (not concave)
Iteration 9:   log likelihood = -984.09428  
Iteration 10:  log likelihood = -964.69073  
Iteration 11:  log likelihood =  -963.1652  
Iteration 12:  log likelihood = -963.16481  
Iteration 13:  log likelihood = -963.16481  

                                                Number of obs     =        343
                                                Wald chi2(0)      =          .
Log likelihood = -963.16481                     Prob > chi2       =          .

-----------------------------------------------------------------------------------
                  |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
time              |
            _cons |  -3.024487   .0149726  -202.00   0.000    -3.053833   -2.995142
------------------+----------------------------------------------------------------
detected0         |
            _cons |    .234753   .0663255     3.54   0.000     .1047574    .3647486
------------------+----------------------------------------------------------------
missed_realdeaths |
         end_week |
           21953  |   .2007814   .1122681     1.79   0.074    -.0192601    .4208229
           21960  |   .6115332   .1107715     5.52   0.000     .3944251    .8286414
           21967  |   1.038998   .1106025     9.39   0.000     .8222207    1.255774
           21974  |   1.440616   .1117236    12.89   0.000     1.221641     1.65959
           21981  |   1.932223   .1124161    17.19   0.000     1.711892    2.152555
           21988  |   2.194108   .1199637    18.29   0.000     1.958984    2.429233
           21995  |   2.664977   .1219579    21.85   0.000     2.425944     2.90401
           22002  |   3.168685    .123988    25.56   0.000     2.925673    3.411697
           22009  |   3.592566   .1286642    27.92   0.000     3.340389    3.844744
           22016  |   3.969111   .1350752    29.38   0.000     3.704369    4.233854
           22023  |   4.194649   .1457988    28.77   0.000     3.908888    4.480409
           22030  |   4.285171    .165584    25.88   0.000     3.960632    4.609709
                  |
            _cons |   5.202005   .1107656    46.96   0.000     4.984909    5.419102
------------------+----------------------------------------------------------------
lnsigma           |
            _cons |   1.389122   .0381802    36.38   0.000      1.31429    1.463954
-----------------------------------------------------------------------------------

. 
. display "k="exp(_b[#1:_cons])
k=.04858273

. display "beta=limit*"(1-1/(1+exp(-_b[#2:_cons])))
beta=limit*.44157979

. display "alpha="(1/(1+exp(-_b[#2:_cons])))
alpha=.55842021

. 
. gen delay_adj_total_deaths3 = total_deaths/(1-1/(1+exp(-_b[#2:_cons]))*exp(-exp(_b[#1:_cons])*days_
> since_first_report))

. 
. twoway scatter est_real_total_deaths days_to_report

. twoway scatter delay_adj_total_deaths days_to_report

. twoway scatter delay_adj_total_deaths2 days_to_report

. twoway scatter delay_adj_total_deaths3 days_to_report

. 
. reg est_real_total_deaths days_to_report i.end_week

      Source |       SS           df       MS      Number of obs   =       362
-------------+----------------------------------   F(16, 345)      =     53.91
       Model |  2.0426e+10        16  1.2766e+09   Prob > F        =    0.0000
    Residual |  8.1691e+09       345  23678594.3   R-squared       =    0.7143
-------------+----------------------------------   Adj R-squared   =    0.7011
       Total |  2.8595e+10       361  79209708.1   Root MSE        =    4866.1

--------------------------------------------------------------------------------
est_real_tot~s |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
days_to_report |  -28.74899   19.70085    -1.46   0.145    -67.49789    9.999903
               |
      end_week |
        21953  |   533.0457   1285.311     0.41   0.679    -1994.986    3061.078
        21960  |  -186.6184   1307.317    -0.14   0.887    -2757.934    2384.697
        21967  |  -17.94554   1343.194    -0.01   0.989    -2659.825    2623.933
        21974  |   315.2784   1391.868     0.23   0.821    -2422.336    3052.893
        21981  |   335.1679   1452.053     0.23   0.818    -2520.823    3191.158
        21988  |  -974.8988   1522.385    -0.64   0.522    -3969.223    2019.426
        21995  |   44.49704   1601.528     0.03   0.978     -3105.49    3194.484
        22002  |   5404.912   1688.242     3.20   0.001     2084.369    8725.455
        22009  |   15896.53   1778.671     8.94   0.000     12398.13    19394.94
        22016  |   21192.17    1870.16    11.33   0.000     17513.82    24870.52
        22023  |   15190.53   1981.632     7.67   0.000     11292.93    19088.13
        22030  |   12266.81   2133.442     5.75   0.000     8070.618       16463
        22037  |    4567.85   2276.796     2.01   0.046     89.70167    9045.998
        22044  |   5377.274   2674.229     2.01   0.045     117.4305    10637.12
        22051  |  -6383.145   3906.693    -1.63   0.103    -14067.08    1300.789
               |
         _cons |   60099.76   1893.254    31.74   0.000     56375.99    63823.54
--------------------------------------------------------------------------------

. reg delay_adj_total_deaths days_to_report i.end_week

      Source |       SS           df       MS      Number of obs   =       362
-------------+----------------------------------   F(16, 345)      =     47.04
       Model |  1.4642e+10        16   915129156   Prob > F        =    0.0000
    Residual |  6.7111e+09       345  19452567.4   R-squared       =    0.6857
-------------+----------------------------------   Adj R-squared   =    0.6711
       Total |  2.1353e+10       361  59150144.7   Root MSE        =    4410.5

--------------------------------------------------------------------------------
delay_adj_to~s |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
days_to_report |   32.39634   17.85647     1.81   0.071    -2.724897    67.51758
               |
      end_week |
        21953  |   658.6689   1164.981     0.57   0.572     -1632.69    2950.028
        21960  |  -4.576894   1184.927    -0.00   0.997    -2335.167    2326.013
        21967  |   133.0474   1217.444     0.11   0.913      -2261.5    2527.595
        21974  |   471.1373   1261.561     0.37   0.709    -2010.182    2952.457
        21981  |   659.5779   1316.112     0.50   0.617    -1929.036    3248.192
        21988  |  -214.0762    1379.86    -0.16   0.877    -2928.073    2499.921
        21995  |   1339.813   1451.593     0.92   0.357    -1515.273      4194.9
        22002  |   6790.257    1530.19     4.44   0.000     3780.582    9799.932
        22009  |   15351.51   1612.153     9.52   0.000     12180.62    18522.39
        22016  |   20435.12   1695.077    12.06   0.000     17101.14    23769.11
        22023  |    15776.7   1796.113     8.78   0.000     12243.99    19309.41
        22030  |   13467.86    1933.71     6.96   0.000     9664.518    17271.21
        22037  |   4247.813   2063.643     2.06   0.040     188.9072    8306.719
        22044  |   3383.759   2423.869     1.40   0.164     -1383.66    8151.178
        22051  |  -9119.154    3540.95    -2.58   0.010    -16083.72   -2154.587
               |
         _cons |   54241.95   1716.008    31.61   0.000     50866.79     57617.1
--------------------------------------------------------------------------------

. reg delay_adj_total_deaths2 days_to_report i.end_week

      Source |       SS           df       MS      Number of obs   =       362
-------------+----------------------------------   F(16, 345)      =     15.44
       Model |  1.7276e+10        16  1.0797e+09   Prob > F        =    0.0000
    Residual |  2.4126e+10       345  69930090.1   R-squared       =    0.4173
-------------+----------------------------------   Adj R-squared   =    0.3902
       Total |  4.1402e+10       361   114686188   Root MSE        =    8362.4

--------------------------------------------------------------------------------
delay_adj_to~2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
days_to_report |   101.5325   33.85627     3.00   0.003     34.94187    168.1232
               |
      end_week |
        21953  |   1339.896    2208.83     0.61   0.545    -3004.572    5684.365
        21960  |   1416.314   2246.648     0.63   0.529    -3002.538    5835.165
        21967  |   2404.188   2308.302     1.04   0.298    -2135.928    6944.305
        21974  |   3722.783    2391.95     1.56   0.121     -981.856    8427.422
        21981  |   5030.532   2495.379     2.02   0.045     122.4611    9938.604
        21988  |    5314.25   2616.246     2.03   0.043       168.45    10460.05
        21995  |   8026.024   2752.254     2.92   0.004     2612.714    13439.33
        22002  |   13780.43   2901.275     4.75   0.000     8074.013    19486.84
        22009  |    19438.4   3056.679     6.36   0.000     13426.33    25450.47
        22016  |   24383.58   3213.904     7.59   0.000     18062.27    30704.89
        22023  |   20341.76   3405.471     5.97   0.000     13643.67    27039.86
        22030  |   19959.74   3666.359     5.44   0.000     12748.51    27170.97
        22037  |   4384.825   3912.715     1.12   0.263    -3310.954     12080.6
        22044  |  -1837.637    4595.71    -0.40   0.690    -10876.77      7201.5
        22051  |  -24597.23   6713.723    -3.66   0.000    -37802.21   -11392.25
               |
         _cons |   48839.88   3253.591    15.01   0.000     42440.51    55239.25
--------------------------------------------------------------------------------

. reg delay_adj_total_deaths3 days_to_report i.end_week

      Source |       SS           df       MS      Number of obs   =       362
-------------+----------------------------------   F(16, 345)      =     12.67
       Model |  1.6785e+10        16  1.0490e+09   Prob > F        =    0.0000
    Residual |  2.8558e+10       345  82777409.6   R-squared       =    0.3702
-------------+----------------------------------   Adj R-squared   =    0.3410
       Total |  4.5343e+10       361   125603733   Root MSE        =    9098.2

--------------------------------------------------------------------------------
delay_adj_to~3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
days_to_report |   143.6513   36.83519     3.90   0.000     71.20153    216.1012
               |
      end_week |
        21953  |   1702.752   2403.179     0.71   0.479    -3023.975    6429.479
        21960  |    2144.64   2444.325     0.88   0.381    -2663.015    6952.295
        21967  |     3510.2   2511.404     1.40   0.163    -1429.389     8449.79
        21974  |   5206.024   2602.411     2.00   0.046     87.43555    10324.61
        21981  |   6864.997   2714.941     2.53   0.012     1525.077    12204.92
        21988  |    7409.13   2846.443     2.60   0.010     1810.564     13007.7
        21995  |    10203.7   2994.418     3.41   0.001      4314.09    16093.32
        22002  |    15578.5    3156.55     4.94   0.000     9369.997    21787.01
        22009  |   20467.95   3325.628     6.15   0.000     13926.89       27009
        22016  |   25201.82   3496.687     7.21   0.000     18324.31    32079.33
        22023  |   21327.08   3705.109     5.76   0.000     14039.63    28614.52
        22030  |   20646.64   3988.952     5.18   0.000     12800.91    28492.37
        22037  |   4142.572   4256.985     0.97   0.331    -4230.338    12515.48
        22044  |  -3153.921   5000.075    -0.63   0.529    -12988.39    6680.546
        22051  |  -25442.94   7304.446    -3.48   0.001    -39809.79   -11076.09
               |
         _cons |   45526.07   3539.866    12.86   0.000     38563.64    52488.51
--------------------------------------------------------------------------------

. 
. corr est_real_total_deaths delay_adj_total_deaths delay_adj_total_deaths2 delay_adj_total_deaths3
(obs=362)

             | est_re~s delay_~s delay_~2 delay_~3
-------------+------------------------------------
est_real_t~s |   1.0000
delay_adj_~s |   0.9183   1.0000
delay_adj_~2 |   0.6242   0.8249   1.0000
delay_adj_~3 |   0.5164   0.7385   0.9872   1.0000


. 
. log close
      name:  <unnamed>
       log:  C:\Users\favero\Documents\GitHub\covid-underreporting\data\..\logs\estimating_reporting_
> delays.txt
  log type:  text
 closed on:  24 May 2020, 22:20:32
-----------------------------------------------------------------------------------------------------
