-----------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\favero\Documents\GitHub\covid-underreporting\code\..\logs\estimating_reporting_
> delays_by_state.txt
  log type:  text
 opened on:  31 May 2020, 16:15:07

. 
. use "..\data\past_reports\9 May 2020 cdc_deaths.dta"

. //drop if _n <=228 // these observations appear to be corrupted; see readme file in this folder for
>  explantion
. drop _all

. append using "..\data\past_reports\7 May 2020 cdc_deaths.dta"

. rename pneumon_influ_and_covid pneumon_influ_or_covid

. append using "..\data\past_reports\16 May 2020 cdc_deaths.dta"

. append using "..\data\past_reports\21 May 2020 cdc_deaths.dta"

. append using "..\data\past_reports\22 May 2020 cdc_deaths.dta"

. append using "..\data\past_reports\26 May 2020 cdc_deaths.dta"

. append using "..\data\past_reports\27 May 2020 cdc_deaths.dta"

. append using "..\data\past_reports\28 May 2020 cdc_deaths.dta"

. append using "..\data\past_reports\29 May 2020 cdc_deaths.dta"

. 
. merge m:1 state using "..\data\population.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                           258
        from master                       258  (_merge==1)
        from using                          0  (_merge==2)

    matched                             6,579  (_merge==3)
    -----------------------------------------

. drop _merge

. replace fips = 0 if state == "United States"
(129 real changes made)

. replace fips = 72 if state == "Puerto Rico"
(129 real changes made)

. 
. //drop if state == "United States" | state == "Connecticut" | state == "North Carolina" | state == 
> "Puerto Rico" | state == "West Virginia"
. //drop if  state == "Connecticut" | state == "North Carolina" | state == "Puerto Rico" | state == "
> West Virginia"
. 
. rename date end_week

. 
. gen days_to_report = report_date - end_week

. sum days_to_report

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
days_to_re~t |      6,837    58.04651    32.92465          3        118

. gen days_since_first_report = days_to_report - r(min)

. 
. order end_week report_date days_to_report

. sort end_week report_date

. 
. foreach var of varlist covid_deaths- pneumon_influ_or_covid {
  2.     replace `var' = 5 if `var' == .
  3. }
(266 real changes made)
(9 real changes made)
(23 real changes made)
(150 real changes made)
(323 real changes made)
(802 real changes made)
(118 real changes made)

. 
. //following code commented out because it only works with weekly data:
. /*
> xtset end_week report_date, delta(7)
> gen growth_total_deaths = f.total_deaths / total_deaths
> bys days_to_report: sum growth_total_deaths
> gen est_real_total_deaths = 1.005286 * total_deaths if days_to_report==70
> replace est_real_total_deaths = 1.005286 * 1.007821 * total_deaths if days_to_report==63
> replace est_real_total_deaths = 1.005286 * 1.007821 * 1.014075 * total_deaths if days_to_report==56
> replace est_real_total_deaths = 1.005286 * 1.007821 * 1.014075 * 1.015894 * total_deaths if days_to
> _report==49
> replace est_real_total_deaths = 1.005286 * 1.007821 * 1.014075 * 1.015894 * 1.01353 * total_deaths 
> if days_to_report==42
> replace est_real_total_deaths = 1.005286 * 1.007821 * 1.014075 * 1.015894 * 1.01353 * 1.014131 * to
> tal_deaths if days_to_report==35
> replace est_real_total_deaths = 1.005286 * 1.007821 * 1.014075 * 1.015894 * 1.01353 * 1.014131 * 1.
> 024915 * total_deaths if days_to_report==28
> replace est_real_total_deaths = 1.005286 * 1.007821 * 1.014075 * 1.015894 * 1.01353 * 1.014131 * 1.
> 024915 * 1.055341 * total_deaths if days_to_report==21
> replace est_real_total_deaths = 1.005286 * 1.007821 * 1.014075 * 1.015894 * 1.01353 * 1.014131 * 1.
> 024915 * 1.055341 * 1.163302 * total_deaths if days_to_report==14
> replace est_real_total_deaths = 1.005286 * 1.007821 * 1.014075 * 1.015894 * 1.01353 * 1.014131 * 1.
> 024915 * 1.055341 * 1.163302 * 1.733615 * total_deaths if days_to_report==7
> */
. 
. // create week marker, with new weeks starting on Fridays (since there's always a Friday report ava
> ilable)
. gen weeks_to_report = .
(6,837 missing values generated)

. forvalues i=0/20 {
  2.     replace weeks_to_report = `i' if days_to_report + 1 >= 7*`i' & days_to_report + 1 < 7*(`i'+1
> )
  3. }
(265 real changes made)
(424 real changes made)
(424 real changes made)
(424 real changes made)
(424 real changes made)
(424 real changes made)
(424 real changes made)
(424 real changes made)
(424 real changes made)
(424 real changes made)
(424 real changes made)
(424 real changes made)
(424 real changes made)
(424 real changes made)
(371 real changes made)
(371 real changes made)
(265 real changes made)
(53 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. egen state_end_week = group(state end_week)

. sort state_end_week report_date

. egen ts = fill(0 1)

. xtset state_end_week ts
       panel variable:  state_end_week (unbalanced)
        time variable:  ts, 0 to 6836
                delta:  1 unit

. gen growth_per_day = (log(f.total_deaths) - log(total_deaths))/(f.days_to_report - days_to_report)
(963 missing values generated)

. bys weeks_to_report: sum growth_per_day

-----------------------------------------------------------------------------------------------------
-> weeks_to_report = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
growth_per~y |        225    .4984863    .9404318          0   4.377014

-----------------------------------------------------------------------------------------------------
-> weeks_to_report = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
growth_per~y |        359    .1410337    .2799355   -.002845   2.639057

-----------------------------------------------------------------------------------------------------
-> weeks_to_report = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
growth_per~y |        364    .0408358    .0835715          0    .638659

-----------------------------------------------------------------------------------------------------
-> weeks_to_report = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
growth_per~y |        370    .0297896    .1560184  -.0004299   2.054124

-----------------------------------------------------------------------------------------------------
-> weeks_to_report = 4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
growth_per~y |        371    .0134113    .0670476  -.0012048   1.105324

-----------------------------------------------------------------------------------------------------
-> weeks_to_report = 5

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
growth_per~y |        371    .0061068    .0301701  -.0030817   .4274915

-----------------------------------------------------------------------------------------------------
-> weeks_to_report = 6

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
growth_per~y |        371    .0041812    .0217345  -.0006764   .3423208

-----------------------------------------------------------------------------------------------------
-> weeks_to_report = 7

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
growth_per~y |        370    .0035058    .0190145  -.0005831   .2530777

-----------------------------------------------------------------------------------------------------
-> weeks_to_report = 8

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
growth_per~y |        371    .0035578    .0329658  -.0006952   .6088754

-----------------------------------------------------------------------------------------------------
-> weeks_to_report = 9

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
growth_per~y |        370    .0017027     .008726  -.0014306   .1125882

-----------------------------------------------------------------------------------------------------
-> weeks_to_report = 10

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
growth_per~y |        371     .003402    .0327709  -.0007244   .5867435

-----------------------------------------------------------------------------------------------------
-> weeks_to_report = 11

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
growth_per~y |        371    .0015137    .0108578  -.0008753   .1583683

-----------------------------------------------------------------------------------------------------
-> weeks_to_report = 12

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
growth_per~y |        371    .0007515    .0052539  -.0009667    .091575

-----------------------------------------------------------------------------------------------------
-> weeks_to_report = 13

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
growth_per~y |        371    .0003485    .0013964  -.0004877   .0163143

-----------------------------------------------------------------------------------------------------
-> weeks_to_report = 14

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
growth_per~y |        318     .000181     .001146          0   .0187837

-----------------------------------------------------------------------------------------------------
-> weeks_to_report = 15

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
growth_per~y |        318    .0001298    .0003907  -.0001141   .0027739

-----------------------------------------------------------------------------------------------------
-> weeks_to_report = 16

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
growth_per~y |        212    .0001652    .0010998  -.0001131   .0147248

-----------------------------------------------------------------------------------------------------
-> weeks_to_report = 17

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
growth_per~y |          0


. 
. gen loglog_days_to_report = log(log(days_to_report))

. 
. reg growth_per_day c.loglog_days_to_report##b0.fips

      Source |       SS           df       MS      Number of obs   =     5,874
-------------+----------------------------------   F(105, 5768)    =     10.99
       Model |  49.6770746       105  .473114997   Prob > F        =    0.0000
    Residual |  248.261527     5,768   .04304118   R-squared       =    0.1667
-------------+----------------------------------   Adj R-squared   =    0.1516
       Total |  297.938602     5,873  .050730223   Root MSE        =    .20746

----------------------------------------------------------------------------------------------
              growth_per_day |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
       loglog_days_to_report |  -.3241628   .0672877    -4.82   0.000    -.4560719   -.1922537
                             |
                        fips |
                          1  |   .0814363    .126432     0.64   0.520    -.1664178    .3292904
                          2  |  -.2536223   .1375364    -1.84   0.065    -.5232452    .0160006
                          4  |    .219571    .126432     1.74   0.082    -.0282831    .4674251
                          5  |  -.0771332    .126432    -0.61   0.542    -.3249873    .1707209
                          6  |  -.0380292    .126432    -0.30   0.764    -.2858833    .2098249
                          8  |   .0442075    .126432     0.35   0.727    -.2036466    .2920616
                          9  |  -.1310109   .1676507    -0.78   0.435    -.4596693    .1976474
                         10  |   -.035367   .1422537    -0.25   0.804    -.3142375    .2435036
                         11  |  -.0139951   .1375364    -0.10   0.919    -.2836181    .2556278
                         12  |   .0141139    .126432     0.11   0.911    -.2337402     .261968
                         13  |   .1094385    .126432     0.87   0.387    -.1384156    .3572926
                         15  |   .0520964    .126432     0.41   0.680    -.1957577    .2999505
                         16  |   .0338374    .126432     0.27   0.789    -.2140167    .2816915
                         17  |  -.0341767    .126432    -0.27   0.787    -.2820308    .2136774
                         18  |   .3538783    .126432     2.80   0.005     .1060242    .6017324
                         19  |  -.1007144    .126432    -0.80   0.426    -.3485685    .1471397
                         20  |  -.0667157    .126432    -0.53   0.598    -.3145698    .1811384
                         21  |   .0170939    .126432     0.14   0.892    -.2307602     .264948
                         22  |   .1920036    .126432     1.52   0.129    -.0558505    .4398577
                         23  |  -.1606641    .126432    -1.27   0.204    -.4085183      .08719
                         24  |  -.1298905    .126432    -1.03   0.304    -.3777446    .1179636
                         25  |  -.1211759    .126432    -0.96   0.338      -.36903    .1266782
                         26  |   .0130482   .1375364     0.09   0.924    -.2565747    .2826712
                         27  |  -.1309652    .126432    -1.04   0.300    -.3788193     .116889
                         28  |   -.242461   .1375364    -1.76   0.078     -.512084    .0271619
                         29  |  -.0056811    .126432    -0.04   0.964    -.2535352     .242173
                         30  |  -.3827768   .1466389    -2.61   0.009    -.6702441   -.0953095
                         31  |  -.0668893    .126432    -0.53   0.597    -.3147434    .1809648
                         32  |   .1804755    .126432     1.43   0.154    -.0673786    .4283296
                         33  |  -.1556927    .126432    -1.23   0.218    -.4035468    .0921614
                         34  |   .1635138    .126432     1.29   0.196    -.0843403    .4113679
                         35  |   -.158754   .1375364    -1.15   0.248    -.4283769    .1108689
                         36  |   -.137394    .126432    -1.09   0.277    -.3852481    .1104601
                         37  |   .2583125   .2413904     1.07   0.285    -.2149033    .7315282
                         38  |  -.4169109    .126432    -3.30   0.001     -.664765   -.1690568
                         39  |   .4448952    .126432     3.52   0.000     .1970411    .6927493
                         40  |  -.1664271   .1375364    -1.21   0.226      -.43605    .1031959
                         41  |   .0505054    .126432     0.40   0.690    -.1973487    .2983595
                         42  |   .0200466    .126432     0.16   0.874    -.2278075    .2679007
                         44  |  -.1337423   .1375364    -0.97   0.331    -.4033652    .1358807
                         45  |   .0675393    .126432     0.53   0.593    -.1803148    .3153934
                         46  |  -.2977653   .1375364    -2.16   0.030    -.5673882   -.0281423
                         47  |   .0546727    .126432     0.43   0.665    -.1931814    .3025268
                         48  |   .2500595    .126432     1.98   0.048     .0022054    .4979136
                         49  |  -.2689499    .126432    -2.13   0.033     -.516804   -.0210957
                         50  |  -.2958951    .126432    -2.34   0.019    -.5437492    -.048041
                         51  |  -.1572731   .1375364    -1.14   0.253     -.426896    .1123499
                         53  |  -.2871107    .126432    -2.27   0.023    -.5349648   -.0392566
                         54  |   .3868682   .1666069     2.32   0.020      .060256    .7134803
                         55  |   .0417906    .126432     0.33   0.741    -.2060635    .2896447
                         56  |  -.1373656    .126432    -1.09   0.277    -.3852197    .1104885
                         72  |  -.1441937   .1375364    -1.05   0.294    -.4138166    .1254293
                             |
fips#c.loglog_days_to_report |
                          1  |  -.0577723   .0951591    -0.61   0.544      -.24432    .1287753
                          2  |   .1858038    .102999     1.80   0.071     -.016113    .3877206
                          4  |   -.160176   .0951591    -1.68   0.092    -.3467237    .0263716
                          5  |   .0537432   .0951591     0.56   0.572    -.1328045    .2402908
                          6  |   .0270698   .0951591     0.28   0.776    -.1594778    .2136175
                          8  |  -.0338152   .0951591    -0.36   0.722    -.2203629    .1527324
                          9  |   .1459943   .1233229     1.18   0.237    -.0957648    .3877535
                         10  |   .0347814   .1062513     0.33   0.743     -.173511    .2430738
                         11  |   .0226424    .102999     0.22   0.826    -.1792743    .2245592
                         12  |  -.0119154   .0951591    -0.13   0.900    -.1984631    .1746322
                         13  |  -.0757532   .0951591    -0.80   0.426    -.2623009    .1107944
                         15  |  -.0393878   .0951591    -0.41   0.679    -.2259354    .1471599
                         16  |  -.0267733   .0951591    -0.28   0.778    -.2133209    .1597744
                         17  |   .0232163   .0951591     0.24   0.807    -.1633314    .2097639
                         18  |  -.2532408   .0951591    -2.66   0.008    -.4397884   -.0666931
                         19  |   .0716465   .0951591     0.75   0.452    -.1149012    .2581941
                         20  |   .0455302   .0951591     0.48   0.632    -.1410175    .2320778
                         21  |  -.0103594   .0951591    -0.11   0.913    -.1969071    .1761882
                         22  |  -.1347525   .0951591    -1.42   0.157    -.3213002    .0517951
                         23  |   .1119052   .0951591     1.18   0.240    -.0746424    .2984529
                         24  |   .0920991   .0951591     0.97   0.333    -.0944485    .2786468
                         25  |   .0840828   .0951591     0.88   0.377    -.1024648    .2706305
                         26  |  -.0055006    .102999    -0.05   0.957    -.2074174    .1964162
                         27  |   .0912478   .0951591     0.96   0.338    -.0952999    .2777954
                         28  |    .176807    .102999     1.72   0.086    -.0251098    .3787237
                         29  |   .0035009   .0951591     0.04   0.971    -.1830467    .1900486
                         30  |   .2737569   .1092396     2.51   0.012     .0596063    .4879075
                         31  |   .0508709   .0951591     0.53   0.593    -.1356768    .2374185
                         32  |  -.1306595   .0951591    -1.37   0.170    -.3172071    .0558882
                         33  |   .1082081   .0951591     1.14   0.256    -.0783395    .2947558
                         34  |   -.116371   .0951591    -1.22   0.221    -.3029186    .0701767
                         35  |   .1174829    .102999     1.14   0.254    -.0844339    .3193996
                         36  |   .0966945   .0951591     1.02   0.310    -.0898531    .2832422
                         37  |   -.147735   .1734517    -0.85   0.394    -.4877655    .1922955
                         38  |   .2965718   .0951591     3.12   0.002     .1100242    .4831195
                         39  |  -.3150841   .0951591    -3.31   0.001    -.5016318   -.1285365
                         40  |   .1261896    .102999     1.23   0.221    -.0757272    .3281064
                         41  |  -.0351222   .0951591    -0.37   0.712    -.2216698    .1514255
                         42  |  -.0148718   .0951591    -0.16   0.876    -.2014194    .1716759
                         44  |   .1062678    .102999     1.03   0.302     -.095649    .3081846
                         45  |  -.0516229   .0951591    -0.54   0.588    -.2381705    .1349248
                         46  |   .2148556    .102999     2.09   0.037     .0129389    .4167724
                         47  |  -.0404082   .0951591    -0.42   0.671    -.2269559    .1461394
                         48  |  -.1788983   .0951591    -1.88   0.060    -.3654459    .0076494
                         49  |   .1900068   .0951591     2.00   0.046     .0034592    .3765545
                         50  |   .2092558   .0951591     2.20   0.028     .0227081    .3958034
                         51  |   .1143709    .102999     1.11   0.267    -.0875459    .3162876
                         53  |   .2082184   .0951591     2.19   0.029     .0216708    .3947661
                         54  |  -.2554371   .1232041    -2.07   0.038    -.4969633   -.0139108
                         55  |  -.0321061   .0951591    -0.34   0.736    -.2186537    .1544416
                         56  |   .1005932   .0951591     1.06   0.291    -.0859544    .2871409
                         72  |   .1190567    .102999     1.16   0.248    -.0828601    .3209735
                             |
                       _cons |   .4559875   .0894009     5.10   0.000     .2807282    .6312468
----------------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\favero\AppData\Local\Temp\STD7174_000000.tmp"

. reg growth_per_day c.loglog_days_to_report##b0.fips

      Source |       SS           df       MS      Number of obs   =     5,874
-------------+----------------------------------   F(105, 5768)    =     10.99
       Model |  49.6770746       105  .473114997   Prob > F        =    0.0000
    Residual |  248.261527     5,768   .04304118   R-squared       =    0.1667
-------------+----------------------------------   Adj R-squared   =    0.1516
       Total |  297.938602     5,873  .050730223   Root MSE        =    .20746

----------------------------------------------------------------------------------------------
              growth_per_day |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
       loglog_days_to_report |  -.3241628   .0672877    -4.82   0.000    -.4560719   -.1922537
                             |
                        fips |
                          1  |   .0814363    .126432     0.64   0.520    -.1664178    .3292904
                          2  |  -.2536223   .1375364    -1.84   0.065    -.5232452    .0160006
                          4  |    .219571    .126432     1.74   0.082    -.0282831    .4674251
                          5  |  -.0771332    .126432    -0.61   0.542    -.3249873    .1707209
                          6  |  -.0380292    .126432    -0.30   0.764    -.2858833    .2098249
                          8  |   .0442075    .126432     0.35   0.727    -.2036466    .2920616
                          9  |  -.1310109   .1676507    -0.78   0.435    -.4596693    .1976474
                         10  |   -.035367   .1422537    -0.25   0.804    -.3142375    .2435036
                         11  |  -.0139951   .1375364    -0.10   0.919    -.2836181    .2556278
                         12  |   .0141139    .126432     0.11   0.911    -.2337402     .261968
                         13  |   .1094385    .126432     0.87   0.387    -.1384156    .3572926
                         15  |   .0520964    .126432     0.41   0.680    -.1957577    .2999505
                         16  |   .0338374    .126432     0.27   0.789    -.2140167    .2816915
                         17  |  -.0341767    .126432    -0.27   0.787    -.2820308    .2136774
                         18  |   .3538783    .126432     2.80   0.005     .1060242    .6017324
                         19  |  -.1007144    .126432    -0.80   0.426    -.3485685    .1471397
                         20  |  -.0667157    .126432    -0.53   0.598    -.3145698    .1811384
                         21  |   .0170939    .126432     0.14   0.892    -.2307602     .264948
                         22  |   .1920036    .126432     1.52   0.129    -.0558505    .4398577
                         23  |  -.1606641    .126432    -1.27   0.204    -.4085183      .08719
                         24  |  -.1298905    .126432    -1.03   0.304    -.3777446    .1179636
                         25  |  -.1211759    .126432    -0.96   0.338      -.36903    .1266782
                         26  |   .0130482   .1375364     0.09   0.924    -.2565747    .2826712
                         27  |  -.1309652    .126432    -1.04   0.300    -.3788193     .116889
                         28  |   -.242461   .1375364    -1.76   0.078     -.512084    .0271619
                         29  |  -.0056811    .126432    -0.04   0.964    -.2535352     .242173
                         30  |  -.3827768   .1466389    -2.61   0.009    -.6702441   -.0953095
                         31  |  -.0668893    .126432    -0.53   0.597    -.3147434    .1809648
                         32  |   .1804755    .126432     1.43   0.154    -.0673786    .4283296
                         33  |  -.1556927    .126432    -1.23   0.218    -.4035468    .0921614
                         34  |   .1635138    .126432     1.29   0.196    -.0843403    .4113679
                         35  |   -.158754   .1375364    -1.15   0.248    -.4283769    .1108689
                         36  |   -.137394    .126432    -1.09   0.277    -.3852481    .1104601
                         37  |   .2583125   .2413904     1.07   0.285    -.2149033    .7315282
                         38  |  -.4169109    .126432    -3.30   0.001     -.664765   -.1690568
                         39  |   .4448952    .126432     3.52   0.000     .1970411    .6927493
                         40  |  -.1664271   .1375364    -1.21   0.226      -.43605    .1031959
                         41  |   .0505054    .126432     0.40   0.690    -.1973487    .2983595
                         42  |   .0200466    .126432     0.16   0.874    -.2278075    .2679007
                         44  |  -.1337423   .1375364    -0.97   0.331    -.4033652    .1358807
                         45  |   .0675393    .126432     0.53   0.593    -.1803148    .3153934
                         46  |  -.2977653   .1375364    -2.16   0.030    -.5673882   -.0281423
                         47  |   .0546727    .126432     0.43   0.665    -.1931814    .3025268
                         48  |   .2500595    .126432     1.98   0.048     .0022054    .4979136
                         49  |  -.2689499    .126432    -2.13   0.033     -.516804   -.0210957
                         50  |  -.2958951    .126432    -2.34   0.019    -.5437492    -.048041
                         51  |  -.1572731   .1375364    -1.14   0.253     -.426896    .1123499
                         53  |  -.2871107    .126432    -2.27   0.023    -.5349648   -.0392566
                         54  |   .3868682   .1666069     2.32   0.020      .060256    .7134803
                         55  |   .0417906    .126432     0.33   0.741    -.2060635    .2896447
                         56  |  -.1373656    .126432    -1.09   0.277    -.3852197    .1104885
                         72  |  -.1441937   .1375364    -1.05   0.294    -.4138166    .1254293
                             |
fips#c.loglog_days_to_report |
                          1  |  -.0577723   .0951591    -0.61   0.544      -.24432    .1287753
                          2  |   .1858038    .102999     1.80   0.071     -.016113    .3877206
                          4  |   -.160176   .0951591    -1.68   0.092    -.3467237    .0263716
                          5  |   .0537432   .0951591     0.56   0.572    -.1328045    .2402908
                          6  |   .0270698   .0951591     0.28   0.776    -.1594778    .2136175
                          8  |  -.0338152   .0951591    -0.36   0.722    -.2203629    .1527324
                          9  |   .1459943   .1233229     1.18   0.237    -.0957648    .3877535
                         10  |   .0347814   .1062513     0.33   0.743     -.173511    .2430738
                         11  |   .0226424    .102999     0.22   0.826    -.1792743    .2245592
                         12  |  -.0119154   .0951591    -0.13   0.900    -.1984631    .1746322
                         13  |  -.0757532   .0951591    -0.80   0.426    -.2623009    .1107944
                         15  |  -.0393878   .0951591    -0.41   0.679    -.2259354    .1471599
                         16  |  -.0267733   .0951591    -0.28   0.778    -.2133209    .1597744
                         17  |   .0232163   .0951591     0.24   0.807    -.1633314    .2097639
                         18  |  -.2532408   .0951591    -2.66   0.008    -.4397884   -.0666931
                         19  |   .0716465   .0951591     0.75   0.452    -.1149012    .2581941
                         20  |   .0455302   .0951591     0.48   0.632    -.1410175    .2320778
                         21  |  -.0103594   .0951591    -0.11   0.913    -.1969071    .1761882
                         22  |  -.1347525   .0951591    -1.42   0.157    -.3213002    .0517951
                         23  |   .1119052   .0951591     1.18   0.240    -.0746424    .2984529
                         24  |   .0920991   .0951591     0.97   0.333    -.0944485    .2786468
                         25  |   .0840828   .0951591     0.88   0.377    -.1024648    .2706305
                         26  |  -.0055006    .102999    -0.05   0.957    -.2074174    .1964162
                         27  |   .0912478   .0951591     0.96   0.338    -.0952999    .2777954
                         28  |    .176807    .102999     1.72   0.086    -.0251098    .3787237
                         29  |   .0035009   .0951591     0.04   0.971    -.1830467    .1900486
                         30  |   .2737569   .1092396     2.51   0.012     .0596063    .4879075
                         31  |   .0508709   .0951591     0.53   0.593    -.1356768    .2374185
                         32  |  -.1306595   .0951591    -1.37   0.170    -.3172071    .0558882
                         33  |   .1082081   .0951591     1.14   0.256    -.0783395    .2947558
                         34  |   -.116371   .0951591    -1.22   0.221    -.3029186    .0701767
                         35  |   .1174829    .102999     1.14   0.254    -.0844339    .3193996
                         36  |   .0966945   .0951591     1.02   0.310    -.0898531    .2832422
                         37  |   -.147735   .1734517    -0.85   0.394    -.4877655    .1922955
                         38  |   .2965718   .0951591     3.12   0.002     .1100242    .4831195
                         39  |  -.3150841   .0951591    -3.31   0.001    -.5016318   -.1285365
                         40  |   .1261896    .102999     1.23   0.221    -.0757272    .3281064
                         41  |  -.0351222   .0951591    -0.37   0.712    -.2216698    .1514255
                         42  |  -.0148718   .0951591    -0.16   0.876    -.2014194    .1716759
                         44  |   .1062678    .102999     1.03   0.302     -.095649    .3081846
                         45  |  -.0516229   .0951591    -0.54   0.588    -.2381705    .1349248
                         46  |   .2148556    .102999     2.09   0.037     .0129389    .4167724
                         47  |  -.0404082   .0951591    -0.42   0.671    -.2269559    .1461394
                         48  |  -.1788983   .0951591    -1.88   0.060    -.3654459    .0076494
                         49  |   .1900068   .0951591     2.00   0.046     .0034592    .3765545
                         50  |   .2092558   .0951591     2.20   0.028     .0227081    .3958034
                         51  |   .1143709    .102999     1.11   0.267    -.0875459    .3162876
                         53  |   .2082184   .0951591     2.19   0.029     .0216708    .3947661
                         54  |  -.2554371   .1232041    -2.07   0.038    -.4969633   -.0139108
                         55  |  -.0321061   .0951591    -0.34   0.736    -.2186537    .1544416
                         56  |   .1005932   .0951591     1.06   0.291    -.0859544    .2871409
                         72  |   .1190567    .102999     1.16   0.248    -.0828601    .3209735
                             |
                       _cons |   .4559875   .0894009     5.10   0.000     .2807282    .6312468
----------------------------------------------------------------------------------------------

. 
. 
. gen state_delay = 0 if state_id==1
state_id not found
r(111);

end of do-file

r(111);

. do "C:\Users\favero\AppData\Local\Temp\STD7174_000000.tmp"

. drop if fips==0
(129 observations deleted)

. drop if  state == "Connecticut" | state == "North Carolina" | state == "Puerto Rico"
(387 observations deleted)

. egen state_id=group(fips)

. reg growth_per_day c.loglog_days_to_report##b1.fips

      Source |       SS           df       MS      Number of obs   =     5,457
-------------+----------------------------------   F(97, 5359)     =     11.31
       Model |  47.5835109        97  .490551659   Prob > F        =    0.0000
    Residual |  232.371679     5,359  .043361015   R-squared       =    0.1700
-------------+----------------------------------   Adj R-squared   =    0.1549
       Total |   279.95519     5,456  .051311435   Root MSE        =    .20823

----------------------------------------------------------------------------------------------
              growth_per_day |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
       loglog_days_to_report |  -.3819351   .0675372    -5.66   0.000    -.5143356   -.2495347
                             |
                        fips |
                          2  |  -.3350586   .1380465    -2.43   0.015    -.6056858   -.0644314
                          4  |   .1381347   .1269008     1.09   0.276    -.1106425     .386912
                          5  |  -.1585695   .1269008    -1.25   0.212    -.4073467    .0902078
                          6  |  -.1194655   .1269008    -0.94   0.347    -.3682427    .1293118
                          8  |  -.0372288   .1269008    -0.29   0.769     -.286006    .2115485
                         10  |  -.1168032   .1427812    -0.82   0.413    -.3967125     .163106
                         11  |  -.0954314   .1380465    -0.69   0.489    -.3660586    .1751958
                         12  |  -.0673223   .1269008    -0.53   0.596    -.3160996    .1814549
                         13  |   .0280022   .1269008     0.22   0.825    -.2207751    .2767795
                         15  |  -.0293399   .1269008    -0.23   0.817    -.2781172    .2194374
                         16  |  -.0475989   .1269008    -0.38   0.708    -.2963761    .2011784
                         17  |   -.115613   .1269008    -0.91   0.362    -.3643903    .1331643
                         18  |    .272442   .1269008     2.15   0.032     .0236648    .5212193
                         19  |  -.1821507   .1269008    -1.44   0.151     -.430928    .0666266
                         20  |  -.1481519   .1269008    -1.17   0.243    -.3969292    .1006253
                         21  |  -.0643423   .1269008    -0.51   0.612    -.3131196    .1844349
                         22  |   .1105673   .1269008     0.87   0.384    -.1382099    .3593446
                         23  |  -.2421004   .1269008    -1.91   0.056    -.4908777    .0066769
                         24  |  -.2113268   .1269008    -1.67   0.096     -.460104    .0374505
                         25  |  -.2026122   .1269008    -1.60   0.110    -.4513895    .0461651
                         26  |  -.0683881   .1380465    -0.50   0.620    -.3390153    .2022391
                         27  |  -.2124014   .1269008    -1.67   0.094    -.4611787    .0363759
                         28  |  -.3238973   .1380465    -2.35   0.019    -.5945245   -.0532701
                         29  |  -.0871174   .1269008    -0.69   0.492    -.3358947    .1616599
                         30  |  -.4642131   .1471827    -3.15   0.002    -.7527511   -.1756751
                         31  |  -.1483256   .1269008    -1.17   0.243    -.3971028    .1004517
                         32  |   .0990392   .1269008     0.78   0.435    -.1497381    .3478165
                         33  |   -.237129   .1269008    -1.87   0.062    -.4859063    .0116483
                         34  |   .0820775   .1269008     0.65   0.518    -.1666998    .3308548
                         35  |  -.2401903   .1380465    -1.74   0.082    -.5108175    .0304369
                         36  |  -.2188302   .1269008    -1.72   0.085    -.4676075     .029947
                         38  |  -.4983472   .1269008    -3.93   0.000    -.7471245   -.2495699
                         39  |    .363459   .1269008     2.86   0.004     .1146817    .6122362
                         40  |  -.2478634   .1380465    -1.80   0.073    -.5184906    .0227638
                         41  |  -.0309309   .1269008    -0.24   0.807    -.2797081    .2178464
                         42  |  -.0613897   .1269008    -0.48   0.629     -.310167    .1873876
                         44  |  -.2151785   .1380465    -1.56   0.119    -.4858057    .0554487
                         45  |   -.013897   .1269008    -0.11   0.913    -.2626743    .2348803
                         46  |  -.3792015   .1380465    -2.75   0.006    -.6498287   -.1085743
                         47  |  -.0267636   .1269008    -0.21   0.833    -.2755409    .2220137
                         48  |   .1686232   .1269008     1.33   0.184    -.0801541    .4174005
                         49  |  -.3503861   .1269008    -2.76   0.006    -.5991634   -.1016089
                         50  |  -.3773314   .1269008    -2.97   0.003    -.6261086   -.1285541
                         51  |  -.2387094   .1380465    -1.73   0.084    -.5093366    .0319178
                         53  |   -.368547   .1269008    -2.90   0.004    -.6173242   -.1197697
                         54  |   .3054319   .1672248     1.83   0.068    -.0223968    .6332605
                         55  |  -.0396457   .1269008    -0.31   0.755     -.288423    .2091316
                         56  |  -.2188018   .1269008    -1.72   0.085    -.4675791    .0299754
                             |
fips#c.loglog_days_to_report |
                          2  |   .2435761    .103381     2.36   0.019     .0409073     .446245
                          4  |  -.1024037   .0955121    -1.07   0.284    -.2896462    .0848388
                          5  |   .1115155   .0955121     1.17   0.243     -.075727     .298758
                          6  |   .0848421   .0955121     0.89   0.374    -.1024003    .2720846
                          8  |   .0239571   .0955121     0.25   0.802    -.1632854    .2111996
                         10  |   .0925537   .1066453     0.87   0.386    -.1165145     .301622
                         11  |   .0804148    .103381     0.78   0.437    -.1222541    .2830836
                         12  |   .0458569   .0955121     0.48   0.631    -.1413856    .2330994
                         13  |  -.0179809   .0955121    -0.19   0.851    -.2052234    .1692616
                         15  |   .0183845   .0955121     0.19   0.847    -.1688579     .205627
                         16  |    .030999   .0955121     0.32   0.746    -.1562434    .2182415
                         17  |   .0809886   .0955121     0.85   0.397    -.1062539    .2682311
                         18  |  -.1954684   .0955121    -2.05   0.041    -.3827109    -.008226
                         19  |   .1294188   .0955121     1.35   0.175    -.0578237    .3166613
                         20  |   .1033025   .0955121     1.08   0.279    -.0839399     .290545
                         21  |   .0474129   .0955121     0.50   0.620    -.1398296    .2346554
                         22  |  -.0769802   .0955121    -0.81   0.420    -.2642227    .1102623
                         23  |   .1696776   .0955121     1.78   0.076    -.0175649    .3569201
                         24  |   .1498714   .0955121     1.57   0.117     -.037371    .3371139
                         25  |   .1418552   .0955121     1.49   0.138    -.0453873    .3290977
                         26  |   .0522717    .103381     0.51   0.613    -.1503971    .2549406
                         27  |   .1490201   .0955121     1.56   0.119    -.0382224    .3362626
                         28  |   .2345793    .103381     2.27   0.023     .0319105    .4372481
                         29  |   .0612733   .0955121     0.64   0.521    -.1259692    .2485157
                         30  |   .3315292   .1096447     3.02   0.003      .116581    .5464775
                         31  |   .1086432   .0955121     1.14   0.255    -.0785993    .2958857
                         32  |  -.0728872   .0955121    -0.76   0.445    -.2601296    .1143553
                         33  |   .1659804   .0955121     1.74   0.082     -.021262    .3532229
                         34  |  -.0585987   .0955121    -0.61   0.540    -.2458411    .1286438
                         35  |   .1752552    .103381     1.70   0.090    -.0274136     .377924
                         36  |   .1544669   .0955121     1.62   0.106    -.0327756    .3417093
                         38  |   .3543441   .0955121     3.71   0.000     .1671017    .5415866
                         39  |  -.2573118   .0955121    -2.69   0.007    -.4445543   -.0700693
                         40  |   .1839619    .103381     1.78   0.075    -.0187069    .3866308
                         41  |   .0226501   .0955121     0.24   0.813    -.1645923    .2098926
                         42  |   .0429005   .0955121     0.45   0.653    -.1443419     .230143
                         44  |   .1640401    .103381     1.59   0.113    -.0386287     .366709
                         45  |   .0061494   .0955121     0.06   0.949     -.181093    .1933919
                         46  |    .272628    .103381     2.64   0.008     .0699591    .4752968
                         47  |   .0173641   .0955121     0.18   0.856    -.1698784    .2046066
                         48  |  -.1211259   .0955121    -1.27   0.205    -.3083684    .0661165
                         49  |   .2477792   .0955121     2.59   0.010     .0605367    .4350216
                         50  |   .2670281   .0955121     2.80   0.005     .0797856    .4542706
                         51  |   .1721432    .103381     1.67   0.096    -.0305256     .374812
                         53  |   .2659908   .0955121     2.78   0.005     .0787483    .4532332
                         54  |  -.1976647    .123661    -1.60   0.110    -.4400906    .0447611
                         55  |   .0256662   .0955121     0.27   0.788    -.1615762    .2129087
                         56  |   .1583656   .0955121     1.66   0.097    -.0288769     .345608
                             |
                       _cons |   .5374238   .0897325     5.99   0.000     .3615117    .7133359
----------------------------------------------------------------------------------------------

. gen state_delay = 0 if state_id==1
(6,192 missing values generated)

. forvalues i = 2/48 {
  2.     replace state_delay = _b[`i'.state_id] if state_id == `i'
  3. }
[2.state_id] not found
r(111);

end of do-file

r(111);

. do "C:\Users\favero\AppData\Local\Temp\STD7174_000000.tmp"

. reg growth_per_day c.loglog_days_to_report##b1.state_id

      Source |       SS           df       MS      Number of obs   =     5,457
-------------+----------------------------------   F(97, 5359)     =     11.31
       Model |  47.5835109        97  .490551659   Prob > F        =    0.0000
    Residual |  232.371679     5,359  .043361015   R-squared       =    0.1700
-------------+----------------------------------   Adj R-squared   =    0.1549
       Total |   279.95519     5,456  .051311435   Root MSE        =    .20823

--------------------------------------------------------------------------------------------------
                  growth_per_day |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------------------+----------------------------------------------------------------
           loglog_days_to_report |  -.3819351   .0675372    -5.66   0.000    -.5143356   -.2495347
                                 |
                        state_id |
                              2  |  -.3350586   .1380465    -2.43   0.015    -.6056858   -.0644314
                              3  |   .1381347   .1269008     1.09   0.276    -.1106425     .386912
                              4  |  -.1585695   .1269008    -1.25   0.212    -.4073467    .0902078
                              5  |  -.1194655   .1269008    -0.94   0.347    -.3682427    .1293118
                              6  |  -.0372288   .1269008    -0.29   0.769     -.286006    .2115485
                              7  |  -.1168032   .1427812    -0.82   0.413    -.3967125     .163106
                              8  |  -.0954314   .1380465    -0.69   0.489    -.3660586    .1751958
                              9  |  -.0673223   .1269008    -0.53   0.596    -.3160996    .1814549
                             10  |   .0280022   .1269008     0.22   0.825    -.2207751    .2767795
                             11  |  -.0293399   .1269008    -0.23   0.817    -.2781172    .2194374
                             12  |  -.0475989   .1269008    -0.38   0.708    -.2963761    .2011784
                             13  |   -.115613   .1269008    -0.91   0.362    -.3643903    .1331643
                             14  |    .272442   .1269008     2.15   0.032     .0236648    .5212193
                             15  |  -.1821507   .1269008    -1.44   0.151     -.430928    .0666266
                             16  |  -.1481519   .1269008    -1.17   0.243    -.3969292    .1006253
                             17  |  -.0643423   .1269008    -0.51   0.612    -.3131196    .1844349
                             18  |   .1105673   .1269008     0.87   0.384    -.1382099    .3593446
                             19  |  -.2421004   .1269008    -1.91   0.056    -.4908777    .0066769
                             20  |  -.2113268   .1269008    -1.67   0.096     -.460104    .0374505
                             21  |  -.2026122   .1269008    -1.60   0.110    -.4513895    .0461651
                             22  |  -.0683881   .1380465    -0.50   0.620    -.3390153    .2022391
                             23  |  -.2124014   .1269008    -1.67   0.094    -.4611787    .0363759
                             24  |  -.3238973   .1380465    -2.35   0.019    -.5945245   -.0532701
                             25  |  -.0871174   .1269008    -0.69   0.492    -.3358947    .1616599
                             26  |  -.4642131   .1471827    -3.15   0.002    -.7527511   -.1756751
                             27  |  -.1483256   .1269008    -1.17   0.243    -.3971028    .1004517
                             28  |   .0990392   .1269008     0.78   0.435    -.1497381    .3478165
                             29  |   -.237129   .1269008    -1.87   0.062    -.4859063    .0116483
                             30  |   .0820775   .1269008     0.65   0.518    -.1666998    .3308548
                             31  |  -.2401903   .1380465    -1.74   0.082    -.5108175    .0304369
                             32  |  -.2188302   .1269008    -1.72   0.085    -.4676075     .029947
                             33  |  -.4983472   .1269008    -3.93   0.000    -.7471245   -.2495699
                             34  |    .363459   .1269008     2.86   0.004     .1146817    .6122362
                             35  |  -.2478634   .1380465    -1.80   0.073    -.5184906    .0227638
                             36  |  -.0309309   .1269008    -0.24   0.807    -.2797081    .2178464
                             37  |  -.0613897   .1269008    -0.48   0.629     -.310167    .1873876
                             38  |  -.2151785   .1380465    -1.56   0.119    -.4858057    .0554487
                             39  |   -.013897   .1269008    -0.11   0.913    -.2626743    .2348803
                             40  |  -.3792015   .1380465    -2.75   0.006    -.6498287   -.1085743
                             41  |  -.0267636   .1269008    -0.21   0.833    -.2755409    .2220137
                             42  |   .1686232   .1269008     1.33   0.184    -.0801541    .4174005
                             43  |  -.3503861   .1269008    -2.76   0.006    -.5991634   -.1016089
                             44  |  -.3773314   .1269008    -2.97   0.003    -.6261086   -.1285541
                             45  |  -.2387094   .1380465    -1.73   0.084    -.5093366    .0319178
                             46  |   -.368547   .1269008    -2.90   0.004    -.6173242   -.1197697
                             47  |   .3054319   .1672248     1.83   0.068    -.0223968    .6332605
                             48  |  -.0396457   .1269008    -0.31   0.755     -.288423    .2091316
                             49  |  -.2188018   .1269008    -1.72   0.085    -.4675791    .0299754
                                 |
state_id#c.loglog_days_to_report |
                              2  |   .2435761    .103381     2.36   0.019     .0409073     .446245
                              3  |  -.1024037   .0955121    -1.07   0.284    -.2896462    .0848388
                              4  |   .1115155   .0955121     1.17   0.243     -.075727     .298758
                              5  |   .0848421   .0955121     0.89   0.374    -.1024003    .2720846
                              6  |   .0239571   .0955121     0.25   0.802    -.1632854    .2111996
                              7  |   .0925537   .1066453     0.87   0.386    -.1165145     .301622
                              8  |   .0804148    .103381     0.78   0.437    -.1222541    .2830836
                              9  |   .0458569   .0955121     0.48   0.631    -.1413856    .2330994
                             10  |  -.0179809   .0955121    -0.19   0.851    -.2052234    .1692616
                             11  |   .0183845   .0955121     0.19   0.847    -.1688579     .205627
                             12  |    .030999   .0955121     0.32   0.746    -.1562434    .2182415
                             13  |   .0809886   .0955121     0.85   0.397    -.1062539    .2682311
                             14  |  -.1954684   .0955121    -2.05   0.041    -.3827109    -.008226
                             15  |   .1294188   .0955121     1.35   0.175    -.0578237    .3166613
                             16  |   .1033025   .0955121     1.08   0.279    -.0839399     .290545
                             17  |   .0474129   .0955121     0.50   0.620    -.1398296    .2346554
                             18  |  -.0769802   .0955121    -0.81   0.420    -.2642227    .1102623
                             19  |   .1696776   .0955121     1.78   0.076    -.0175649    .3569201
                             20  |   .1498714   .0955121     1.57   0.117     -.037371    .3371139
                             21  |   .1418552   .0955121     1.49   0.138    -.0453873    .3290977
                             22  |   .0522717    .103381     0.51   0.613    -.1503971    .2549406
                             23  |   .1490201   .0955121     1.56   0.119    -.0382224    .3362626
                             24  |   .2345793    .103381     2.27   0.023     .0319105    .4372481
                             25  |   .0612733   .0955121     0.64   0.521    -.1259692    .2485157
                             26  |   .3315292   .1096447     3.02   0.003      .116581    .5464775
                             27  |   .1086432   .0955121     1.14   0.255    -.0785993    .2958857
                             28  |  -.0728872   .0955121    -0.76   0.445    -.2601296    .1143553
                             29  |   .1659804   .0955121     1.74   0.082     -.021262    .3532229
                             30  |  -.0585987   .0955121    -0.61   0.540    -.2458411    .1286438
                             31  |   .1752552    .103381     1.70   0.090    -.0274136     .377924
                             32  |   .1544669   .0955121     1.62   0.106    -.0327756    .3417093
                             33  |   .3543441   .0955121     3.71   0.000     .1671017    .5415866
                             34  |  -.2573118   .0955121    -2.69   0.007    -.4445543   -.0700693
                             35  |   .1839619    .103381     1.78   0.075    -.0187069    .3866308
                             36  |   .0226501   .0955121     0.24   0.813    -.1645923    .2098926
                             37  |   .0429005   .0955121     0.45   0.653    -.1443419     .230143
                             38  |   .1640401    .103381     1.59   0.113    -.0386287     .366709
                             39  |   .0061494   .0955121     0.06   0.949     -.181093    .1933919
                             40  |    .272628    .103381     2.64   0.008     .0699591    .4752968
                             41  |   .0173641   .0955121     0.18   0.856    -.1698784    .2046066
                             42  |  -.1211259   .0955121    -1.27   0.205    -.3083684    .0661165
                             43  |   .2477792   .0955121     2.59   0.010     .0605367    .4350216
                             44  |   .2670281   .0955121     2.80   0.005     .0797856    .4542706
                             45  |   .1721432    .103381     1.67   0.096    -.0305256     .374812
                             46  |   .2659908   .0955121     2.78   0.005     .0787483    .4532332
                             47  |  -.1976647    .123661    -1.60   0.110    -.4400906    .0447611
                             48  |   .0256662   .0955121     0.27   0.788    -.1615762    .2129087
                             49  |   .1583656   .0955121     1.66   0.097    -.0288769     .345608
                                 |
                           _cons |   .5374238   .0897325     5.99   0.000     .3615117    .7133359
--------------------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\favero\AppData\Local\Temp\STD7174_000000.tmp"

. forvalues i = 2/49 {
  2.     replace state_delay = _b[`i'.state_id] if state_id == `i'
  3. }
(129 real changes made)
(129 real changes made)
(129 real changes made)
(129 real changes made)
(129 real changes made)
(129 real changes made)
(129 real changes made)
(129 real changes made)
(129 real changes made)
(129 real changes made)
(129 real changes made)
(129 real changes made)
(129 real changes made)
(129 real changes made)
(129 real changes made)
(129 real changes made)
(129 real changes made)
(129 real changes made)
(129 real changes made)
(129 real changes made)
(129 real changes made)
(129 real changes made)
(129 real changes made)
(129 real changes made)
(129 real changes made)
(129 real changes made)
(129 real changes made)
(129 real changes made)
(129 real changes made)
(129 real changes made)
(129 real changes made)
(129 real changes made)
(129 real changes made)
(129 real changes made)
(129 real changes made)
(129 real changes made)
(129 real changes made)
(129 real changes made)
(129 real changes made)
(129 real changes made)
(129 real changes made)
(129 real changes made)
(129 real changes made)
(129 real changes made)
(129 real changes made)
(129 real changes made)
(129 real changes made)
(129 real changes made)

. 
end of do-file

. do "C:\Users\favero\AppData\Local\Temp\STD7174_000000.tmp"

. capture program drop reporting_delays

. program reporting_delays
  1.         args lnf detected time alpha lnsigma
  2.         quietly replace `lnf' = ///
>                 ln(normalden( $ML_y1,  `alpha' - `alpha'*exp(-(exp(`time') * $ML_y2 )), exp(`lnsigm
> a'+`detected'*$ML_y2 )))
  3. end

. 
. ml model lf reporting_delays ///
>         (detected: total_deaths = ) ///
>         (time: days_to_report = state_delay) ///
>         (alpha: i.state_end_week) ///
>         (lnsigma: )

. ml maximize

initial:       log likelihood =     -<inf>  (could not be evaluated)
feasible:      log likelihood = -472390.48
rescale:       log likelihood = -472390.48
rescale eq:    log likelihood = -462058.32
Iteration 0:   log likelihood = -462058.32  (not concave)
Iteration 1:   log likelihood = -425669.43  (not concave)
Iteration 2:   log likelihood = -417200.13  (not concave)
Iteration 3:   log likelihood = -403907.84  (not concave)
Iteration 4:   log likelihood = -361952.66  (not concave)
Iteration 5:   log likelihood =  -333156.7  (not concave)
Iteration 6:   log likelihood =  -327866.7  (not concave)
Iteration 7:   log likelihood = -323709.39  (not concave)
Iteration 8:   log likelihood = -322888.77  (not concave)
Iteration 9:   log likelihood = -322806.92  (not concave)
Iteration 10:  log likelihood = -322774.19  (not concave)
cannot compute an improvement -- discontinuous region encountered
r(430);

end of do-file

r(430);

. do "C:\Users\favero\AppData\Local\Temp\STD7174_000000.tmp"

. capture program drop reporting_delays

. program reporting_delays
  1.         args lnf detected time alpha lnsigma
  2.         quietly replace `lnf' = ///
>                 ln(normalden( $ML_y1,  `alpha' - `alpha'*exp(-(exp(`time') * $ML_y2 )), exp(`lnsigm
> a'+`detected'*$ML_y2 )))
  3. end

. 
. ml model lf reporting_delays ///
>         (detected: total_deaths = ) ///
>         (time: days_to_report = state_delay) ///
>         (alpha: i.state_end_week) ///
>         (lnsigma: population)

. ml maximize

initial:       log likelihood =     -<inf>  (could not be evaluated)
feasible:      log likelihood = -472390.48
rescale:       log likelihood = -472390.48
rescale eq:    log likelihood = -462058.32
Iteration 0:   log likelihood = -462058.32  (not concave)
Iteration 1:   log likelihood = -425633.78  (not concave)
Iteration 2:   log likelihood = -408770.14  (not concave)
Iteration 3:   log likelihood = -383358.18  (not concave)
Iteration 4:   log likelihood = -378864.52  (not concave)
Iteration 5:   log likelihood = -350510.38  (not concave)
Iteration 6:   log likelihood = -329628.54  (not concave)
Iteration 7:   log likelihood = -321791.12  (not concave)
Iteration 8:   log likelihood = -318733.52  (not concave)
Iteration 9:   log likelihood = -316312.48  (not concave)
Iteration 10:  log likelihood = -316072.24  (not concave)
Iteration 11:  log likelihood = -316024.23  (not concave)
cannot compute an improvement -- discontinuous region encountered
r(430);

end of do-file

r(430);

. do "C:\Users\favero\AppData\Local\Temp\STD7174_000000.tmp"

. 
. ml model lf reporting_delays ///
>         (detected: total_deaths = ) ///
>         (time: days_to_report = state_delay) ///
>         (alpha: i.state_end_week) ///
>         (lnsigma: population c.total_deaths#c.population)

. ml maximize

initial:       log likelihood =     -<inf>  (could not be evaluated)
feasible:      log likelihood = -472390.48
rescale:       log likelihood = -472390.48
rescale eq:    log likelihood = -462058.32
Iteration 0:   log likelihood = -462058.32  (not concave)
Iteration 1:   log likelihood = -425620.74  (not concave)
Iteration 2:   log likelihood = -408744.66  (not concave)
Iteration 3:   log likelihood = -383702.85  (not concave)
Iteration 4:   log likelihood = -381659.13  (not concave)
Iteration 5:   log likelihood = -376626.96  (not concave)
Iteration 6:   log likelihood = -344935.78  (not concave)
Iteration 7:   log likelihood = -333356.67  (not concave)
Iteration 8:   log likelihood = -328885.48  (not concave)
Iteration 9:   log likelihood = -328444.41  (not concave)
Iteration 10:  log likelihood = -328268.23  (not concave)
Iteration 11:  log likelihood = -328197.79  (not concave)
Iteration 12:  log likelihood = -328183.71  (not concave)
cannot compute an improvement -- discontinuous region encountered
r(430);

end of do-file

r(430);

. do "C:\Users\favero\AppData\Local\Temp\STD7174_000000.tmp"

. egen min_realdeaths = max(total_deaths), by(state_end_week)

. 
. capture program drop reporting_delays

. program reporting_delays
  1.         args lnf detected time missed_realdeaths lnsigma
  2.         quietly replace `lnf' = ///
>                 ln(normalden( $ML_y1,  ($ML_y3 + exp(`missed_realdeaths')) - ($ML_y3 + exp(`missed_
> realdeaths'))*exp(-(exp(`time') * $ML_y2 )), exp(`lnsigma'+`detected'*$ML_y2 )))
  3. end

. 
. ml model lf reporting_delays ///
>         (detected: total_deaths = ) ///
>         (time: days_to_report = state_delay) ///
>         (missed_realdeaths: min_realdeaths = i.end_week) ///
>         (lnsigma: population)

. ml maximize

initial:       log likelihood =     -<inf>  (could not be evaluated)
feasible:      log likelihood = -472984.34
rescale:       log likelihood = -472984.34
rescale eq:    log likelihood = -458889.04
Iteration 0:   log likelihood = -458889.04  (not concave)
Iteration 1:   log likelihood = -442563.51  (not concave)
Iteration 2:   log likelihood = -372811.67  (not concave)
Iteration 3:   log likelihood = -314655.19  
Iteration 4:   log likelihood = -151755.97  (not concave)
Iteration 5:   log likelihood = -94320.733  (not concave)
Iteration 6:   log likelihood = -87107.175  
Iteration 7:   log likelihood = -36127.941  
Iteration 8:   log likelihood = -24758.039  (not concave)
Iteration 9:   log likelihood = -24213.016  (not concave)
Iteration 10:  log likelihood = -23664.351  (not concave)
Iteration 11:  log likelihood = -23659.844  
Iteration 12:  log likelihood = -23565.608  
Iteration 13:  log likelihood = -23544.139  (not concave)
Iteration 14:  log likelihood = -23541.906  
Iteration 15:  log likelihood = -23541.173  
Iteration 16:  log likelihood = -23541.111  
Iteration 17:  log likelihood = -23541.097  
Iteration 18:  log likelihood = -23541.095  
Iteration 19:  log likelihood = -23541.094  (not concave)
Iteration 20:  log likelihood = -23541.094  
Iteration 21:  log likelihood = -23541.094  (not concave)
Iteration 22:  log likelihood = -23541.094  

                                                Number of obs     =      6,321
                                                Wald chi2(0)      =          .
Log likelihood = -23541.094                     Prob > chi2       =          .

-----------------------------------------------------------------------------------
                  |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
detected          |
            _cons |   -.045762   .0002411  -189.84   0.000    -.0462345   -.0452896
------------------+----------------------------------------------------------------
time              |
      state_delay |  -.6286303   .0398157   -15.79   0.000    -.7066676    -.550593
            _cons |  -2.158175   .0079801  -270.45   0.000    -2.173815   -2.142534
------------------+----------------------------------------------------------------
missed_realdeaths |
         end_week |
           21953  |  -.6876256   2780.663    -0.00   1.000    -5450.687    5449.312
           21960  |    3.11223   3259.386     0.00   0.999    -6385.167    6391.392
           21967  |   2.432736   4046.856     0.00   1.000    -7929.259    7934.124
           21974  |   3.538276   3987.919     0.00   0.999    -7812.639    7819.716
           21981  |   4.231769   3217.075     0.00   0.999     -6301.12    6309.584
           21988  |   -49.0168          .        .       .            .           .
           21995  |  -1039.386          .        .       .            .           .
           22002  |   -47.7448          .        .       .            .           .
           22009  |   4.188975   10977.49     0.00   1.000     -21511.3    21519.68
           22016  |   4.372828   10653.71     0.00   1.000    -20876.51    20885.26
           22023  |  -67.88131          .        .       .            .           .
           22030  |  -194.8137          .        .       .            .           .
           22037  |   24.69108   2152.245     0.01   0.991    -4193.631    4243.013
           22044  |   26.22975   2152.245     0.01   0.990    -4192.092    4244.552
           22051  |   25.95773   2152.245     0.01   0.990    -4192.364     4244.28
           22058  |   27.57671   2152.245     0.01   0.990    -4190.745    4245.899
                  |
            _cons |  -23.91101   2152.245    -0.01   0.991    -4242.233    4194.411
------------------+----------------------------------------------------------------
lnsigma           |
       population |   1.59e-07   2.40e-09    66.02   0.000     1.54e-07    1.63e-07
            _cons |   3.943901   .0186195   211.82   0.000     3.907407    3.980394
-----------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\favero\AppData\Local\Temp\STD7174_000000.tmp"

. capture program drop reporting_delays

. program reporting_delays
  1.         args lnf detected time missed_realdeaths lnsigma
  2.         quietly replace `lnf' = ///
>                 ln(normalden( $ML_y1,  ($ML_y3 + exp(`missed_realdeaths')) - ($ML_y3 + exp(`missed_
> realdeaths'))*exp(-(exp(`time') * $ML_y2 )), exp(`lnsigma'+`detected'*$ML_y2 )))
  3. end

. 
. ml model lf reporting_delays ///
>         (detected: total_deaths = ) ///
>         (time: days_to_report = state_delay) ///
>         (missed_realdeaths: min_realdeaths = i.end_week) ///
>         (lnsigma: population) if end_week < date("20200517","YMD")

. ml maximize

initial:       log likelihood =     -<inf>  (could not be evaluated)
feasible:      log likelihood = -470973.61
rescale:       log likelihood = -470973.61
rescale eq:    log likelihood = -452277.37
Iteration 0:   log likelihood = -452277.37  (not concave)
Iteration 1:   log likelihood = -450044.57  (not concave)
Iteration 2:   log likelihood = -447795.22  (not concave)
Iteration 3:   log likelihood = -446900.11  (not concave)
Iteration 4:   log likelihood = -446810.78  (not concave)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
cannot compute an improvement -- discontinuous region encountered
r(430);

end of do-file

r(430);

. do "C:\Users\favero\AppData\Local\Temp\STD7174_000000.tmp"

. ml model lf reporting_delays ///
>         (detected: total_deaths = ) ///
>         (time: days_to_report = state_delay) ///
>         (missed_realdeaths: min_realdeaths = i.end_week) ///
>         (lnsigma: population) if end_week < date("20200524","YMD")

. ml maximize

initial:       log likelihood =     -<inf>  (could not be evaluated)
feasible:      log likelihood = -472984.34
rescale:       log likelihood = -472984.34
rescale eq:    log likelihood = -458889.04
Iteration 0:   log likelihood = -458889.04  (not concave)
Iteration 1:   log likelihood = -442563.51  (not concave)
Iteration 2:   log likelihood = -372811.67  (not concave)
Iteration 3:   log likelihood = -314655.19  
Iteration 4:   log likelihood = -151755.97  (not concave)
Iteration 5:   log likelihood = -94320.733  (not concave)
Iteration 6:   log likelihood = -87107.175  
Iteration 7:   log likelihood = -36127.941  
Iteration 8:   log likelihood = -24758.039  (not concave)
Iteration 9:   log likelihood = -24213.016  (not concave)
Iteration 10:  log likelihood = -23664.351  (not concave)
Iteration 11:  log likelihood = -23659.844  
Iteration 12:  log likelihood = -23565.608  
Iteration 13:  log likelihood = -23544.139  (not concave)
Iteration 14:  log likelihood = -23541.906  
Iteration 15:  log likelihood = -23541.173  
Iteration 16:  log likelihood = -23541.111  
Iteration 17:  log likelihood = -23541.097  
Iteration 18:  log likelihood = -23541.095  
Iteration 19:  log likelihood = -23541.094  (not concave)
Iteration 20:  log likelihood = -23541.094  
Iteration 21:  log likelihood = -23541.094  (not concave)
Iteration 22:  log likelihood = -23541.094  

                                                Number of obs     =      6,321
                                                Wald chi2(0)      =          .
Log likelihood = -23541.094                     Prob > chi2       =          .

-----------------------------------------------------------------------------------
                  |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
detected          |
            _cons |   -.045762   .0002411  -189.84   0.000    -.0462345   -.0452896
------------------+----------------------------------------------------------------
time              |
      state_delay |  -.6286303   .0398157   -15.79   0.000    -.7066676    -.550593
            _cons |  -2.158175   .0079801  -270.45   0.000    -2.173815   -2.142534
------------------+----------------------------------------------------------------
missed_realdeaths |
         end_week |
           21953  |  -.6876256   2780.663    -0.00   1.000    -5450.687    5449.312
           21960  |    3.11223   3259.386     0.00   0.999    -6385.167    6391.392
           21967  |   2.432736   4046.856     0.00   1.000    -7929.259    7934.124
           21974  |   3.538276   3987.919     0.00   0.999    -7812.639    7819.716
           21981  |   4.231769   3217.075     0.00   0.999     -6301.12    6309.584
           21988  |   -49.0168          .        .       .            .           .
           21995  |  -1039.386          .        .       .            .           .
           22002  |   -47.7448          .        .       .            .           .
           22009  |   4.188975   10977.49     0.00   1.000     -21511.3    21519.68
           22016  |   4.372828   10653.71     0.00   1.000    -20876.51    20885.26
           22023  |  -67.88131          .        .       .            .           .
           22030  |  -194.8137          .        .       .            .           .
           22037  |   24.69108   2152.245     0.01   0.991    -4193.631    4243.013
           22044  |   26.22975   2152.245     0.01   0.990    -4192.092    4244.552
           22051  |   25.95773   2152.245     0.01   0.990    -4192.364     4244.28
           22058  |   27.57671   2152.245     0.01   0.990    -4190.745    4245.899
                  |
            _cons |  -23.91101   2152.245    -0.01   0.991    -4242.233    4194.411
------------------+----------------------------------------------------------------
lnsigma           |
       population |   1.59e-07   2.40e-09    66.02   0.000     1.54e-07    1.63e-07
            _cons |   3.943901   .0186195   211.82   0.000     3.907407    3.980394
-----------------------------------------------------------------------------------

. 
end of do-file

. x`tab end_week
command x is unrecognized
r(199);

. tab end_week

   end_week |      Freq.     Percent        Cum.
------------+-----------------------------------
   20200201 |        392        6.20        6.20
   20200208 |        392        6.20       12.40
   20200215 |        392        6.20       18.60
   20200222 |        392        6.20       24.81
   20200229 |        392        6.20       31.01
   20200307 |        392        6.20       37.21
   20200314 |        392        6.20       43.41
   20200321 |        392        6.20       49.61
   20200328 |        392        6.20       55.81
   20200404 |        392        6.20       62.02
   20200411 |        392        6.20       68.22
   20200418 |        392        6.20       74.42
   20200425 |        392        6.20       80.62
   20200502 |        392        6.20       86.82
   20200509 |        343        5.43       92.25
   20200516 |        294        4.65       96.90
   20200523 |        196        3.10      100.00
------------+-----------------------------------
      Total |      6,321      100.00

. do "C:\Users\favero\AppData\Local\Temp\STD7174_000000.tmp"

. ml model lf reporting_delays ///
>         (detected: total_deaths = ) ///
>         (time: days_to_report = state_delay) ///
>         (missed_realdeaths: min_realdeaths = i.state_end_week) ///
>         (lnsigma: population) if end_week < date("20200520","YMD")

. ml maximize

initial:       log likelihood =     -<inf>  (could not be evaluated)
feasible:      log likelihood = -470973.61
rescale:       log likelihood = -470973.61
rescale eq:    log likelihood = -452277.37
Iteration 0:   log likelihood = -452277.37  (not concave)
Iteration 1:   log likelihood =  -451307.4  (not concave)
Iteration 2:   log likelihood = -451024.27  (not concave)
Iteration 3:   log likelihood = -450910.84  (not concave)
Iteration 4:   log likelihood = -450821.06  (not concave)
Iteration 5:   log likelihood = -450785.14  (not concave)
Iteration 6:   log likelihood = -450781.55  (not concave)
Iteration 7:   log likelihood = -450780.11  (not concave)
cannot compute an improvement -- discontinuous region encountered
r(430);

end of do-file

r(430);

. do "C:\Users\favero\AppData\Local\Temp\STD7174_000000.tmp"

. ml model lf reporting_delays ///
>         (detected: total_deaths = ) ///
>         (time: days_to_report = state_delay) ///
>         (missed_realdeaths: min_realdeaths = i.state_end_week) ///
>         (lnsigma: population) if end_week < date("20200513","YMD")

. ml maximize

initial:       log likelihood =     -<inf>  (could not be evaluated)
feasible:      log likelihood = -466840.84
rescale:       log likelihood = -466840.84
rescale eq:    log likelihood = -448306.43
Iteration 0:   log likelihood = -448306.43  (not concave)
Iteration 1:   log likelihood =  -446065.9  (not concave)
Iteration 2:   log likelihood = -444950.77  (not concave)
Iteration 3:   log likelihood = -444895.16  (not concave)
Iteration 4:   log likelihood = -444884.04  (not concave)
numerical derivatives are approximate
nearby values are missing
cannot compute an improvement -- discontinuous region encountered
r(430);

end of do-file

r(430);

. do "C:\Users\favero\AppData\Local\Temp\STD7174_000000.tmp"

. ml model lf reporting_delays ///
>         (detected: total_deaths = ) ///
>         (time: days_to_report = state_delay) ///
>         (missed_realdeaths: min_realdeaths = i.state_end_week) ///
>         (lnsigma: population) if end_week < date("20200507","YMD")

. ml maximize

initial:       log likelihood =     -<inf>  (could not be evaluated)
feasible:      log likelihood = -459665.17
rescale:       log likelihood = -459665.17
rescale eq:    log likelihood = -442323.77
Iteration 0:   log likelihood = -442323.77  (not concave)
Iteration 1:   log likelihood = -440113.18  (not concave)
Iteration 2:   log likelihood = -439012.97  (not concave)
Iteration 3:   log likelihood = -438985.54  (not concave)
Iteration 4:   log likelihood = -438974.56  (not concave)
cannot compute an improvement -- discontinuous region encountered
r(430);

end of do-file

r(430);

. do "C:\Users\favero\AppData\Local\Temp\STD7174_000000.tmp"

. 
. ml model lf reporting_delays ///
>         (detected: total_deaths = ) ///
>         (time: days_to_report = state_delay) ///
>         (missed_realdeaths: min_realdeaths = i.state_end_week) ///
>         (lnsigma: population) if end_week < date("20200501","YMD")

. ml maximize

initial:       log likelihood =     -<inf>  (could not be evaluated)
feasible:      log likelihood = -182467.11
rescale:       log likelihood = -182467.11
rescale eq:    log likelihood = -175989.41
Iteration 0:   log likelihood = -175989.41  (not concave)
Iteration 1:   log likelihood = -175982.53  (not concave)
Iteration 2:   log likelihood = -175975.66  (not concave)
Iteration 3:   log likelihood =  -175964.7  (not concave)
Iteration 4:   log likelihood = -175685.59  (not concave)
Iteration 5:   log likelihood = -175629.66  (not concave)
Iteration 6:   log likelihood = -175540.25  (not concave)
Iteration 7:   log likelihood = -175468.77  (not concave)
Iteration 8:   log likelihood = -168321.95  (not concave)
Iteration 9:   log likelihood = -167977.03  (not concave)
Iteration 10:  log likelihood = -167838.77  (not concave)
Iteration 11:  log likelihood =  -167615.9  (not concave)
Iteration 12:  log likelihood = -167436.23  (not concave)
Iteration 13:  log likelihood = -167291.94  (not concave)
Iteration 14:  log likelihood = -167057.72  (not concave)
Iteration 15:  log likelihood = -166262.12  (not concave)
Iteration 16:  log likelihood = -165942.79  (not concave)
Iteration 17:  log likelihood = -165886.66  (not concave)
Iteration 18:  log likelihood = -165841.52  (not concave)
Iteration 19:  log likelihood = -165254.12  (not concave)
Iteration 20:  log likelihood = -165195.58  (not concave)
Iteration 21:  log likelihood = -164447.34  (not concave)
Iteration 22:  log likelihood = -164417.39  (not concave)
Iteration 23:  log likelihood = -164393.38  (not concave)
Iteration 24:  log likelihood = -164316.64  (not concave)
Iteration 25:  log likelihood = -164194.01  (not concave)
Iteration 26:  log likelihood = -164144.99  (not concave)
Iteration 27:  log likelihood = -164105.77  (not concave)
Iteration 28:  log likelihood =  -164045.1  (not concave)
Iteration 29:  log likelihood = -164013.82  (not concave)
Iteration 30:  log likelihood = -163965.67  (not concave)
Iteration 31:  log likelihood = -163932.25  (not concave)
Iteration 32:  log likelihood = -163825.79  (not concave)
Iteration 33:  log likelihood =  -163783.4  (not concave)
Iteration 34:  log likelihood = -163715.62  (not concave)
Iteration 35:  log likelihood = -163688.51  (not concave)
Iteration 36:  log likelihood =  -163601.8  (not concave)
Iteration 37:  log likelihood = -163565.34  (not concave)
Iteration 38:  log likelihood = -163448.69  (not concave)
Iteration 39:  log likelihood = -163264.56  (not concave)
Iteration 40:  log likelihood =  -159243.2  (not concave)
Iteration 41:  log likelihood =    -159145  (not concave)
Iteration 42:  log likelihood = -157119.31  (not concave)
Iteration 43:  log likelihood =  -156719.7  (not concave)
Iteration 44:  log likelihood = -156706.68  (not concave)
Iteration 45:  log likelihood = -156443.09  (not concave)
Iteration 46:  log likelihood = -155623.94  (not concave)
Iteration 47:  log likelihood = -155182.14  (not concave)
Iteration 48:  log likelihood =  -154478.9  (not concave)
Iteration 49:  log likelihood = -153383.24  (not concave)
Iteration 50:  log likelihood = -153329.48  (not concave)
Iteration 51:  log likelihood = -151961.97  (not concave)
Iteration 52:  log likelihood = -151826.46  (not concave)
Iteration 53:  log likelihood = -151772.32  (not concave)
Iteration 54:  log likelihood = -151750.66  (not concave)
Iteration 55:  log likelihood = -151742.01  (not concave)
Iteration 56:  log likelihood = -151738.54  (not concave)
Iteration 57:  log likelihood = -151735.77  (not concave)
numerical derivatives are approximate
nearby values are missing
cannot compute an improvement -- discontinuous region encountered
r(430);

end of do-file

r(430);

. tab end_week

   end_week |      Freq.     Percent        Cum.
------------+-----------------------------------
   20200201 |        392        6.20        6.20
   20200208 |        392        6.20       12.40
   20200215 |        392        6.20       18.60
   20200222 |        392        6.20       24.81
   20200229 |        392        6.20       31.01
   20200307 |        392        6.20       37.21
   20200314 |        392        6.20       43.41
   20200321 |        392        6.20       49.61
   20200328 |        392        6.20       55.81
   20200404 |        392        6.20       62.02
   20200411 |        392        6.20       68.22
   20200418 |        392        6.20       74.42
   20200425 |        392        6.20       80.62
   20200502 |        392        6.20       86.82
   20200509 |        343        5.43       92.25
   20200516 |        294        4.65       96.90
   20200523 |        196        3.10      100.00
------------+-----------------------------------
      Total |      6,321      100.00

. do "C:\Users\favero\AppData\Local\Temp\STD7174_000000.tmp"

. 
. ml model lf reporting_delays ///
>         (detected: total_deaths = ) ///
>         (time: days_to_report = state_delay) ///
>         (missed_realdeaths: min_realdeaths = i.state_end_week) ///
>         (lnsigma: population) if end_week < date("20200401","YMD")

. ml maximize

initial:       log likelihood =     -<inf>  (could not be evaluated)
feasible:      log likelihood = -150977.02
rescale:       log likelihood = -17243.603
rescale eq:    log likelihood = -15880.168
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 0:   log likelihood = -15880.168  (not concave)
Iteration 1:   log likelihood = -15801.051  (not concave)
Iteration 2:   log likelihood = -15799.485  (not concave)
Iteration 3:   log likelihood = -15701.672  (not concave)
Iteration 4:   log likelihood = -15661.289  (not concave)
Iteration 5:   log likelihood = -13204.713  (not concave)
Iteration 6:   log likelihood = -12752.665  (not concave)
Iteration 7:   log likelihood =  -11922.42  (not concave)
Iteration 8:   log likelihood = -11922.401  (not concave)
Iteration 9:   log likelihood = -11920.461  (not concave)
Iteration 10:  log likelihood = -11920.412  (not concave)
Iteration 11:  log likelihood = -11623.312  (not concave)
Iteration 12:  log likelihood = -10965.845  (not concave)
Iteration 13:  log likelihood = -9893.9798  (not concave)
Iteration 14:  log likelihood = -9561.4069  (not concave)
Iteration 15:  log likelihood = -9194.9843  (not concave)
Iteration 16:  log likelihood = -8955.9002  (not concave)
Iteration 17:  log likelihood = -8897.6335  (not concave)
Iteration 18:  log likelihood = -8819.7301  (not concave)
Iteration 19:  log likelihood =  -8818.378  (not concave)
Iteration 20:  log likelihood = -8772.3209  (not concave)
Iteration 21:  log likelihood = -8759.8555  (not concave)
Iteration 22:  log likelihood = -8737.6341  (not concave)
Iteration 23:  log likelihood = -8737.0892  (not concave)
Iteration 24:  log likelihood = -8728.5397  (not concave)
Iteration 25:  log likelihood = -8723.2368  (not concave)
Iteration 26:  log likelihood = -8723.1226  (not concave)
Iteration 27:  log likelihood = -8717.5907  (not concave)
Iteration 28:  log likelihood = -8715.1099  (not concave)
Iteration 29:  log likelihood =  -8713.634  (not concave)
Iteration 30:  log likelihood = -8712.7105  (not concave)
Iteration 31:  log likelihood = -8711.9982  (not concave)
Iteration 32:  log likelihood = -8711.4363  (not concave)
Iteration 33:  log likelihood = -8710.9553  (not concave)
Iteration 34:  log likelihood = -8710.5026  (not concave)
Iteration 35:  log likelihood = -8710.1628  (not concave)
Iteration 36:  log likelihood = -8709.8713  (not concave)
Iteration 37:  log likelihood = -8709.6148  (not concave)
Iteration 38:  log likelihood = -8709.3981  (not concave)
Iteration 39:  log likelihood = -8709.2108  (not concave)
Iteration 40:  log likelihood =  -8709.049  (not concave)
Iteration 41:  log likelihood = -8708.9093  (not concave)
Iteration 42:  log likelihood = -8708.7884  (not concave)
Iteration 43:  log likelihood =  -8708.684  (not concave)
Iteration 44:  log likelihood = -8708.5937  (not concave)
Iteration 45:  log likelihood = -8708.5156  (not concave)
Iteration 46:  log likelihood =  -8708.448  (not concave)
Iteration 47:  log likelihood = -8708.3895  (not concave)
Iteration 48:  log likelihood = -8708.3389  (not concave)
Iteration 49:  log likelihood =  -8708.295  (not concave)
Iteration 50:  log likelihood = -8708.2571  (not concave)
Iteration 51:  log likelihood = -8708.2243  (not concave)
Iteration 52:  log likelihood = -8708.1958  (not concave)
Iteration 53:  log likelihood = -8708.1712  (not concave)
Iteration 54:  log likelihood = -8708.1498  (not concave)
Iteration 55:  log likelihood = -8708.1313  (not concave)
Iteration 56:  log likelihood = -8708.1153  (not concave)
Iteration 57:  log likelihood = -8708.1014  (not concave)
Iteration 58:  log likelihood = -8708.0894  (not concave)
Iteration 59:  log likelihood =  -8708.079  (not concave)
Iteration 60:  log likelihood = -8708.0699  (not concave)
Iteration 61:  log likelihood = -8708.0621  (not concave)
Iteration 62:  log likelihood = -8708.0553  (not concave)
Iteration 63:  log likelihood = -8708.0494  (not concave)
Iteration 64:  log likelihood = -8708.0443  (not concave)
Iteration 65:  log likelihood = -8708.0399  (not concave)
Iteration 66:  log likelihood =  -8708.036  (not concave)
Iteration 67:  log likelihood = -8708.0327  (not concave)
Iteration 68:  log likelihood = -8708.0298  (not concave)
Iteration 69:  log likelihood = -8708.0273  (not concave)
Iteration 70:  log likelihood = -8708.0252  (not concave)
Iteration 71:  log likelihood = -8708.0233  (not concave)
Iteration 72:  log likelihood = -8708.0216  (not concave)
Iteration 73:  log likelihood = -8708.0202  (not concave)
Iteration 74:  log likelihood =  -8708.019  (not concave)
Iteration 75:  log likelihood = -8708.0179  (not concave)
Iteration 76:  log likelihood =  -8708.017  (not concave)
Iteration 77:  log likelihood = -8708.0162  (not concave)
Iteration 78:  log likelihood = -8708.0155  (not concave)
Iteration 79:  log likelihood = -8708.0149  (not concave)
Iteration 80:  log likelihood = -8708.0144  (not concave)
Iteration 81:  log likelihood =  -8708.014  (not concave)
Iteration 82:  log likelihood =  -8708.011  (not concave)
Iteration 83:  log likelihood =  -8708.011  (not concave)
Iteration 84:  log likelihood =  -8708.011  (not concave)
Iteration 85:  log likelihood =  -8708.011  (not concave)
Iteration 86:  log likelihood =  -8708.011  (not concave)
Iteration 87:  log likelihood =  -8708.011  (not concave)
Iteration 88:  log likelihood =  -8708.011  (not concave)
Iteration 89:  log likelihood =  -8708.011  (not concave)
Iteration 90:  log likelihood =  -8708.011  (not concave)
Iteration 91:  log likelihood =  -8708.011  (not concave)
Iteration 92:  log likelihood =  -8708.011  (not concave)
Iteration 93:  log likelihood =  -8708.011  (not concave)
Iteration 94:  log likelihood =  -8708.011  (not concave)
Iteration 95:  log likelihood =  -8708.011  (not concave)
Iteration 96:  log likelihood =  -8708.011  (not concave)
Iteration 97:  log likelihood =  -8708.011  (not concave)
Iteration 98:  log likelihood =  -8708.011  (not concave)
Iteration 99:  log likelihood =  -8708.011  (not concave)
Iteration 100: log likelihood =  -8708.011  (not concave)
Iteration 101: log likelihood =  -8708.011  (not concave)
Iteration 102: log likelihood =  -8708.011  (not concave)
Iteration 103: log likelihood =  -8708.011  (not concave)
Iteration 104: log likelihood =  -8708.011  (not concave)
Iteration 105: log likelihood =  -8708.011  (not concave)
Iteration 106: log likelihood =  -8708.011  (not concave)
Iteration 107: log likelihood =  -8708.011  (not concave)
Iteration 108: log likelihood =  -8708.011  (not concave)
Iteration 109: log likelihood =  -8708.011  (not concave)
Iteration 110: log likelihood =  -8708.011  (not concave)
Iteration 111: log likelihood =  -8708.011  (not concave)
Iteration 112: log likelihood =  -8708.011  (not concave)
Iteration 113: log likelihood =  -8708.011  (not concave)
Iteration 114: log likelihood =  -8708.011  (not concave)
Iteration 115: log likelihood =  -8708.011  (not concave)
Iteration 116: log likelihood =  -8708.011  (not concave)
Iteration 117: log likelihood =  -8708.011  (not concave)
Iteration 118: log likelihood =  -8708.011  (not concave)
Iteration 119: log likelihood =  -8708.011  (not concave)
Iteration 120: log likelihood =  -8708.011  (not concave)
Iteration 121: log likelihood =  -8708.011  (not concave)
Iteration 122: log likelihood =  -8708.011  (not concave)
Iteration 123: log likelihood =  -8708.011  (not concave)
Iteration 124: log likelihood =  -8708.011  (not concave)
Iteration 125: log likelihood =  -8708.011  (not concave)
Iteration 126: log likelihood =  -8708.011  (not concave)
Iteration 127: log likelihood =  -8708.011  (not concave)
Iteration 128: log likelihood =  -8708.011  (not concave)
Iteration 129: log likelihood =  -8708.011  (not concave)
Iteration 130: log likelihood =  -8708.011  (not concave)
Iteration 131: log likelihood =  -8708.011  (not concave)
Iteration 132: log likelihood =  -8708.011  (not concave)
Iteration 133: log likelihood =  -8708.011  (not concave)
Iteration 134: log likelihood =  -8708.011  (not concave)
Iteration 135: log likelihood =  -8708.011  (not concave)
Iteration 136: log likelihood =  -8708.011  (not concave)
Iteration 137: log likelihood =  -8708.011  (not concave)
Iteration 138: log likelihood =  -8708.011  (not concave)
Iteration 139: log likelihood =  -8708.011  (not concave)
Iteration 140: log likelihood =  -8708.011  (not concave)
Iteration 141: log likelihood =  -8708.011  (not concave)
Iteration 142: log likelihood =  -8708.011  (not concave)
Iteration 143: log likelihood =  -8708.011  (not concave)
Iteration 144: log likelihood =  -8708.011  (not concave)
Iteration 145: log likelihood =  -8708.011  (not concave)
Iteration 146: log likelihood =  -8708.011  (not concave)
Iteration 147: log likelihood =  -8708.011  (not concave)
Iteration 148: log likelihood =  -8708.011  (not concave)
Iteration 149: log likelihood =  -8708.011  (not concave)
Iteration 150: log likelihood =  -8708.011  (not concave)
Iteration 151: log likelihood =  -8708.011  (not concave)
Iteration 152: log likelihood =  -8708.011  (not concave)
Iteration 153: log likelihood =  -8708.011  (not concave)
Iteration 154: log likelihood =  -8708.011  (not concave)
Iteration 155: log likelihood =  -8708.011  (not concave)
Iteration 156: log likelihood =  -8708.011  (not concave)
Iteration 157: log likelihood =  -8708.011  (not concave)
Iteration 158: log likelihood =  -8708.011  (not concave)
Iteration 159: log likelihood =  -8708.011  (not concave)
Iteration 160: log likelihood =  -8708.011  (not concave)
Iteration 161: log likelihood =  -8708.011  (not concave)
Iteration 162: log likelihood =  -8708.011  (not concave)
Iteration 163: log likelihood =  -8708.011  (not concave)
Iteration 164: log likelihood =  -8708.011  (not concave)
Iteration 165: log likelihood =  -8708.011  (not concave)
Iteration 166: log likelihood =  -8708.011  (not concave)
Iteration 167: log likelihood =  -8708.011  (not concave)
Iteration 168: log likelihood =  -8708.011  (not concave)
Iteration 169: log likelihood =  -8708.011  (not concave)
Iteration 170: log likelihood =  -8708.011  (not concave)
Iteration 171: log likelihood =  -8708.011  (not concave)
Iteration 172: log likelihood =  -8708.011  (not concave)
Iteration 173: log likelihood =  -8708.011  (not concave)
Iteration 174: log likelihood =  -8708.011  (not concave)
Iteration 175: log likelihood =  -8708.011  (not concave)
Iteration 176: log likelihood =  -8708.011  (not concave)
Iteration 177: log likelihood =  -8708.011  (not concave)
Iteration 178: log likelihood =  -8708.011  (not concave)
Iteration 179: log likelihood =  -8708.011  (not concave)
Iteration 180: log likelihood =  -8708.011  (not concave)
Iteration 181: log likelihood =  -8708.011  (not concave)
Iteration 182: log likelihood =  -8708.011  (not concave)
Iteration 183: log likelihood =  -8708.011  (not concave)
Iteration 184: log likelihood =  -8708.011  (not concave)
Iteration 185: log likelihood =  -8708.011  (not concave)
Iteration 186: log likelihood =  -8708.011  (not concave)
Iteration 187: log likelihood =  -8708.011  (not concave)
Iteration 188: log likelihood =  -8708.011  (not concave)
Iteration 189: log likelihood =  -8708.011  (not concave)
Iteration 190: log likelihood =  -8708.011  (not concave)
Iteration 191: log likelihood =  -8708.011  (not concave)
Iteration 192: log likelihood =  -8708.011  (not concave)
Iteration 193: log likelihood =  -8708.011  (not concave)
Iteration 194: log likelihood =  -8708.011  (not concave)
Iteration 195: log likelihood =  -8708.011  (not concave)
Iteration 196: log likelihood =  -8708.011  (not concave)
Iteration 197: log likelihood =  -8708.011  (not concave)
Iteration 198: log likelihood =  -8708.011  (not concave)
Iteration 199: log likelihood =  -8708.011  (not concave)
Iteration 200: log likelihood =  -8708.011  (not concave)
Iteration 201: log likelihood =  -8708.011  (not concave)
Iteration 202: log likelihood =  -8708.011  (not concave)
Iteration 203: log likelihood =  -8708.011  (not concave)
Iteration 204: log likelihood =  -8708.011  (not concave)
Iteration 205: log likelihood =  -8708.011  (not concave)
Iteration 206: log likelihood =  -8708.011  (not concave)
Iteration 207: log likelihood =  -8708.011  (not concave)
Iteration 208: log likelihood =  -8708.011  (not concave)
Iteration 209: log likelihood =  -8708.011  (not concave)
Iteration 210: log likelihood =  -8708.011  (not concave)
Iteration 211: log likelihood =  -8708.011  (not concave)
Iteration 212: log likelihood =  -8708.011  (not concave)
Iteration 213: log likelihood =  -8708.011  (not concave)
Iteration 214: log likelihood =  -8708.011  (not concave)
Iteration 215: log likelihood =  -8708.011  (not concave)
Iteration 216: log likelihood =  -8708.011  (not concave)
Iteration 217: log likelihood =  -8708.011  (not concave)
Iteration 218: log likelihood =  -8708.011  (not concave)
Iteration 219: log likelihood =  -8708.011  (not concave)
Iteration 220: log likelihood =  -8708.011  (not concave)
Iteration 221: log likelihood =  -8708.011  (not concave)
Iteration 222: log likelihood =  -8708.011  (not concave)
Iteration 223: log likelihood =  -8708.011  (not concave)
Iteration 224: log likelihood =  -8708.011  (not concave)
Iteration 225: log likelihood =  -8708.011  (not concave)
Iteration 226: log likelihood =  -8708.011  (not concave)
Iteration 227: log likelihood =  -8708.011  (not concave)
--Break--
r(1);

end of do-file

--Break--
r(1);

. do "C:\Users\favero\AppData\Local\Temp\STD7174_000000.tmp"

. 
. ml model lf reporting_delays ///
>         (detected: total_deaths = ) ///
>         (time: days_to_report = state_delay) ///
>         (missed_realdeaths: min_realdeaths = i.state_end_week) ///
>         (lnsigma: population c.total_deaths#c.population) if end_week < date("20200401","YMD")

. ml maximize

initial:       log likelihood =     -<inf>  (could not be evaluated)
feasible:      log likelihood = -150977.02
rescale:       log likelihood = -17243.603
rescale eq:    log likelihood = -15880.168
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 0:   log likelihood = -15880.168  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 1:   log likelihood =  -15731.75  (not concave)
Iteration 2:   log likelihood =  -15653.58  (not concave)
Iteration 3:   log likelihood = -15622.419  (not concave)
Iteration 4:   log likelihood =  -15597.14  (not concave)
Iteration 5:   log likelihood = -15576.833  (not concave)
Iteration 6:   log likelihood = -15572.789  (not concave)
Iteration 7:   log likelihood = -15548.359  (not concave)
Iteration 8:   log likelihood = -15532.212  (not concave)
Iteration 9:   log likelihood = -15482.158  (not concave)
Iteration 10:  log likelihood = -15462.801  (not concave)
Iteration 11:  log likelihood =  -15455.01  (not concave)
Iteration 12:  log likelihood = -15429.447  (not concave)
Iteration 13:  log likelihood = -15428.892  (not concave)
Iteration 14:  log likelihood = -15248.455  (not concave)
Iteration 15:  log likelihood = -15148.546  (not concave)
Iteration 16:  log likelihood = -15138.992  (not concave)
Iteration 17:  log likelihood = -15119.918  (not concave)
Iteration 18:  log likelihood = -15024.168  (not concave)
Iteration 19:  log likelihood = -14893.828  (not concave)
Iteration 20:  log likelihood = -14791.736  (not concave)
Iteration 21:  log likelihood = -12970.196  (not concave)
Iteration 22:  log likelihood = -12967.501  (not concave)
Iteration 23:  log likelihood = -12967.501  (not concave)
Iteration 24:  log likelihood = -12959.508  (not concave)
Iteration 25:  log likelihood = -12935.892  (not concave)
Iteration 26:  log likelihood = -12498.714  (not concave)
Iteration 27:  log likelihood = -9176.3339  (not concave)
Iteration 28:  log likelihood = -9154.6217  (not concave)
Iteration 29:  log likelihood = -9144.6794  (not concave)
Iteration 30:  log likelihood = -9137.3902  (not concave)
Iteration 31:  log likelihood = -9111.9485  (not concave)
Iteration 32:  log likelihood = -9104.7091  (not concave)
Iteration 33:  log likelihood = -9098.9867  (not concave)
Iteration 34:  log likelihood = -8984.6996  (not concave)
Iteration 35:  log likelihood = -8862.0662  (not concave)
Iteration 36:  log likelihood = -8562.1651  (not concave)
Iteration 37:  log likelihood = -8558.7294  (not concave)
Iteration 38:  log likelihood = -8553.5807  (not concave)
Iteration 39:  log likelihood = -8449.7001  (not concave)
Iteration 40:  log likelihood = -8419.5529  (not concave)
Iteration 41:  log likelihood = -8400.3212  (not concave)
Iteration 42:  log likelihood =  -8381.198  (not concave)
Iteration 43:  log likelihood = -8343.7469  (not concave)
Iteration 44:  log likelihood = -8337.4588  (not concave)
Iteration 45:  log likelihood = -8327.0635  (not concave)
Iteration 46:  log likelihood =  -8316.938  (not concave)
Iteration 47:  log likelihood = -8309.3103  (not concave)
Iteration 48:  log likelihood = -8302.1305  (not concave)
Iteration 49:  log likelihood = -8295.1801  (not concave)
Iteration 50:  log likelihood =  -8289.081  (not concave)
Iteration 51:  log likelihood = -8283.8008  (not concave)
Iteration 52:  log likelihood = -8278.6447  (not concave)
Iteration 53:  log likelihood =  -8273.653  (not concave)
Iteration 54:  log likelihood = -8268.9339  (not concave)
Iteration 55:  log likelihood = -8264.5669  (not concave)
Iteration 56:  log likelihood = -8260.2478  (not concave)
Iteration 57:  log likelihood = -8255.8798  (not concave)
Iteration 58:  log likelihood = -8251.6508  (not concave)
Iteration 59:  log likelihood = -8247.6421  (not concave)
Iteration 60:  log likelihood = -8243.5757  (not concave)
Iteration 61:  log likelihood = -8239.2944  (not concave)
Iteration 62:  log likelihood = -8235.0679  (not concave)
Iteration 63:  log likelihood = -8231.0456  (not concave)
Iteration 64:  log likelihood = -8226.8825  (not concave)
Iteration 65:  log likelihood = -8222.1442  (not concave)
Iteration 66:  log likelihood = -8213.7968  (not concave)
Iteration 67:  log likelihood = -8194.5148  (not concave)
Iteration 68:  log likelihood = -8158.0363  (not concave)
Iteration 69:  log likelihood = -7978.3471  (not concave)
Iteration 70:  log likelihood = -7950.0208  (not concave)
Iteration 71:  log likelihood =  -7916.752  (not concave)
Iteration 72:  log likelihood = -7862.8081  (not concave)
Iteration 73:  log likelihood = -7856.0517  (not concave)
Iteration 74:  log likelihood =  -7854.939  (not concave)
Iteration 75:  log likelihood = -7854.4785  (not concave)
Iteration 76:  log likelihood = -7854.0941  (not concave)
Iteration 77:  log likelihood = -7853.8394  (not concave)
Iteration 78:  log likelihood = -7853.6075  (not concave)
Iteration 79:  log likelihood = -7853.3806  (not concave)
Iteration 80:  log likelihood =  -7853.231  
Iteration 81:  log likelihood = -7852.2162  (not concave)
Iteration 82:  log likelihood = -7852.2149  (not concave)
Iteration 83:  log likelihood = -7852.2148  (not concave)
Iteration 84:  log likelihood = -7852.2148  
Iteration 85:  log likelihood = -7852.2146  (not concave)
Iteration 86:  log likelihood = -7852.2146  (not concave)
Iteration 87:  log likelihood = -7852.2146  (backed up)

                                                Number of obs     =      3,528
                                                Wald chi2(0)      =          .
Log likelihood = -7852.2146                     Prob > chi2       =          .

---------------------------------------------------------------------------------------------
                            |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------------+----------------------------------------------------------------
detected                    |
                      _cons |  -.0407456   .0006079   -67.03   0.000    -.0419371   -.0395541
----------------------------+----------------------------------------------------------------
time                        |
                state_delay |  -.1473978   .0359036    -4.11   0.000    -.2177675   -.0770281
                      _cons |  -2.458648   .0070286  -349.81   0.000    -2.472424   -2.444872
----------------------------+----------------------------------------------------------------
missed_realdeaths           |
             state_end_week |
                         2  |    -2.8732          .        .       .            .           .
                         3  |  -2.803348          .        .       .            .           .
                         4  |  -2.739401          .        .       .            .           .
                         5  |  -2.692936          .        .       .            .           .
                         6  |  -2.582073          .        .       .            .           .
                         7  |  -2.550609          .        .       .            .           .
                         8  |  -2.474251          .        .       .            .           .
                         9  |  -2.417063          .        .       .            .           .
                        18  |    61.9956    7926172     0.00   1.000    -1.55e+07    1.55e+07
                        19  |   62.72771    7926172     0.00   1.000    -1.55e+07    1.55e+07
                        20  |   63.31248    7926172     0.00   1.000    -1.55e+07    1.55e+07
                        21  |  -2.784301          .        .       .            .           .
                        22  |  -2.831508          .        .       .            .           .
                        23  |  -2.685119          .        .       .            .           .
                        24  |  -2.675981          .        .       .            .           .
                        25  |  -2.634362          .        .       .            .           .
                        26  |  -2.593321          .        .       .            .           .
                        35  |  -2.945713          .        .       .            .           .
                        36  |  -2.881185          .        .       .            .           .
                        37  |  -2.792884          .        .       .            .           .
                        38  |   -2.70869          .        .       .            .           .
                        39  |  -2.664607          .        .       .            .           .
                        40  |  -2.586821          .        .       .            .           .
                        41  |  -2.527815          .        .       .            .           .
                        42  |  -2.467834          .        .       .            .           .
                        43  |  -2.393469          .        .       .            .           .
                        52  |   -2.95412          .        .       .            .           .
                        53  |  -2.910783          .        .       .            .           .
                        54  |  -2.939964          .        .       .            .           .
                        55  |  -2.800363          .        .       .            .           .
                        56  |  -2.723776          .        .       .            .           .
                        57  |  -2.605059          .        .       .            .           .
                        58  |   -2.59883          .        .       .            .           .
                        59  |  -2.494526          .        .       .            .           .
                        60  |  -2.489456          .        .       .            .           .
                        69  |  -2.037258          .        .       .            .           .
                        70  |  -1.978793          .        .       .            .           .
                        71  |  -1.923609          .        .       .            .           .
                        72  |  -1.851278          .        .       .            .           .
                        73  |  -1.811651          .        .       .            .           .
                        74  |   -1.73593          .        .       .            .           .
                        75  |  -1.693815          .        .       .            .           .
                        76  |  -1.589661          .        .       .            .           .
                        77  |  -1.545327          .        .       .            .           .
                        86  |  -2.960448          .        .       .            .           .
                        87  |   -2.85416          .        .       .            .           .
                        88  |  -2.755326          .        .       .            .           .
                        89  |   -2.69013          .        .       .            .           .
                        90  |  -2.625884          .        .       .            .           .
                        91  |    -2.5918          .        .       .            .           .
                        92  |  -2.554482          .        .       .            .           .
                        93  |  -2.478977          .        .       .            .           .
                        94  |  -2.389782          .        .       .            .           .
                       120  |  -3.042347          .        .       .            .           .
                       121  |  -2.889933          .        .       .            .           .
                       122  |   -2.84376          .        .       .            .           .
                       123  |  -2.830237          .        .       .            .           .
                       124  |  -2.715097          .        .       .            .           .
                       125  |  -2.683336          .        .       .            .           .
                       126  |  -2.644025          .        .       .            .           .
                       127  |  -2.528102          .        .       .            .           .
                       128  |  -2.474833          .        .       .            .           .
                       137  |  -3.046983          .        .       .            .           .
                       138  |  -3.011167          .        .       .            .           .
                       139  |  -2.900549          .        .       .            .           .
                       140  |  -2.889252          .        .       .            .           .
                       141  |  -2.730441          .        .       .            .           .
                       142  |   -2.65425          .        .       .            .           .
                       143  |  -2.636906          .        .       .            .           .
                       144  |  -2.546579          .        .       .            .           .
                       145  |  -2.499667          .        .       .            .           .
                       154  |  -2.568767          .        .       .            .           .
                       155  |  -2.540608          .        .       .            .           .
                       156  |  -2.488047          .        .       .            .           .
                       157  |  -2.486745          .        .       .            .           .
                       158  |  -2.270716          .        .       .            .           .
                       159  |  -2.354386          .        .       .            .           .
                       160  |  -2.152946          .        .       .            .           .
                       161  |  -2.127972          .        .       .            .           .
                       162  |  -2.038537          .        .       .            .           .
                       171  |  -2.816741          .        .       .            .           .
                       172  |  -2.772372          .        .       .            .           .
                       173  |  -2.707607          .        .       .            .           .
                       174  |  -2.654729          .        .       .            .           .
                       175  |  -2.590176          .        .       .            .           .
                       176  |  -2.512775          .        .       .            .           .
                       177  |  -2.455699          .        .       .            .           .
                       178  |  -2.386609          .        .       .            .           .
                       179  |  -2.327639          .        .       .            .           .
                       188  |  -3.098823          .        .       .            .           .
                       189  |  -2.913711          .        .       .            .           .
                       190  |  -2.819464          .        .       .            .           .
                       191  |  -2.755285          .        .       .            .           .
                       192  |  -2.797586          .        .       .            .           .
                       193  |  -2.695516          .        .       .            .           .
                       194  |     -2.575          .        .       .            .           .
                       195  |  -2.527613          .        .       .            .           .
                       196  |  -2.509688          .        .       .            .           .
                       205  |  -3.059842          .        .       .            .           .
                       206  |   -2.93095          .        .       .            .           .
                       207  |  -2.887693          .        .       .            .           .
                       208  |  -2.874171          .        .       .            .           .
                       209  |  -2.804433          .        .       .            .           .
                       210  |  -2.728716          .        .       .            .           .
                       211  |  -2.669774          .        .       .            .           .
                       212  |  -2.641146          .        .       .            .           .
                       213  |  -3.458009          .        .       .            .           .
                       222  |  -2.827925          .        .       .            .           .
                       223  |  -2.745393          .        .       .            .           .
                       224  |   -2.61873          .        .       .            .           .
                       225  |  -2.584772          .        .       .            .           .
                       226  |  -2.490856          .        .       .            .           .
                       227  |  -2.435353          .        .       .            .           .
                       228  |    -2.4017          .        .       .            .           .
                       229  |  -2.342926          .        .       .            .           .
                       230  |   -2.27925          .        .       .            .           .
                       239  |  -2.929911          .        .       .            .           .
                       240  |  -2.797829          .        .       .            .           .
                       241  |  -2.784725          .        .       .            .           .
                       242  |  -2.727539          .        .       .            .           .
                       243  |  -2.641463          .        .       .            .           .
                       244  |  -2.597139          .        .       .            .           .
                       245  |  -2.519803          .        .       .            .           .
                       246  |  -2.451823          .        .       .            .           .
                       247  |  -2.378644          .        .       .            .           .
                       256  |  -2.952902          .        .       .            .           .
                       257  |   -2.93628          .        .       .            .           .
                       258  |  -2.824559          .        .       .            .           .
                       259  |  -2.747956          .        .       .            .           .
                       260  |  -2.696065          .        .       .            .           .
                       261  |  -2.642246          .        .       .            .           .
                       262  |  -2.555049          .        .       .            .           .
                       263  |   -2.53549          .        .       .            .           .
                       264  |   -2.46653          .        .       .            .           .
                       273  |  -3.039913          .        .       .            .           .
                       274  |  -2.862333          .        .       .            .           .
                       275  |  -2.797843          .        .       .            .           .
                       276  |  -2.823869          .        .       .            .           .
                       277  |  -2.963505          .        .       .            .           .
                       278  |  -2.658617          .        .       .            .           .
                       279  |  -2.632563          .        .       .            .           .
                       280  |  -2.538658          .        .       .            .           .
                       281  |  -2.455643          .        .       .            .           .
                       290  |  -2.919303          .        .       .            .           .
                       291  |  -2.881205          .        .       .            .           .
                       292  |  -2.813922          .        .       .            .           .
                       293  |  -2.744097          .        .       .            .           .
                       294  |  -2.683246          .        .       .            .           .
                       295  |  -2.626346          .        .       .            .           .
                       296  |  -2.559257          .        .       .            .           .
                       297  |   -2.49905          .        .       .            .           .
                       298  |  -2.427401          .        .       .            .           .
                       307  |  -2.916886          .        .       .            .           .
                       308  |  -2.892135          .        .       .            .           .
                       309  |  -2.816364          .        .       .            .           .
                       310  |  -2.751715          .        .       .            .           .
                       311  |  -2.687587          .        .       .            .           .
                       312  |  -2.613836          .        .       .            .           .
                       313  |  -2.560941          .        .       .            .           .
                       314  |  -2.506812          .        .       .            .           .
                       315  |  -2.422152          .        .       .            .           .
                       324  |  -3.324488          .        .       .            .           .
                       325  |  -3.852718          .        .       .            .           .
                       326  |  -16.98082          .        .       .            .           .
                       327  |   65.27404    7926172     0.00   1.000    -1.55e+07    1.55e+07
                       328  |   65.87109    7926172     0.00   1.000    -1.55e+07    1.55e+07
                       329  |   66.56138    7926172     0.00   1.000    -1.55e+07    1.55e+07
                       330  |   67.14327    7926172     0.00   1.000    -1.55e+07    1.55e+07
                       331  |   67.68156    7926172     0.00   1.000    -1.55e+07    1.55e+07
                       332  |   68.31072    7926172     0.00   1.000    -1.55e+07    1.55e+07
                       341  |  -2.877009          .        .       .            .           .
                       342  |  -3.228382          .        .       .            .           .
                       343  |  -2.750205          .        .       .            .           .
                       344  |  -2.730174          .        .       .            .           .
                       345  |  -2.630168          .        .       .            .           .
                       346  |  -2.605203          .        .       .            .           .
                       347  |  -2.555331          .        .       .            .           .
                       348  |  -2.539875          .        .       .            .           .
                       349  |  -2.510855          .        .       .            .           .
                       358  |  -3.060355          .        .       .            .           .
                       359  |  -3.159414          .        .       .            .           .
                       360  |  -2.734053          .        .       .            .           .
                       361  |  -2.731907          .        .       .            .           .
                       362  |   67.38743    7926172     0.00   1.000    -1.55e+07    1.55e+07
                       363  |  -2.570747          .        .       .            .           .
                       364  |  -2.571145          .        .       .            .           .
                       365  |  -2.484896          .        .       .            .           .
                       366  |  -2.541358          .        .       .            .           .
                       375  |  -2.798673          .        .       .            .           .
                       376  |  -2.805902          .        .       .            .           .
                       377  |  -2.745069          .        .       .            .           .
                       378  |  -2.653559          .        .       .            .           .
                       379  |  -2.590904          .        .       .            .           .
                       380  |  -2.511202          .        .       .            .           .
                       381  |  -2.460781          .        .       .            .           .
                       382  |  -2.409428          .        .       .            .           .
                       383  |  -2.316864          .        .       .            .           .
                       392  |  -3.060789          .        .       .            .           .
                       393  |  -2.850791          .        .       .            .           .
                       394  |  -2.759386          .        .       .            .           .
                       395  |  -2.694278          .        .       .            .           .
                       396  |  -2.670671          .        .       .            .           .
                       397  |  -2.595325          .        .       .            .           .
                       398  |  -2.543834          .        .       .            .           .
                       399  |  -2.511436          .        .       .            .           .
                       400  |  -2.514003          .        .       .            .           .
                       409  |  -2.984703          .        .       .            .           .
                       410  |   64.77371    7926172     0.00   1.000    -1.55e+07    1.55e+07
                       411  |   65.31395    7926172     0.00   1.000    -1.55e+07    1.55e+07
                       412  |  -5.157951          .        .       .            .           .
                       413  |   66.60106    7926172     0.00   1.000    -1.55e+07    1.55e+07
                       414  |  -2.750891          .        .       .            .           .
                       415  |  -2.994489          .        .       .            .           .
                       416  |  -92.00255          .        .       .            .           .
                       417  |   68.57926    7926172     0.00   1.000    -1.55e+07    1.55e+07
                       426  |  -2.877614          .        .       .            .           .
                       427  |   -2.86186          .        .       .            .           .
                       428  |  -2.797114          .        .       .            .           .
                       429  |  -2.689514          .        .       .            .           .
                       430  |  -2.650658          .        .       .            .           .
                       431  |  -2.590449          .        .       .            .           .
                       432  |  -2.524319          .        .       .            .           .
                       433  |  -2.465854          .        .       .            .           .
                       434  |  -2.405196          .        .       .            .           .
                       443  |  -137.0307          .        .       .            .           .
                       444  |   63.33585    7926172     0.00   1.000    -1.55e+07    1.55e+07
                       445  |   63.95714    7926172     0.00   1.000    -1.55e+07    1.55e+07
                       446  |   64.69467    7926172     0.00   1.000    -1.55e+07    1.55e+07
                       447  |   65.41112    7926172     0.00   1.000    -1.55e+07    1.55e+07
                       448  |   46.22801    7926237     0.00   1.000    -1.55e+07    1.55e+07
                       449  |   66.61899    7926172     0.00   1.000    -1.55e+07    1.55e+07
                       450  |   67.21108    7926172     0.00   1.000    -1.55e+07    1.55e+07
                       451  |   67.65236    7926172     0.00   1.000    -1.55e+07    1.55e+07
                       460  |  -2.970976          .        .       .            .           .
                       461  |  -2.973312          .        .       .            .           .
                       462  |  -2.842439          .        .       .            .           .
                       463  |   -2.77796          .        .       .            .           .
                       464  |  -2.899087          .        .       .            .           .
                       465  |  -3.601189          .        .       .            .           .
                       466  |  -2.594502          .        .       .            .           .
                       467  |  -2.523197          .        .       .            .           .
                       468  |  -7.106665          .        .       .            .           .
                       477  |  -3.014527          .        .       .            .           .
                       478  |   -2.87273          .        .       .            .           .
                       479  |  -2.863596          .        .       .            .           .
                       480  |  -2.810929          .        .       .            .           .
                       481  |  -2.714504          .        .       .            .           .
                       482  |  -2.609337          .        .       .            .           .
                       483  |  -2.551137          .        .       .            .           .
                       484  |   -2.52255          .        .       .            .           .
                       485  |  -2.438686          .        .       .            .           .
                       494  |  -3.108332          .        .       .            .           .
                       495  |  -3.350229          .        .       .            .           .
                       496  |  -11.06371          .        .       .            .           .
                       497  |   65.20343    7926172     0.00   1.000    -1.55e+07    1.55e+07
                       498  |  -2.875775          .        .       .            .           .
                       499  |  -2.801308          .        .       .            .           .
                       500  |   66.91288    7926172     0.00   1.000    -1.55e+07    1.55e+07
                       501  |   67.59097    7926172     0.00   1.000    -1.55e+07    1.55e+07
                       502  |   68.23605    7926172     0.00   1.000    -1.55e+07    1.55e+07
                       511  |  -2.931313          .        .       .            .           .
                       512  |  -2.829231          .        .       .            .           .
                       513  |  -2.727674          .        .       .            .           .
                       514  |  -2.723692          .        .       .            .           .
                       515  |  -2.597359          .        .       .            .           .
                       516  |  -2.529981          .        .       .            .           .
                       517  |  -2.493438          .        .       .            .           .
                       518  |  -2.438275          .        .       .            .           .
                       519  |  -2.346618          .        .       .            .           .
                       528  |  -2.992477          .        .       .            .           .
                       529  |  -2.937394          .        .       .            .           .
                       530  |  -2.829175          .        .       .            .           .
                       531  |  -2.823616          .        .       .            .           .
                       532  |  -2.712357          .        .       .            .           .
                       533  |  -2.671702          .        .       .            .           .
                       534  |  -2.587499          .        .       .            .           .
                       535  |  -2.544397          .        .       .            .           .
                       536  |   -2.48278          .        .       .            .           .
                       545  |  -2.682397          .        .       .            .           .
                       546  |  -2.555685          .        .       .            .           .
                       547  |  -2.551573          .        .       .            .           .
                       548  |  -2.490268          .        .       .            .           .
                       549  |  -2.419258          .        .       .            .           .
                       550  |  -2.369832          .        .       .            .           .
                       551  |  -2.301451          .        .       .            .           .
                       552  |  -2.230844          .        .       .            .           .
                       553  |  -2.107563          .        .       .            .           .
                       579  |   62.20291    7926172     0.00   1.000    -1.55e+07    1.55e+07
                       580  |   62.89988    7926172     0.00   1.000    -1.55e+07    1.55e+07
                       581  |   63.60114    7926172     0.00   1.000    -1.55e+07    1.55e+07
                       582  |   64.42803    7926172     0.00   1.000    -1.55e+07    1.55e+07
                       583  |   64.91746    7926172     0.00   1.000    -1.55e+07    1.55e+07
                       584  |   65.65194    7926172     0.00   1.000    -1.55e+07    1.55e+07
                       585  |   66.14462    7926172     0.00   1.000    -1.55e+07    1.55e+07
                       586  |   66.62707    7926172     0.00   1.000    -1.55e+07    1.55e+07
                       587  |   66.97084    7926172     0.00   1.000    -1.55e+07    1.55e+07
                       596  |  -2.792158          .        .       .            .           .
                       597  |  -2.750445          .        .       .            .           .
                       598  |  -2.691155          .        .       .            .           .
                       599  |  -2.654895          .        .       .            .           .
                       600  |  -2.572261          .        .       .            .           .
                       601  |  -2.491809          .        .       .            .           .
                       602  |  -2.442918          .        .       .            .           .
                       603  |  -2.355814          .        .       .            .           .
                       604  |  -2.284709          .        .       .            .           .
                       613  |  -2.929433          .        .       .            .           .
                       614  |  -2.903502          .        .       .            .           .
                       615  |  -2.805684          .        .       .            .           .
                       616  |  -2.772868          .        .       .            .           .
                       617  |  -2.730808          .        .       .            .           .
                       618  |  -2.632943          .        .       .            .           .
                       619  |  -2.560777          .        .       .            .           .
                       620  |  -2.540841          .        .       .            .           .
                       621  |  -2.472882          .        .       .            .           .
                       630  |  -2.925199          .        .       .            .           .
                       631  |  -2.918925          .        .       .            .           .
                       632  |  -2.795903          .        .       .            .           .
                       633  |  -2.723841          .        .       .            .           .
                       634  |  -2.756441          .        .       .            .           .
                       635  |  -2.639375          .        .       .            .           .
                       636  |  -2.583358          .        .       .            .           .
                       637  |   -2.49523          .        .       .            .           .
                       638  |  -2.442989          .        .       .            .           .
                       647  |  -2.840817          .        .       .            .           .
                       648  |   -2.68713          .        .       .            .           .
                       649  |  -2.656792          .        .       .            .           .
                       650  |  -2.565933          .        .       .            .           .
                       651  |   -2.53028          .        .       .            .           .
                       652  |  -2.442194          .        .       .            .           .
                       653  |  -2.405036          .        .       .            .           .
                       654  |  -2.335312          .        .       .            .           .
                       655  |  -2.262247          .        .       .            .           .
                       681  |  -3.020251          .        .       .            .           .
                       682  |  -2.889438          .        .       .            .           .
                       683  |    -2.8252          .        .       .            .           .
                       684  |  -2.851306          .        .       .            .           .
                       685  |  -2.698922          .        .       .            .           .
                       686  |  -2.640356          .        .       .            .           .
                       687  |  -2.595614          .        .       .            .           .
                       688  |  -2.555521          .        .       .            .           .
                       689  |   -2.49016          .        .       .            .           .
                       698  |   -2.95709          .        .       .            .           .
                       699  |   -2.85526          .        .       .            .           .
                       700  |   -2.77501          .        .       .            .           .
                       701  |  -2.761384          .        .       .            .           .
                       702  |  -2.650916          .        .       .            .           .
                       703  |  -2.567134          .        .       .            .           .
                       704  |  -2.528861          .        .       .            .           .
                       705  |  -2.483671          .        .       .            .           .
                       706  |  -2.411885          .        .       .            .           .
                       715  |   62.59962    7926172     0.00   1.000    -1.55e+07    1.55e+07
                       716  |   63.14926    7926172     0.00   1.000    -1.55e+07    1.55e+07
                       717  |   63.95479    7926172     0.00   1.000    -1.55e+07    1.55e+07
                       718  |  -3.069564          .        .       .            .           .
                       719  |   65.12676    7926172     0.00   1.000    -1.55e+07    1.55e+07
                       720  |  -3.008394          .        .       .            .           .
                       721  |    66.3145    7926172     0.00   1.000    -1.55e+07    1.55e+07
                       722  |   67.02146    7926172     0.00   1.000    -1.55e+07    1.55e+07
                       723  |   49.44066    7926218     0.00   1.000    -1.55e+07    1.55e+07
                       732  |  -2.871546          .        .       .            .           .
                       733  |  -2.837241          .        .       .            .           .
                       734  |  -2.797546          .        .       .            .           .
                       735  |  -2.718454          .        .       .            .           .
                       736  |  -2.630917          .        .       .            .           .
                       737  |  -2.553874          .        .       .            .           .
                       738  |  -2.508399          .        .       .            .           .
                       739  |  -2.452748          .        .       .            .           .
                       740  |  -2.354236          .        .       .            .           .
                       749  |  -2.396097          .        .       .            .           .
                       750  |  -2.305106          .        .       .            .           .
                       751  |   -2.25117          .        .       .            .           .
                       752  |  -2.206176          .        .       .            .           .
                       753  |   -2.13345          .        .       .            .           .
                       754  |  -2.067996          .        .       .            .           .
                       755  |  -2.016125          .        .       .            .           .
                       756  |  -1.952654          .        .       .            .           .
                       757  |  -1.881313          .        .       .            .           .
                       783  |   63.43768    7926172     0.00   1.000    -1.55e+07    1.55e+07
                       784  |   63.85137    7926172     0.00   1.000    -1.55e+07    1.55e+07
                       785  |   64.83657    7926172     0.00   1.000    -1.55e+07    1.55e+07
                       786  |   65.34606    7926172     0.00   1.000    -1.55e+07    1.55e+07
                       787  |   66.05073    7926172     0.00   1.000    -1.55e+07    1.55e+07
                       788  |   66.42523    7926172     0.00   1.000    -1.55e+07    1.55e+07
                       789  |   67.20213    7926172     0.00   1.000    -1.55e+07    1.55e+07
                       790  |   67.98599    7926172     0.00   1.000    -1.55e+07    1.55e+07
                       791  |   68.50487    7926172     0.00   1.000    -1.55e+07    1.55e+07
                       800  |   62.16877    7926172     0.00   1.000    -1.55e+07    1.55e+07
                       801  |   62.86641    7926172     0.00   1.000    -1.55e+07    1.55e+07
                       802  |   63.61731    7926172     0.00   1.000    -1.55e+07    1.55e+07
                       803  |     64.087    7926172     0.00   1.000    -1.55e+07    1.55e+07
                       804  |   64.96736    7926172     0.00   1.000    -1.55e+07    1.55e+07
                       805  |  -2795.896          .        .       .            .           .
                       806  |   66.25573    7926172     0.00   1.000    -1.55e+07    1.55e+07
                       807  |   66.84567    7926172     0.00   1.000    -1.55e+07    1.55e+07
                       808  |   67.24552    7926172     0.00   1.000    -1.55e+07    1.55e+07
                       817  |  -2.890434          .        .       .            .           .
                       818  |  -2.822253          .        .       .            .           .
                       819  |  -2.785449          .        .       .            .           .
                       820  |  -2.719493          .        .       .            .           .
                       821  |  -2.714041          .        .       .            .           .
                       822  |   -2.59798          .        .       .            .           .
                       823  |  -2.569497          .        .       .            .           .
                       824  |  -2.678551          .        .       .            .           .
                       825  |    -2.4865          .        .       .            .           .
                       834  |   64.61361    7926172     0.00   1.000    -1.55e+07    1.55e+07
                       835  |   -2.96034          .        .       .            .           .
                       836  |  -3.327102          .        .       .            .           .
                       837  |   66.43493    7926172     0.00   1.000    -1.55e+07    1.55e+07
                       838  |   66.90542    7926172     0.00   1.000    -1.55e+07    1.55e+07
                       839  |   66.38369    7926172     0.00   1.000    -1.55e+07    1.55e+07
                       840  |   67.91494    7926172     0.00   1.000    -1.55e+07    1.55e+07
                       841  |   68.55047    7926172     0.00   1.000    -1.55e+07    1.55e+07
                       842  |   69.67495    7926172     0.00   1.000    -1.55e+07    1.55e+07
                       851  |  -3.009263          .        .       .            .           .
                       852  |  -3.011124          .        .       .            .           .
                       853  |  -2.893188          .        .       .            .           .
                       854  |  -2.845378          .        .       .            .           .
                       855  |  -2.741502          .        .       .            .           .
                       856  |  -2.732933          .        .       .            .           .
                       857  |    -2.6973          .        .       .            .           .
                       858  |  -2.628829          .        .       .            .           .
                       859  |  -2.481641          .        .       .            .           .
                       868  |  -2.971874          .        .       .            .           .
                       869  |  -2.888559          .        .       .            .           .
                       870  |  -2.867245          .        .       .            .           .
                       871  |  -2.715642          .        .       .            .           .
                       872  |  -2.690673          .        .       .            .           .
                       873  |  -2.612678          .        .       .            .           .
                       874  |  -2.493468          .        .       .            .           .
                       875  |  -2.453753          .        .       .            .           .
                       876  |  -2.409979          .        .       .            .           .
                       885  |  -3.009858          .        .       .            .           .
                       886  |  -3.021347          .        .       .            .           .
                       887  |  -3.004082          .        .       .            .           .
                       888  |  -3.336816          .        .       .            .           .
                       889  |  -18.64494          .        .       .            .           .
                       890  |   65.22011    7926172     0.00   1.000    -1.55e+07    1.55e+07
                       891  |   65.89961    7926172     0.00   1.000    -1.55e+07    1.55e+07
                       892  |   66.83843    7926172     0.00   1.000    -1.55e+07    1.55e+07
                       893  |  -2.608798          .        .       .            .           .
                            |
                      _cons |  -67.67252    7926172    -0.00   1.000    -1.55e+07    1.55e+07
----------------------------+----------------------------------------------------------------
lnsigma                     |
                 population |   3.55e-07   5.60e-09    63.32   0.000     3.44e-07    3.66e-07
                            |
c.total_deaths#c.population |  -5.22e-11   9.85e-13   -53.05   0.000    -5.42e-11   -5.03e-11
                            |
                      _cons |   2.727664   .0507221    53.78   0.000     2.628251    2.827078
---------------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\favero\AppData\Local\Temp\STD7174_000000.tmp"

. capture program drop reporting_delays

. program reporting_delays
  1.         args lnf detected time alpha lnsigma
  2.         quietly replace `lnf' = ///
>                 ln(normalden( $ML_y1,  `alpha' - `alpha'*exp(-(exp(`time') * $ML_y2 )), exp(`lnsigm
> a'+`detected'*$ML_y2 )))
  3. end

. 
. ml model lf reporting_delays ///
>         (detected: total_deaths = ) ///
>         (time: days_to_report = state_delay) ///
>         (alpha: i.state_end_week) ///
>         (lnsigma: population) if end_week < date("20200401","YMD")

. ml maximize

initial:       log likelihood =     -<inf>  (could not be evaluated)
feasible:      log likelihood = -150977.02
rescale:       log likelihood = -77109.674
rescale eq:    log likelihood = -42570.681
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 0:   log likelihood = -42570.681  (not concave)
Iteration 1:   log likelihood = -39364.844  (not concave)
Iteration 2:   log likelihood = -39364.844  (not concave)
Iteration 3:   log likelihood = -39364.841  (not concave)
Iteration 4:   log likelihood = -36389.283  (not concave)
Iteration 5:   log likelihood = -32023.824  (not concave)
Iteration 6:   log likelihood = -30291.874  (not concave)
Iteration 7:   log likelihood = -28125.697  (not concave)
Iteration 8:   log likelihood = -28125.697  (not concave)
Iteration 9:   log likelihood = -28125.696  (not concave)
Iteration 10:  log likelihood =  -28081.94  (not concave)
Iteration 11:  log likelihood = -28081.824  (not concave)
Iteration 12:  log likelihood = -28081.711  (not concave)
Iteration 13:  log likelihood = -28081.657  (not concave)
Iteration 14:  log likelihood = -27993.596  (not concave)
Iteration 15:  log likelihood = -27924.004  (not concave)
Iteration 16:  log likelihood = -26135.805  (not concave)
Iteration 17:  log likelihood = -25821.034  (not concave)
Iteration 18:  log likelihood = -25678.665  (not concave)
Iteration 19:  log likelihood = -25457.461  (not concave)
Iteration 20:  log likelihood = -24695.765  (not concave)
Iteration 21:  log likelihood = -23752.503  (not concave)
Iteration 22:  log likelihood =  -22244.78  (not concave)
Iteration 23:  log likelihood = -21490.786  (not concave)
Iteration 24:  log likelihood = -21033.747  (not concave)
Iteration 25:  log likelihood = -20283.226  (not concave)
Iteration 26:  log likelihood = -19593.054  (not concave)
Iteration 27:  log likelihood = -19028.591  (not concave)
Iteration 28:  log likelihood = -18424.946  (not concave)
Iteration 29:  log likelihood = -17646.526  (not concave)
Iteration 30:  log likelihood = -17176.797  (not concave)
Iteration 31:  log likelihood = -16637.264  (not concave)
Iteration 32:  log likelihood = -15578.279  (not concave)
Iteration 33:  log likelihood = -15199.711  (not concave)
Iteration 34:  log likelihood = -15060.821  
Iteration 35:  log likelihood = -14328.954  
Iteration 36:  log likelihood = -13779.516  
Iteration 37:  log likelihood = -13341.078  
Iteration 38:  log likelihood = -13144.771  (not concave)
Iteration 39:  log likelihood = -13020.399  (not concave)
Iteration 40:  log likelihood = -13011.699  (not concave)
Iteration 41:  log likelihood = -13006.471  (not concave)
Iteration 42:  log likelihood = -13001.207  (not concave)
Iteration 43:  log likelihood = -12968.899  (not concave)
Iteration 44:  log likelihood = -12936.155  (not concave)
Iteration 45:  log likelihood = -12930.453  (not concave)
Iteration 46:  log likelihood =     -12925  (not concave)
Iteration 47:  log likelihood = -12916.649  
Iteration 48:  log likelihood = -12750.186  (not concave)
Iteration 49:  log likelihood = -12693.144  (not concave)
Iteration 50:  log likelihood = -12686.095  (not concave)
Iteration 51:  log likelihood =  -12660.44  (not concave)
Iteration 52:  log likelihood = -12639.989  (not concave)
Iteration 53:  log likelihood = -12619.248  (not concave)
Iteration 54:  log likelihood = -12606.808  (not concave)
Iteration 55:  log likelihood =  -12600.17  (not concave)
Iteration 56:  log likelihood = -12555.955  
Iteration 57:  log likelihood = -12482.206  (not concave)
Iteration 58:  log likelihood = -12114.103  (not concave)
Iteration 59:  log likelihood = -12070.244  (not concave)
Iteration 60:  log likelihood = -12067.422  (not concave)
Iteration 61:  log likelihood = -12051.914  (not concave)
Iteration 62:  log likelihood = -12042.405  (not concave)
Iteration 63:  log likelihood = -12030.895  (not concave)
Iteration 64:  log likelihood = -12020.569  (not concave)
Iteration 65:  log likelihood =  -12008.71  
Iteration 66:  log likelihood = -11901.864  (not concave)
Iteration 67:  log likelihood = -11785.412  (not concave)
Iteration 68:  log likelihood = -11752.353  (not concave)
Iteration 69:  log likelihood = -11502.971  (not concave)
Iteration 70:  log likelihood = -11472.461  (not concave)
Iteration 71:  log likelihood = -11439.874  (not concave)
Iteration 72:  log likelihood = -11422.703  (not concave)
Iteration 73:  log likelihood = -11363.143  (not concave)
Iteration 74:  log likelihood = -11310.903  (not concave)
Iteration 75:  log likelihood = -11292.417  (not concave)
Iteration 76:  log likelihood = -11273.049  (not concave)
Iteration 77:  log likelihood = -11233.629  
Iteration 78:  log likelihood = -11001.682  
Iteration 79:  log likelihood = -10707.434  
Iteration 80:  log likelihood = -10292.687  (not concave)
Iteration 81:  log likelihood = -10205.878  (not concave)
Iteration 82:  log likelihood = -10194.876  (not concave)
Iteration 83:  log likelihood = -10152.756  (not concave)
Iteration 84:  log likelihood = -10129.456  (not concave)
Iteration 85:  log likelihood =  -10119.45  (not concave)
Iteration 86:  log likelihood =   -10109.8  (not concave)
Iteration 87:  log likelihood = -10102.433  (not concave)
Iteration 88:  log likelihood = -10095.654  (not concave)
Iteration 89:  log likelihood = -10089.494  (not concave)
Iteration 90:  log likelihood = -10083.014  (not concave)
Iteration 91:  log likelihood = -10076.793  (not concave)
Iteration 92:  log likelihood = -10070.766  (not concave)
Iteration 93:  log likelihood = -10064.777  (not concave)
Iteration 94:  log likelihood =  -10058.81  (not concave)
Iteration 95:  log likelihood = -10052.981  (not concave)
Iteration 96:  log likelihood = -10047.206  (not concave)
Iteration 97:  log likelihood = -10041.524  (not concave)
Iteration 98:  log likelihood = -10035.892  (not concave)
Iteration 99:  log likelihood = -10030.366  (not concave)
Iteration 100: log likelihood = -10024.888  (not concave)
Iteration 101: log likelihood = -10019.509  (not concave)
Iteration 102: log likelihood = -10014.177  (not concave)
Iteration 103: log likelihood = -10008.942  (not concave)
Iteration 104: log likelihood = -10003.752  (not concave)
Iteration 105: log likelihood = -9998.6532  (not concave)
Iteration 106: log likelihood = -9993.5988  (not concave)
Iteration 107: log likelihood = -9988.6297  (not concave)
Iteration 108: log likelihood = -9983.7036  (not concave)
Iteration 109: log likelihood =  -9978.857  (not concave)
Iteration 110: log likelihood = -9974.0528  (not concave)
Iteration 111: log likelihood = -9969.3222  (not concave)
Iteration 112: log likelihood = -9964.6329  (not concave)
Iteration 113: log likelihood =  -9960.012  (not concave)
Iteration 114: log likelihood = -9955.4322  (not concave)
Iteration 115: log likelihood = -9950.9157  (not concave)
Iteration 116: log likelihood = -9946.4401  (not concave)
Iteration 117: log likelihood = -9942.0239  (not concave)
Iteration 118: log likelihood = -9937.6481  (not concave)
Iteration 119: log likelihood = -9933.3276  (not concave)
Iteration 120: log likelihood = -9929.0477  (not concave)
Iteration 121: log likelihood = -9924.8198  (not concave)
Iteration 122: log likelihood = -9920.6319  (not concave)
Iteration 123: log likelihood = -9916.4931  (not concave)
Iteration 124: log likelihood = -9912.3942  (not concave)
Iteration 125: log likelihood = -9908.3419  (not concave)
Iteration 126: log likelihood =  -9904.329  (not concave)
Iteration 127: log likelihood = -9900.3602  (not concave)
Iteration 128: log likelihood = -9896.4302  (not concave)
Iteration 129: log likelihood = -9892.5428  (not concave)
Iteration 130: log likelihood = -9888.6933  (not concave)
Iteration 131: log likelihood = -9884.8841  (not concave)
Iteration 132: log likelihood =  -9881.112  (not concave)
Iteration 133: log likelihood = -9877.3791  (not concave)
Iteration 134: log likelihood = -9873.6828  (not concave)
Iteration 135: log likelihood = -9870.0236  (not concave)
Iteration 136: log likelihood = -9866.4001  (not concave)
Iteration 137: log likelihood = -9862.8126  (not concave)
Iteration 138: log likelihood = -9859.2597  (not concave)
Iteration 139: log likelihood = -9855.7415  (not concave)
Iteration 140: log likelihood = -9852.2571  (not concave)
Iteration 141: log likelihood = -9848.8061  (not concave)
Iteration 142: log likelihood = -9845.3882  (not concave)
Iteration 143: log likelihood = -9842.0027  (not concave)
Iteration 144: log likelihood =  -9838.649  (not concave)
Iteration 145: log likelihood = -9835.3265  (not concave)
Iteration 146: log likelihood = -9832.0354  (not concave)
Iteration 147: log likelihood = -9828.7743  (not concave)
Iteration 148: log likelihood = -9825.5432  (not concave)
Iteration 149: log likelihood = -9822.3414  (not concave)
Iteration 150: log likelihood = -9819.1691  (not concave)
Iteration 151: log likelihood = -9816.0249  (not concave)
Iteration 152: log likelihood = -9812.9091  (not concave)
Iteration 153: log likelihood = -9809.8205  (not concave)
Iteration 154: log likelihood = -9806.7596  (not concave)
Iteration 155: log likelihood = -9803.7251  (not concave)
Iteration 156: log likelihood = -9800.7172  (not concave)
Iteration 157: log likelihood = -9797.7349  (not concave)
Iteration 158: log likelihood = -9794.7787  (not concave)
Iteration 159: log likelihood = -9791.8469  (not concave)
Iteration 160: log likelihood = -9788.9403  (not concave)
Iteration 161: log likelihood = -9786.0577  (not concave)
Iteration 162: log likelihood = -9783.1995  (not concave)
Iteration 163: log likelihood = -9780.3643  (not concave)
--Break--
r(1);

end of do-file

--Break--
r(1);

. do "C:\Users\favero\AppData\Local\Temp\STD7174_000000.tmp"

. capture program drop reporting_delays

. program reporting_delays
  1.         args lnf detected time alpha lnsigma
  2.         quietly replace `lnf' = ///
>                 ln(normalden( $ML_y1,  `alpha' - `alpha'*exp(-(exp(`time') * $ML_y2 )), exp(`lnsigm
> a'+`detected'*$ML_y2 )))
  3. end

. 
. ml model lf reporting_delays ///
>         (detected: total_deaths = ) ///
>         (time: days_to_report = state_delay) ///
>         (alpha: i.state_end_week) ///
>         (lnsigma: population) if end_week < date("20200501","YMD")

. ml maximize

initial:       log likelihood =     -<inf>  (could not be evaluated)
feasible:      log likelihood = -182731.15
rescale:       log likelihood = -182731.15
rescale eq:    log likelihood = -178769.61
Iteration 0:   log likelihood = -178769.61  (not concave)
Iteration 1:   log likelihood = -171719.48  (not concave)
Iteration 2:   log likelihood = -171504.87  (not concave)
Iteration 3:   log likelihood = -171483.43  (not concave)
cannot compute an improvement -- discontinuous region encountered
r(430);

end of do-file

r(430);

. do "C:\Users\favero\AppData\Local\Temp\STD7174_000000.tmp"

. 
. ml model lf reporting_delays ///
>         (detected: total_deaths = ) ///
>         (time: days_to_report = state_delay) ///
>         (alpha: i.state_end_week) ///
>         (lnsigma: population c.total_deaths#c.population) if end_week < date("20200501","YMD")

. ml maximize

initial:       log likelihood =     -<inf>  (could not be evaluated)
feasible:      log likelihood = -182731.15
rescale:       log likelihood = -182731.15
rescale eq:    log likelihood = -178769.61
Iteration 0:   log likelihood = -178769.61  (not concave)
Iteration 1:   log likelihood = -171705.91  (not concave)
Iteration 2:   log likelihood = -170847.61  (not concave)
Iteration 3:   log likelihood = -170505.83  (not concave)
Iteration 4:   log likelihood = -170488.78  (not concave)
Iteration 5:   log likelihood = -170475.13  (not concave)
Iteration 6:   log likelihood = -170474.45  (not concave)
cannot compute an improvement -- discontinuous region encountered
r(430);

end of do-file

r(430);

. do "C:\Users\favero\AppData\Local\Temp\STD7174_000000.tmp"

. ml model lf reporting_delays ///
>         (detected: total_deaths = ) ///
>         (time: days_to_report = state_delay) ///
>         (alpha: i.state_end_week) ///
>         (lnsigma: population c.total_deaths#c.population) if end_week < date("20200418","YMD")

. ml maximize

initial:       log likelihood =     -<inf>  (could not be evaluated)
feasible:      log likelihood = -169435.46
rescale:       log likelihood = -87030.434
rescale eq:    log likelihood = -84471.373
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 0:   log likelihood = -84471.373  (not concave)
Iteration 1:   log likelihood = -78161.006  (not concave)
Iteration 2:   log likelihood = -78161.006  (not concave)
Iteration 3:   log likelihood = -78161.006  (not concave)
Iteration 4:   log likelihood = -78161.006  (not concave)
Iteration 5:   log likelihood = -76962.687  (not concave)
Iteration 6:   log likelihood = -73105.103  (not concave)
Iteration 7:   log likelihood = -70311.369  (not concave)
Iteration 8:   log likelihood = -70311.369  (not concave)
Iteration 9:   log likelihood =  -70311.36  (not concave)
Iteration 10:  log likelihood =  -70311.36  (not concave)
Iteration 11:  log likelihood =  -70311.36  (not concave)
Iteration 12:  log likelihood = -69026.297  (not concave)
Iteration 13:  log likelihood = -69026.296  (not concave)
Iteration 14:  log likelihood = -69026.296  (not concave)
Iteration 15:  log likelihood = -66965.801  (not concave)
Iteration 16:  log likelihood = -66579.854  (not concave)
Iteration 17:  log likelihood = -66428.573  (not concave)
Iteration 18:  log likelihood = -66428.102  (not concave)
Iteration 19:  log likelihood = -66427.725  (not concave)
Iteration 20:  log likelihood = -66427.649  (not concave)
numerical derivatives are approximate
nearby values are missing
Iteration 21:  log likelihood = -66427.634  (not concave)
numerical derivatives are approximate
nearby values are missing
cannot compute an improvement -- discontinuous region encountered
r(430);

end of do-file

r(430);

. tab covid_deaths if end_week < date("20200301","YMD")

      (sum) |
covid_death |
          s |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,925       98.21       98.21
          5 |         35        1.79      100.00
------------+-----------------------------------
      Total |      1,960      100.00

. tab covid_deaths if end_week < date("20200315","YMD")

      (sum) |
covid_death |
          s |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,533       92.31       92.31
          5 |        189        6.89       99.20
         10 |          6        0.22       99.42
         19 |          1        0.04       99.45
         20 |          7        0.26       99.71
         26 |          8        0.29      100.00
------------+-----------------------------------
      Total |      2,744      100.00

. sum total_deaths if end_week < date("20200315","YMD")

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_deaths |      2,744    1124.379    1159.491         74       5895

. sum covid_deaths, detail

                     (sum) covid_deaths
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               6,321
25%            0              0       Sum of Wgt.       6,321

50%            5                      Mean           88.37668
                        Largest       Std. Dev.      404.4435
75%           35           6548
90%          170           6570       Variance       163574.5
95%          351           6584       Skewness       10.40868
99%         1658           6595       Kurtosis       134.7826

. do "C:\Users\favero\AppData\Local\Temp\STD7174_000000.tmp"

. capture program drop reporting_delays

. program reporting_delays
  1.         args lnf detected time alpha lnsigma
  2.         quietly replace `lnf' = ///
>                 ln(normalden( $ML_y1,  `alpha' - `alpha'*exp(-(exp(`time') * $ML_y2 )), exp(`lnsigm
> a'+`detected'*$ML_y2 )))
  3. end

. 
. ml model lf reporting_delays ///
>         (detected: total_deaths = ) ///
>         (time: days_to_report = state_delay) ///
>         (alpha: i.state_id) ///
>         (lnsigma: population c.total_deaths#c.population) if end_week < date("20200315","YMD")

. ml maximize

initial:       log likelihood =     -<inf>  (could not be evaluated)
feasible:      log likelihood = -127030.57
rescale:       log likelihood = -33767.721
rescale eq:    log likelihood = -31143.133
Iteration 0:   log likelihood = -31143.133  (not concave)
Iteration 1:   log likelihood = -28995.107  (not concave)
Iteration 2:   log likelihood = -28653.647  (not concave)
Iteration 3:   log likelihood = -28398.416  (not concave)
Iteration 4:   log likelihood = -24978.887  (not concave)
Iteration 5:   log likelihood = -22440.154  (not concave)
Iteration 6:   log likelihood = -20583.454  (not concave)
Iteration 7:   log likelihood = -19074.106  (not concave)
Iteration 8:   log likelihood = -18412.568  (not concave)
Iteration 9:   log likelihood = -17641.226  (not concave)
Iteration 10:  log likelihood = -17258.869  (not concave)
Iteration 11:  log likelihood = -16987.326  
Iteration 12:  log likelihood = -15412.818  (not concave)
Iteration 13:  log likelihood = -15253.984  (not concave)
Iteration 14:  log likelihood = -15174.283  
Iteration 15:  log likelihood = -14376.872  
Iteration 16:  log likelihood = -14167.315  
Iteration 17:  log likelihood = -14057.131  (not concave)
Iteration 18:  log likelihood = -14045.328  (not concave)
Iteration 19:  log likelihood =  -14040.56  (not concave)
Iteration 20:  log likelihood = -14035.976  (not concave)
Iteration 21:  log likelihood = -14032.004  (not concave)
Iteration 22:  log likelihood = -14028.123  (not concave)
Iteration 23:  log likelihood = -14024.694  (not concave)
Iteration 24:  log likelihood =  -14021.52  (not concave)
Iteration 25:  log likelihood = -14018.471  (not concave)
Iteration 26:  log likelihood = -14015.398  (not concave)
Iteration 27:  log likelihood = -14012.361  (not concave)
Iteration 28:  log likelihood =  -14009.32  (not concave)
Iteration 29:  log likelihood = -14006.297  (not concave)
Iteration 30:  log likelihood = -14003.229  (not concave)
Iteration 31:  log likelihood = -14000.164  (not concave)
Iteration 32:  log likelihood = -13997.051  (not concave)
Iteration 33:  log likelihood = -13993.928  (not concave)
Iteration 34:  log likelihood = -13990.741  (not concave)
Iteration 35:  log likelihood =  -13987.54  (not concave)
Iteration 36:  log likelihood = -13984.273  (not concave)
Iteration 37:  log likelihood = -13980.986  (not concave)
Iteration 38:  log likelihood = -13977.628  (not concave)
Iteration 39:  log likelihood = -13974.248  (not concave)
Iteration 40:  log likelihood = -13970.794  (not concave)
Iteration 41:  log likelihood = -13967.314  (not concave)
Iteration 42:  log likelihood = -13963.756  (not concave)
Iteration 43:  log likelihood =  -13960.17  (not concave)
Iteration 44:  log likelihood = -13956.502  (not concave)
Iteration 45:  log likelihood = -13952.803  (not concave)
Iteration 46:  log likelihood = -13949.019  (not concave)
Iteration 47:  log likelihood =   -13945.2  (not concave)
Iteration 48:  log likelihood = -13941.293  (not concave)
Iteration 49:  log likelihood = -13937.346  (not concave)
Iteration 50:  log likelihood = -13933.308  (not concave)
Iteration 51:  log likelihood = -13929.226  (not concave)
Iteration 52:  log likelihood = -13925.049  (not concave)
Iteration 53:  log likelihood = -13920.824  (not concave)
Iteration 54:  log likelihood = -13916.499  (not concave)
Iteration 55:  log likelihood = -13912.122  (not concave)
Iteration 56:  log likelihood = -13907.642  (not concave)
Iteration 57:  log likelihood = -13903.104  (not concave)
Iteration 58:  log likelihood = -13898.458  (not concave)
Iteration 59:  log likelihood = -13893.749  (not concave)
Iteration 60:  log likelihood = -13888.927  (not concave)
Iteration 61:  log likelihood = -13884.036  (not concave)
Iteration 62:  log likelihood = -13879.028  (not concave)
Iteration 63:  log likelihood = -13873.945  (not concave)
Iteration 64:  log likelihood =  -13868.74  (not concave)
Iteration 65:  log likelihood = -13863.454  (not concave)
Iteration 66:  log likelihood =  -13858.04  (not concave)
Iteration 67:  log likelihood = -13852.537  (not concave)
Iteration 68:  log likelihood = -13846.902  (not concave)
Iteration 69:  log likelihood = -13841.171  (not concave)
Iteration 70:  log likelihood = -13835.303  (not concave)
Iteration 71:  log likelihood = -13829.331  (not concave)
Iteration 72:  log likelihood = -13823.216  (not concave)
Iteration 73:  log likelihood =  -13816.99  (not concave)
Iteration 74:  log likelihood = -13810.615  (not concave)
Iteration 75:  log likelihood = -13804.122  (not concave)
Iteration 76:  log likelihood = -13797.475  (not concave)
Iteration 77:  log likelihood =   -13790.7  (not concave)
Iteration 78:  log likelihood = -13783.767  (not concave)
Iteration 79:  log likelihood = -13776.698  (not concave)
Iteration 80:  log likelihood = -13769.466  (not concave)
Iteration 81:  log likelihood = -13762.091  (not concave)
Iteration 82:  log likelihood = -13754.547  (not concave)
Iteration 83:  log likelihood = -13746.852  (not concave)
Iteration 84:  log likelihood = -13738.985  (not concave)
Iteration 85:  log likelihood = -13730.959  (not concave)
Iteration 86:  log likelihood = -13722.758  (not concave)
Iteration 87:  log likelihood = -13714.389  (not concave)
Iteration 88:  log likelihood = -13705.845  (not concave)
Iteration 89:  log likelihood = -13697.126  (not concave)
Iteration 90:  log likelihood =  -13688.23  (not concave)
Iteration 91:  log likelihood = -13679.154  (not concave)
Iteration 92:  log likelihood = -13669.903  (not concave)
Iteration 93:  log likelihood = -13660.466  (not concave)
Iteration 94:  log likelihood = -13650.858  (not concave)
Iteration 95:  log likelihood = -13641.061  (not concave)
Iteration 96:  log likelihood =   -13631.1  (not concave)
Iteration 97:  log likelihood = -13620.948  (not concave)
Iteration 98:  log likelihood = -13610.641  (not concave)
Iteration 99:  log likelihood = -13600.146  (not concave)
Iteration 100: log likelihood = -13589.511  (not concave)
Iteration 101: log likelihood = -13578.693  (not concave)
Iteration 102: log likelihood = -13567.753  (not concave)
Iteration 103: log likelihood = -13556.641  (not concave)
Iteration 104: log likelihood = -13545.432  (not concave)
Iteration 105: log likelihood = -13534.067  (not concave)
Iteration 106: log likelihood = -13522.639  (not concave)
Iteration 107: log likelihood = -13511.078  (not concave)
Iteration 108: log likelihood = -13499.495  (not concave)
Iteration 109: log likelihood = -13487.811  (not concave)
Iteration 110: log likelihood = -13476.156  (not concave)
Iteration 111: log likelihood = -13464.443  (not concave)
Iteration 112: log likelihood = -13452.818  (not concave)
Iteration 113: log likelihood = -13441.189  (not concave)
Iteration 114: log likelihood = -13429.719  (not concave)
Iteration 115: log likelihood = -13418.309  (not concave)
Iteration 116: log likelihood = -13407.131  (not concave)
Iteration 117: log likelihood = -13396.085  (not concave)
Iteration 118: log likelihood = -13385.347  (not concave)
Iteration 119: log likelihood = -13374.815  (not concave)
Iteration 120: log likelihood = -13364.662  (not concave)
Iteration 121: log likelihood = -13354.782  (not concave)
Iteration 122: log likelihood = -13345.334  (not concave)
Iteration 123: log likelihood = -13336.212  (not concave)
Iteration 124: log likelihood = -13327.556  (not concave)
Iteration 125: log likelihood = -13319.256  (not concave)
Iteration 126: log likelihood = -13311.427  (not concave)
Iteration 127: log likelihood = -13303.961  (not concave)
Iteration 128: log likelihood = -13296.948  (not concave)
Iteration 129: log likelihood = -13290.281  (not concave)
Iteration 130: log likelihood = -13284.029  (not concave)
Iteration 131: log likelihood =  -13278.09  (not concave)
Iteration 132: log likelihood = -13272.515  (not concave)
Iteration 133: log likelihood =  -13267.21  (not concave)
Iteration 134: log likelihood = -13262.215  (not concave)
Iteration 135: log likelihood = -13257.442  (not concave)
Iteration 136: log likelihood = -13252.926  (not concave)
Iteration 137: log likelihood = -13248.586  (not concave)
Iteration 138: log likelihood = -13244.452  (not concave)
Iteration 139: log likelihood =  -13240.45  (not concave)
Iteration 140: log likelihood = -13236.611  (not concave)
Iteration 141: log likelihood = -13232.865  (not concave)
Iteration 142: log likelihood = -13229.241  (not concave)
Iteration 143: log likelihood = -13225.675  (not concave)
Iteration 144: log likelihood = -13222.197  (not concave)
Iteration 145: log likelihood = -13218.743  (not concave)
Iteration 146: log likelihood = -13215.346  (not concave)
Iteration 147: log likelihood = -13211.942  (not concave)
Iteration 148: log likelihood = -13208.566  (not concave)
Iteration 149: log likelihood = -13205.152  (not concave)
Iteration 150: log likelihood = -13201.737  (not concave)
Iteration 151: log likelihood = -13198.252  (not concave)
Iteration 152: log likelihood =  -13194.74  (not concave)
Iteration 153: log likelihood =  -13191.12  (not concave)
Iteration 154: log likelihood = -13187.446  (not concave)
Iteration 155: log likelihood = -13183.622  (not concave)
Iteration 156: log likelihood = -13179.713  (not concave)
Iteration 157: log likelihood = -13175.605  (not concave)
Iteration 158: log likelihood = -13171.379  (not concave)
Iteration 159: log likelihood = -13166.892  (not concave)
Iteration 160: log likelihood = -13162.086  (not concave)
Iteration 161: log likelihood = -13154.304  (not concave)
Iteration 162: log likelihood = -13126.234  (not concave)
Iteration 163: log likelihood = -13105.512  (not concave)
Iteration 164: log likelihood = -13096.024  
Iteration 165: log likelihood = -13079.903  
Iteration 166: log likelihood = -13072.824  
Iteration 167: log likelihood = -13072.481  
Iteration 168: log likelihood = -13072.422  
Iteration 169: log likelihood = -13072.413  
Iteration 170: log likelihood = -13072.412  
Iteration 171: log likelihood = -13072.411  
Iteration 172: log likelihood = -13072.411  
Iteration 173: log likelihood = -13072.411  (backed up)
Iteration 174: log likelihood = -13072.411  (backed up)
Iteration 175: log likelihood = -13072.411  (backed up)
Iteration 176: log likelihood = -13072.411  (backed up)
Iteration 177: log likelihood = -13072.411  (backed up)
Iteration 178: log likelihood = -13072.411  (backed up)
Iteration 179: log likelihood = -13072.411  (backed up)
Iteration 180: log likelihood = -13072.411  (backed up)
Iteration 181: log likelihood = -13072.411  (backed up)
Iteration 182: log likelihood = -13072.411  (backed up)
Iteration 183: log likelihood = -13072.411  (backed up)
Iteration 184: log likelihood = -13072.411  (backed up)
Iteration 185: log likelihood = -13072.411  (backed up)
Iteration 186: log likelihood = -13072.411  (backed up)
Iteration 187: log likelihood = -13072.411  (backed up)
Iteration 188: log likelihood = -13072.411  (backed up)
Iteration 189: log likelihood = -13072.411  (backed up)
Iteration 190: log likelihood = -13072.411  (backed up)
Iteration 191: log likelihood = -13072.411  (backed up)
Iteration 192: log likelihood = -13072.411  (backed up)
Iteration 193: log likelihood = -13072.411  (backed up)
Iteration 194: log likelihood = -13072.411  (backed up)
Iteration 195: log likelihood = -13072.411  (backed up)
Iteration 196: log likelihood = -13072.411  (backed up)
Iteration 197: log likelihood = -13072.411  (backed up)
Iteration 198: log likelihood = -13072.411  (backed up)
Iteration 199: log likelihood = -13072.411  (backed up)
Iteration 200: log likelihood = -13072.411  (backed up)
Iteration 201: log likelihood = -13072.411  (backed up)
Iteration 202: log likelihood = -13072.411  (backed up)
Iteration 203: log likelihood = -13072.411  (backed up)
Iteration 204: log likelihood = -13072.411  (backed up)
Iteration 205: log likelihood = -13072.411  (backed up)
Iteration 206: log likelihood = -13072.411  (backed up)
Iteration 207: log likelihood = -13072.411  (backed up)
Iteration 208: log likelihood = -13072.411  (backed up)
Iteration 209: log likelihood = -13072.411  (backed up)
Iteration 210: log likelihood = -13072.411  (backed up)
Iteration 211: log likelihood = -13072.411  (backed up)
Iteration 212: log likelihood = -13072.411  (backed up)
Iteration 213: log likelihood = -13072.411  (backed up)
Iteration 214: log likelihood = -13072.411  (backed up)
Iteration 215: log likelihood = -13072.411  (backed up)
Iteration 216: log likelihood = -13072.411  (backed up)
Iteration 217: log likelihood = -13072.411  (backed up)
Iteration 218: log likelihood = -13072.411  (backed up)
Iteration 219: log likelihood = -13072.411  (backed up)
Iteration 220: log likelihood = -13072.411  (backed up)
Iteration 221: log likelihood = -13072.411  (backed up)
Iteration 222: log likelihood = -13072.411  (backed up)
Iteration 223: log likelihood = -13072.411  (backed up)
Iteration 224: log likelihood = -13072.411  (backed up)
Iteration 225: log likelihood = -13072.411  (backed up)
Iteration 226: log likelihood = -13072.411  (backed up)
Iteration 227: log likelihood = -13072.411  (backed up)
Iteration 228: log likelihood = -13072.411  (backed up)
Iteration 229: log likelihood = -13072.411  (backed up)
Iteration 230: log likelihood = -13072.411  (backed up)
Iteration 231: log likelihood = -13072.411  (backed up)
Iteration 232: log likelihood = -13072.411  (backed up)
Iteration 233: log likelihood = -13072.411  (backed up)
Iteration 234: log likelihood = -13072.411  (backed up)
Iteration 235: log likelihood = -13072.411  (backed up)
Iteration 236: log likelihood = -13072.411  (backed up)
Iteration 237: log likelihood = -13072.411  (backed up)
Iteration 238: log likelihood = -13072.411  (backed up)
Iteration 239: log likelihood = -13072.411  (backed up)
Iteration 240: log likelihood = -13072.411  (backed up)
Iteration 241: log likelihood = -13072.411  (backed up)
Iteration 242: log likelihood = -13072.411  (backed up)
Iteration 243: log likelihood = -13072.411  (backed up)
Iteration 244: log likelihood = -13072.411  (backed up)
Iteration 245: log likelihood = -13072.411  (backed up)
Iteration 246: log likelihood = -13072.411  (backed up)
Iteration 247: log likelihood = -13072.411  (backed up)
Iteration 248: log likelihood = -13072.411  (backed up)
Iteration 249: log likelihood = -13072.411  (backed up)
Iteration 250: log likelihood = -13072.411  (backed up)
Iteration 251: log likelihood = -13072.411  (backed up)
Iteration 252: log likelihood = -13072.411  (backed up)
Iteration 253: log likelihood = -13072.411  (backed up)
Iteration 254: log likelihood = -13072.411  (backed up)
Iteration 255: log likelihood = -13072.411  (backed up)
Iteration 256: log likelihood = -13072.411  (backed up)
Iteration 257: log likelihood = -13072.411  (backed up)
Iteration 258: log likelihood = -13072.411  (backed up)
Iteration 259: log likelihood = -13072.411  (backed up)
Iteration 260: log likelihood = -13072.411  (backed up)
Iteration 261: log likelihood = -13072.411  (backed up)
Iteration 262: log likelihood = -13072.411  (backed up)
Iteration 263: log likelihood = -13072.411  (backed up)
Iteration 264: log likelihood = -13072.411  (backed up)
Iteration 265: log likelihood = -13072.411  (backed up)
Iteration 266: log likelihood = -13072.411  (backed up)
Iteration 267: log likelihood = -13072.411  (backed up)
Iteration 268: log likelihood = -13072.411  (backed up)
Iteration 269: log likelihood = -13072.411  (backed up)
Iteration 270: log likelihood = -13072.411  (backed up)
Iteration 271: log likelihood = -13072.411  (backed up)
Iteration 272: log likelihood = -13072.411  (backed up)
Iteration 273: log likelihood = -13072.411  (backed up)
Iteration 274: log likelihood = -13072.411  (backed up)
Iteration 275: log likelihood = -13072.411  (backed up)
Iteration 276: log likelihood = -13072.411  (backed up)
Iteration 277: log likelihood = -13072.411  (backed up)
Iteration 278: log likelihood = -13072.411  (backed up)
Iteration 279: log likelihood = -13072.411  (backed up)
Iteration 280: log likelihood = -13072.411  (backed up)
Iteration 281: log likelihood = -13072.411  (backed up)
Iteration 282: log likelihood = -13072.411  (backed up)
Iteration 283: log likelihood = -13072.411  (backed up)
Iteration 284: log likelihood = -13072.411  (backed up)
Iteration 285: log likelihood = -13072.411  (backed up)
Iteration 286: log likelihood = -13072.411  (backed up)
Iteration 287: log likelihood = -13072.411  (backed up)
Iteration 288: log likelihood = -13072.411  (backed up)
Iteration 289: log likelihood = -13072.411  (backed up)
Iteration 290: log likelihood = -13072.411  (backed up)
Iteration 291: log likelihood = -13072.411  (backed up)
Iteration 292: log likelihood = -13072.411  (backed up)
Iteration 293: log likelihood = -13072.411  (backed up)
Iteration 294: log likelihood = -13072.411  (backed up)
Iteration 295: log likelihood = -13072.411  (backed up)
Iteration 296: log likelihood = -13072.411  (backed up)
Iteration 297: log likelihood = -13072.411  (backed up)
Iteration 298: log likelihood = -13072.411  (backed up)
Iteration 299: log likelihood = -13072.411  (backed up)
Iteration 300: log likelihood = -13072.411  (backed up)
convergence not achieved

                                                Number of obs     =      2,744
                                                Wald chi2(0)      =          .
Log likelihood = -13072.411                     Prob > chi2       =          .

---------------------------------------------------------------------------------------------
                            |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------------+----------------------------------------------------------------
detected                    |
                      _cons |   .0007418   .0009679     0.77   0.443    -.0011552    .0026388
----------------------------+----------------------------------------------------------------
time                        |
                state_delay |   18.11869   737.5965     0.02   0.980    -1427.544    1463.781
                      _cons |   7.008113   367.1075     0.02   0.985    -712.5095    726.5257
----------------------------+----------------------------------------------------------------
alpha                       |
                   state_id |
                         2  |  -989.7837   4.197858  -235.78   0.000    -998.0114   -981.5561
                         3  |     245.37     6.0863    40.32   0.000      233.441    257.2989
                         4  |  -403.6864   4.643697   -86.93   0.000    -412.7879   -394.5849
                         5  |   4621.826   14.72483   313.88   0.000     4592.966    4650.686
                         6  |  -246.4802   5.513401   -44.71   0.000    -257.2862   -235.6741
                         7  |  -890.1453    4.23558  -210.16   0.000    -898.4468   -881.8437
                         8  |  -951.8122   4.198579  -226.70   0.000    -960.0413   -943.5831
                         9  |   3346.041   9.802832   341.33   0.000     3326.828    3365.254
                        10  |   660.7595   7.706283    85.74   0.000     645.6555    675.8636
                        11  |  -828.7646   4.312167  -192.19   0.000    -837.2162   -820.3129
                        12  |  -789.4345   4.384357  -180.06   0.000    -798.0277   -780.8413
                        13  |   1130.118   8.624574   131.03   0.000     1113.214    1147.022
                        14  |   310.1705   5.730765    54.12   0.000     298.9385    321.4026
                        15  |   -449.533   4.673303   -96.19   0.000    -458.6925   -440.3735
                        16  |  -529.5558   4.618718  -114.65   0.000    -538.6083   -520.5033
                        17  |  -104.2568   5.004809   -20.83   0.000    -114.0661    -94.4476
                        18  |  -134.2418   5.071312   -26.47   0.000    -144.1814   -124.3022
                        19  |  -768.4361   4.296655  -178.85   0.000    -776.8574   -760.0148
                        20  |  -53.65277   5.571543    -9.63   0.000     -64.5728   -42.73275
                        21  |   160.7752   5.896347    27.27   0.000     149.2185    172.3318
                        22  |   902.9588   7.048407   128.11   0.000     889.1441    916.7734
                        23  |  -152.6881   5.445381   -28.04   0.000    -163.3608   -142.0153
                        24  |  -432.7836   4.627113   -93.53   0.000    -441.8526   -423.7146
                        25  |   251.7018   5.532456    45.50   0.000     240.8584    262.5452
                        26  |  -858.2913   4.252667  -201.82   0.000    -866.6264   -849.9562
                        27  |  -731.5671   4.411033  -165.85   0.000    -740.2126   -722.9217
                        28  |  -537.4049   4.671582  -115.04   0.000    -546.5611   -528.2488
                        29  |  -824.9334   4.301096  -191.80   0.000    -833.3634   -816.5034
                        30  |   426.6709   6.768583    63.04   0.000     413.4048    439.9371
                        31  |  -706.9998   4.443818  -159.10   0.000    -715.7095   -698.2901
                        32  |   2061.839   12.72821   161.99   0.000     2036.892    2086.786
                        33  |  -925.4405   4.210967  -219.77   0.000    -933.6938   -917.1871
                        34  |   1374.947   7.722713   178.04   0.000     1359.811    1390.083
                        35  |  -306.7162   4.882055   -62.83   0.000    -316.2848   -297.1475
                        36  |  -330.1448   4.964947   -66.50   0.000     -339.876   -320.4137
                        37  |   894.0697    9.13897    97.83   0.000     876.1576    911.9817
                        38  |  -857.0826   4.249468  -201.69   0.000    -865.4114   -848.7538
                        39  |  -11.77198   5.245937    -2.24   0.025    -22.05382   -1.490129
                        40  |   -904.938   4.223404  -214.27   0.000    -913.2157   -896.6603
                        41  |   469.4422   5.707536    82.25   0.000     458.2556    480.6287
                        42  |   3125.839   17.99954   173.66   0.000     3090.561    3161.118
                        43  |  -698.4032   4.756623  -146.83   0.000     -707.726   -689.0804
                        44  |  -950.5525   4.191062  -226.80   0.000    -958.7668   -942.3382
                        45  |   359.5844   6.615974    54.35   0.000     346.6173    372.5515
                        46  |   88.06955   6.268234    14.05   0.000     75.78404    100.3551
                        47  |  -606.2908   4.375183  -138.57   0.000     -614.866   -597.7156
                        48  |   48.30679   5.449232     8.86   0.000     37.62649    58.98709
                        49  |  -983.6325   4.174169  -235.65   0.000    -991.8137   -975.4512
                            |
                      _cons |   1073.866   3.622318   296.46   0.000     1066.767    1080.966
----------------------------+----------------------------------------------------------------
lnsigma                     |
                 population |   1.50e-07   6.60e-09    22.74   0.000     1.37e-07    1.63e-07
                            |
c.total_deaths#c.population |  -1.75e-11   1.18e-12   -14.86   0.000    -1.98e-11   -1.52e-11
                            |
                      _cons |   2.589135   .0939959    27.55   0.000     2.404906    2.773364
---------------------------------------------------------------------------------------------
convergence not achieved
r(430);

end of do-file

r(430);

. do "C:\Users\favero\AppData\Local\Temp\STD7174_000000.tmp"

. ml model lf reporting_delays ///
>         (detected: total_deaths = ) ///
>         (time: days_to_report = state_delay, nocons) ///
>         (alpha: i.state_id) ///
>         (lnsigma: population c.total_deaths#c.population) if end_week < date("20200315","YMD")

. ml maximize

initial:       log likelihood =     -<inf>  (could not be evaluated)
feasible:      log likelihood = -127030.57
rescale:       log likelihood = -33767.721
rescale eq:    log likelihood = -31143.133
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 0:   log likelihood = -31143.133  (not concave)
Iteration 1:   log likelihood = -28128.541  (not concave)
Iteration 2:   log likelihood = -27670.438  (not concave)
Iteration 3:   log likelihood = -25520.562  (not concave)
Iteration 4:   log likelihood = -22097.891  
Iteration 5:   log likelihood = -15854.446  (not concave)
Iteration 6:   log likelihood = -14200.093  (not concave)
Iteration 7:   log likelihood = -14119.974  
Iteration 8:   log likelihood = -14045.321  (backed up)
Iteration 9:   log likelihood = -13870.011  
Iteration 10:  log likelihood = -13669.119  (not concave)
Iteration 11:  log likelihood = -13630.845  (not concave)
Iteration 12:  log likelihood = -13618.232  (not concave)
Iteration 13:  log likelihood = -13601.837  (not concave)
Iteration 14:  log likelihood = -13590.198  (not concave)
Iteration 15:  log likelihood = -13578.358  (not concave)
Iteration 16:  log likelihood =  -13505.01  
Iteration 17:  log likelihood = -13303.687  
Iteration 18:  log likelihood = -13176.646  
Iteration 19:  log likelihood = -13110.948  
Iteration 20:  log likelihood = -13088.829  
Iteration 21:  log likelihood =  -13076.08  
Iteration 22:  log likelihood = -13073.026  
Iteration 23:  log likelihood = -13072.493  
Iteration 24:  log likelihood = -13072.425  
Iteration 25:  log likelihood = -13072.414  
Iteration 26:  log likelihood = -13072.413  
Iteration 27:  log likelihood = -13072.412  
Iteration 28:  log likelihood = -13072.412  
Iteration 29:  log likelihood = -13072.412  (backed up)
Iteration 30:  log likelihood = -13072.412  (backed up)
Iteration 31:  log likelihood = -13072.412  (backed up)
Iteration 32:  log likelihood = -13072.412  (backed up)
Iteration 33:  log likelihood = -13072.412  (backed up)
Iteration 34:  log likelihood = -13072.412  (backed up)
Iteration 35:  log likelihood = -13072.412  (backed up)
Iteration 36:  log likelihood = -13072.412  (backed up)
Iteration 37:  log likelihood = -13072.412  (backed up)
Iteration 38:  log likelihood = -13072.412  (backed up)
Iteration 39:  log likelihood = -13072.412  (backed up)
Iteration 40:  log likelihood = -13072.412  (backed up)
Iteration 41:  log likelihood = -13072.412  (backed up)
Iteration 42:  log likelihood = -13072.412  (backed up)
Iteration 43:  log likelihood = -13072.412  (backed up)
Iteration 44:  log likelihood = -13072.412  (backed up)
Iteration 45:  log likelihood = -13072.412  (backed up)
Iteration 46:  log likelihood = -13072.412  (backed up)
Iteration 47:  log likelihood = -13072.412  (backed up)
Iteration 48:  log likelihood = -13072.412  (backed up)
Iteration 49:  log likelihood = -13072.412  (backed up)
Iteration 50:  log likelihood = -13072.412  (backed up)
Iteration 51:  log likelihood = -13072.412  (backed up)
Iteration 52:  log likelihood = -13072.412  (backed up)
Iteration 53:  log likelihood = -13072.412  (backed up)
Iteration 54:  log likelihood = -13072.412  (backed up)
Iteration 55:  log likelihood = -13072.412  (backed up)
Iteration 56:  log likelihood = -13072.412  (backed up)
Iteration 57:  log likelihood = -13072.412  (backed up)
Iteration 58:  log likelihood = -13072.412  (backed up)
Iteration 59:  log likelihood = -13072.412  (backed up)
Iteration 60:  log likelihood = -13072.412  (backed up)
Iteration 61:  log likelihood = -13072.412  (backed up)
Iteration 62:  log likelihood = -13072.412  (backed up)
Iteration 63:  log likelihood = -13072.412  (backed up)
Iteration 64:  log likelihood = -13072.412  (backed up)
Iteration 65:  log likelihood = -13072.412  (backed up)
Iteration 66:  log likelihood = -13072.412  (backed up)
Iteration 67:  log likelihood = -13072.412  (backed up)
Iteration 68:  log likelihood = -13072.412  (backed up)
Iteration 69:  log likelihood = -13072.412  (backed up)
Iteration 70:  log likelihood = -13072.412  (backed up)
Iteration 71:  log likelihood = -13072.412  (backed up)
Iteration 72:  log likelihood = -13072.412  (backed up)
Iteration 73:  log likelihood = -13072.412  (backed up)
Iteration 74:  log likelihood = -13072.412  (backed up)
Iteration 75:  log likelihood = -13072.412  (backed up)
Iteration 76:  log likelihood = -13072.412  (backed up)
Iteration 77:  log likelihood = -13072.412  (backed up)
Iteration 78:  log likelihood = -13072.412  (backed up)
Iteration 79:  log likelihood = -13072.412  (backed up)
Iteration 80:  log likelihood = -13072.412  (backed up)
Iteration 81:  log likelihood = -13072.412  (backed up)
Iteration 82:  log likelihood = -13072.412  (backed up)
Iteration 83:  log likelihood = -13072.412  (backed up)
Iteration 84:  log likelihood = -13072.412  (backed up)
Iteration 85:  log likelihood = -13072.412  (backed up)
Iteration 86:  log likelihood = -13072.412  (backed up)
Iteration 87:  log likelihood = -13072.412  (backed up)
Iteration 88:  log likelihood = -13072.412  (backed up)
Iteration 89:  log likelihood = -13072.412  (backed up)
Iteration 90:  log likelihood = -13072.412  (backed up)
Iteration 91:  log likelihood = -13072.412  (backed up)
Iteration 92:  log likelihood = -13072.412  (backed up)
Iteration 93:  log likelihood = -13072.412  (backed up)
Iteration 94:  log likelihood = -13072.412  (backed up)
Iteration 95:  log likelihood = -13072.412  (backed up)
Iteration 96:  log likelihood = -13072.412  (backed up)
Iteration 97:  log likelihood = -13072.412  (backed up)
Iteration 98:  log likelihood = -13072.412  (backed up)
Iteration 99:  log likelihood = -13072.412  (backed up)
Iteration 100: log likelihood = -13072.412  (backed up)
Iteration 101: log likelihood = -13072.412  (backed up)
Iteration 102: log likelihood = -13072.412  (backed up)
Iteration 103: log likelihood = -13072.412  (backed up)
Iteration 104: log likelihood = -13072.412  (backed up)
Iteration 105: log likelihood = -13072.412  (backed up)
Iteration 106: log likelihood = -13072.412  (backed up)
Iteration 107: log likelihood = -13072.412  (backed up)
Iteration 108: log likelihood = -13072.412  (backed up)
Iteration 109: log likelihood = -13072.412  (backed up)
Iteration 110: log likelihood = -13072.412  (backed up)
Iteration 111: log likelihood = -13072.412  (backed up)
Iteration 112: log likelihood = -13072.412  (backed up)
Iteration 113: log likelihood = -13072.412  (backed up)
Iteration 114: log likelihood = -13072.412  (backed up)
Iteration 115: log likelihood = -13072.412  (backed up)
Iteration 116: log likelihood = -13072.412  (backed up)
Iteration 117: log likelihood = -13072.412  (backed up)
Iteration 118: log likelihood = -13072.412  (backed up)
Iteration 119: log likelihood = -13072.412  (backed up)
Iteration 120: log likelihood = -13072.412  (backed up)
Iteration 121: log likelihood = -13072.412  (backed up)
Iteration 122: log likelihood = -13072.412  (backed up)
Iteration 123: log likelihood = -13072.412  (backed up)
Iteration 124: log likelihood = -13072.412  (backed up)
Iteration 125: log likelihood = -13072.412  (backed up)
Iteration 126: log likelihood = -13072.412  (backed up)
Iteration 127: log likelihood = -13072.412  (backed up)
Iteration 128: log likelihood = -13072.412  (backed up)
Iteration 129: log likelihood = -13072.412  (backed up)
Iteration 130: log likelihood = -13072.412  (backed up)
Iteration 131: log likelihood = -13072.412  (backed up)
Iteration 132: log likelihood = -13072.412  (backed up)
Iteration 133: log likelihood = -13072.412  (backed up)
Iteration 134: log likelihood = -13072.412  (backed up)
Iteration 135: log likelihood = -13072.412  (backed up)
Iteration 136: log likelihood = -13072.412  (backed up)
Iteration 137: log likelihood = -13072.412  (backed up)
Iteration 138: log likelihood = -13072.412  (backed up)
Iteration 139: log likelihood = -13072.412  (backed up)
Iteration 140: log likelihood = -13072.412  (backed up)
Iteration 141: log likelihood = -13072.412  (backed up)
Iteration 142: log likelihood = -13072.412  (backed up)
Iteration 143: log likelihood = -13072.412  (backed up)
Iteration 144: log likelihood = -13072.412  (backed up)
Iteration 145: log likelihood = -13072.412  (backed up)
Iteration 146: log likelihood = -13072.412  (backed up)
Iteration 147: log likelihood = -13072.412  (backed up)
Iteration 148: log likelihood = -13072.412  (backed up)
Iteration 149: log likelihood = -13072.412  (backed up)
Iteration 150: log likelihood = -13072.412  (backed up)
Iteration 151: log likelihood = -13072.412  (backed up)
Iteration 152: log likelihood = -13072.412  (backed up)
Iteration 153: log likelihood = -13072.412  (backed up)
Iteration 154: log likelihood = -13072.412  (backed up)
Iteration 155: log likelihood = -13072.412  (backed up)
Iteration 156: log likelihood = -13072.412  (backed up)
Iteration 157: log likelihood = -13072.412  (backed up)
Iteration 158: log likelihood = -13072.412  (backed up)
Iteration 159: log likelihood = -13072.412  (backed up)
Iteration 160: log likelihood = -13072.412  (backed up)
Iteration 161: log likelihood = -13072.412  (backed up)
Iteration 162: log likelihood = -13072.412  (backed up)
Iteration 163: log likelihood = -13072.412  (backed up)
Iteration 164: log likelihood = -13072.412  (backed up)
Iteration 165: log likelihood = -13072.412  (backed up)
Iteration 166: log likelihood = -13072.412  (backed up)
Iteration 167: log likelihood = -13072.412  (backed up)
Iteration 168: log likelihood = -13072.412  (backed up)
Iteration 169: log likelihood = -13072.412  (backed up)
Iteration 170: log likelihood = -13072.412  (backed up)
Iteration 171: log likelihood = -13072.412  (backed up)
Iteration 172: log likelihood = -13072.412  (backed up)
Iteration 173: log likelihood = -13072.412  (backed up)
Iteration 174: log likelihood = -13072.412  (backed up)
Iteration 175: log likelihood = -13072.412  (backed up)
Iteration 176: log likelihood = -13072.412  (backed up)
Iteration 177: log likelihood = -13072.412  (backed up)
Iteration 178: log likelihood = -13072.412  (backed up)
Iteration 179: log likelihood = -13072.412  (backed up)
Iteration 180: log likelihood = -13072.412  (backed up)
Iteration 181: log likelihood = -13072.412  (backed up)
Iteration 182: log likelihood = -13072.412  (backed up)
Iteration 183: log likelihood = -13072.412  (backed up)
Iteration 184: log likelihood = -13072.412  (backed up)
Iteration 185: log likelihood = -13072.412  (backed up)
Iteration 186: log likelihood = -13072.412  (backed up)
Iteration 187: log likelihood = -13072.412  (backed up)
Iteration 188: log likelihood = -13072.412  (backed up)
Iteration 189: log likelihood = -13072.412  (backed up)
Iteration 190: log likelihood = -13072.412  (backed up)
Iteration 191: log likelihood = -13072.412  (backed up)
Iteration 192: log likelihood = -13072.412  (backed up)
Iteration 193: log likelihood = -13072.412  (backed up)
Iteration 194: log likelihood = -13072.412  (backed up)
Iteration 195: log likelihood = -13072.412  (backed up)
Iteration 196: log likelihood = -13072.412  (backed up)
Iteration 197: log likelihood = -13072.412  (backed up)
Iteration 198: log likelihood = -13072.412  (backed up)
Iteration 199: log likelihood = -13072.412  (backed up)
Iteration 200: log likelihood = -13072.412  (backed up)
Iteration 201: log likelihood = -13072.412  (backed up)
Iteration 202: log likelihood = -13072.412  (backed up)
Iteration 203: log likelihood = -13072.412  (backed up)
Iteration 204: log likelihood = -13072.412  (backed up)
Iteration 205: log likelihood = -13072.412  (backed up)
Iteration 206: log likelihood = -13072.412  (backed up)
Iteration 207: log likelihood = -13072.412  (backed up)
Iteration 208: log likelihood = -13072.412  (backed up)
Iteration 209: log likelihood = -13072.412  (backed up)
Iteration 210: log likelihood = -13072.412  (backed up)
Iteration 211: log likelihood = -13072.412  (backed up)
Iteration 212: log likelihood = -13072.412  (backed up)
Iteration 213: log likelihood = -13072.412  (backed up)
Iteration 214: log likelihood = -13072.412  (backed up)
Iteration 215: log likelihood = -13072.412  (backed up)
Iteration 216: log likelihood = -13072.412  (backed up)
Iteration 217: log likelihood = -13072.412  (backed up)
Iteration 218: log likelihood = -13072.412  (backed up)
Iteration 219: log likelihood = -13072.412  (backed up)
Iteration 220: log likelihood = -13072.412  (backed up)
Iteration 221: log likelihood = -13072.412  (backed up)
Iteration 222: log likelihood = -13072.412  (backed up)
Iteration 223: log likelihood = -13072.412  (backed up)
Iteration 224: log likelihood = -13072.412  (backed up)
Iteration 225: log likelihood = -13072.412  (backed up)
Iteration 226: log likelihood = -13072.412  (backed up)
Iteration 227: log likelihood = -13072.412  (backed up)
Iteration 228: log likelihood = -13072.412  (backed up)
Iteration 229: log likelihood = -13072.412  (backed up)
Iteration 230: log likelihood = -13072.412  (backed up)
Iteration 231: log likelihood = -13072.412  (backed up)
Iteration 232: log likelihood = -13072.412  (backed up)
Iteration 233: log likelihood = -13072.412  (backed up)
Iteration 234: log likelihood = -13072.412  (backed up)
Iteration 235: log likelihood = -13072.412  (backed up)
Iteration 236: log likelihood = -13072.412  (backed up)
Iteration 237: log likelihood = -13072.412  (backed up)
Iteration 238: log likelihood = -13072.412  (backed up)
Iteration 239: log likelihood = -13072.412  (backed up)
Iteration 240: log likelihood = -13072.412  (backed up)
Iteration 241: log likelihood = -13072.412  (backed up)
Iteration 242: log likelihood = -13072.412  (backed up)
Iteration 243: log likelihood = -13072.412  (backed up)
Iteration 244: log likelihood = -13072.412  (backed up)
Iteration 245: log likelihood = -13072.412  (backed up)
--Break--
r(1);

end of do-file

--Break--
r(1);

. do "C:\Users\favero\AppData\Local\Temp\STD7174_000000.tmp"

. ml model lf reporting_delays ///
>         (detected: total_deaths = ) ///
>         (time: days_to_report = state_delay) ///
>         (alpha: i.state_end_week) ///
>         (lnsigma: population c.total_deaths#c.population) if end_week < date("20200515","YMD")

. ml maximize

initial:       log likelihood =     -<inf>  (could not be evaluated)
feasible:      log likelihood =  -466722.5
rescale:       log likelihood =  -466722.5
rescale eq:    log likelihood = -454686.61
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 0:   log likelihood = -454686.61  (not concave)
Iteration 1:   log likelihood = -418482.69  (not concave)
Iteration 2:   log likelihood =  -410114.8  (not concave)
Iteration 3:   log likelihood = -407208.38  (not concave)
Iteration 4:   log likelihood = -402589.25  (not concave)
Iteration 5:   log likelihood = -402360.91  (not concave)
Iteration 6:   log likelihood = -379109.94  (not concave)
Iteration 7:   log likelihood = -374732.27  (not concave)
Iteration 8:   log likelihood = -318826.35  (not concave)
Iteration 9:   log likelihood = -315640.03  (not concave)
Iteration 10:  log likelihood = -305547.24  (not concave)
Iteration 11:  log likelihood = -305058.72  (not concave)
Iteration 12:  log likelihood = -304863.63  (not concave)
Iteration 13:  log likelihood = -304858.75  (not concave)
Iteration 14:  log likelihood = -304854.85  (not concave)
numerical derivatives are approximate
nearby values are missing
cannot compute an improvement -- discontinuous region encountered
r(430);

end of do-file

r(430);

. do "C:\Users\favero\AppData\Local\Temp\STD7174_000000.tmp"

. 
. ml model lf reporting_delays ///
>         (detected: total_deaths = ) ///
>         (time: days_to_report = state_delay) ///
>         (alpha: i.state_id) ///
>         (lnsigma: population c.total_deaths#c.population) if end_week < date("20200515","YMD")

. ml maximize

initial:       log likelihood =     -<inf>  (could not be evaluated)
feasible:      log likelihood =  -466722.5
rescale:       log likelihood =  -466722.5
rescale eq:    log likelihood = -454686.61
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 0:   log likelihood = -454686.61  (not concave)
Iteration 1:   log likelihood = -418518.99  (not concave)
Iteration 2:   log likelihood =  -401761.2  (not concave)
Iteration 3:   log likelihood = -400956.73  (not concave)
Iteration 4:   log likelihood = -400876.44  (not concave)
Iteration 5:   log likelihood = -400868.42  (not concave)
numerical derivatives are approximate
nearby values are missing
Iteration 6:   log likelihood = -400866.81  (not concave)
numerical derivatives are approximate
nearby values are missing
cannot compute an improvement -- discontinuous region encountered
r(430);

end of do-file

r(430);

. do "C:\Users\favero\AppData\Local\Temp\STD7174_000000.tmp"

. ml model lf reporting_delays ///
>         (detected: total_deaths = ) ///
>         (time: days_to_report =  i.state_id) ///
>         (alpha: i.state_id) ///
>         (lnsigma: population c.total_deaths#c.population) if end_week < date("20200515","YMD")

. ml maximize

initial:       log likelihood =     -<inf>  (could not be evaluated)
feasible:      log likelihood =  -466722.5
rescale:       log likelihood =  -466722.5
rescale eq:    log likelihood = -454686.61
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 0:   log likelihood = -454686.61  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 1:   log likelihood = -452415.23  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 2:   log likelihood = -451284.86  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 3:   log likelihood = -451059.76  (not concave)
cannot compute an improvement -- discontinuous region encountered
r(430);

end of do-file

r(430);

. do "C:\Users\favero\AppData\Local\Temp\STD7174_000000.tmp"

. ml model lf reporting_delays ///
>         (detected: total_deaths = ) ///
>         (time: days_to_report =  i.state_id) ///
>         (alpha: population) ///
>         (lnsigma: population c.total_deaths#c.population) if end_week < date("20200515","YMD")

. ml maximize

initial:       log likelihood =     -<inf>  (could not be evaluated)
feasible:      log likelihood =  -466722.5
rescale:       log likelihood =  -466722.5
rescale eq:    log likelihood = -454686.61
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 0:   log likelihood = -454686.61  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 1:   log likelihood = -452415.81  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 2:   log likelihood =  -451850.5  (not concave)
numerical derivatives are approximate
nearby values are missing
Iteration 3:   log likelihood = -451624.75  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 4:   log likelihood = -451444.25  (not concave)
numerical derivatives are approximate
nearby values are missing
Iteration 5:   log likelihood = -451408.18  (not concave)
Iteration 6:   log likelihood = -451393.75  (not concave)
numerical derivatives are approximate
nearby values are missing
cannot compute an improvement -- discontinuous region encountered
r(430);

end of do-file

r(430);

. do "C:\Users\favero\AppData\Local\Temp\STD7174_000000.tmp"

. ml model lf reporting_delays ///
>         (detected: total_deaths = ) ///
>         (time: days_to_report =  i.state_id) ///
>         (alpha: population) ///
>         (lnsigma: ) if end_week < date("20200515","YMD")

. ml maximize

initial:       log likelihood =     -<inf>  (could not be evaluated)
feasible:      log likelihood =  -466722.5
rescale:       log likelihood =  -466722.5
rescale eq:    log likelihood = -454686.61
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 0:   log likelihood = -454686.61  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 1:   log likelihood = -452416.22  (not concave)
numerical derivatives are approximate
nearby values are missing
Iteration 2:   log likelihood = -451850.93  (not concave)
Iteration 3:   log likelihood = -451738.02  (not concave)
Iteration 4:   log likelihood = -451647.73  (not concave)
cannot compute an improvement -- discontinuous region encountered
r(430);

end of do-file

r(430);

. do "C:\Users\favero\AppData\Local\Temp\STD7174_000000.tmp"

. capture program drop reporting_delays

. program reporting_delays
  1.         args lnf detected time alpha 
  2.         quietly replace `lnf' = ///
>                 ln(normalden( $ML_y1,  `alpha' - `alpha'*exp(-(exp(`time') * $ML_y2 )), exp(`detect
> ed' )))
  3. end

. 
. ml model lf reporting_delays ///
>         (detected: total_deaths = ) ///
>         (time: days_to_report =  i.state_id) ///
>         (alpha: population) ///
>          if end_week < date("20200515","YMD")

. ml maximize

initial:       log likelihood =     -<inf>  (could not be evaluated)
feasible:      log likelihood = -63687.689
rescale:       log likelihood = -63687.689
rescale eq:    log likelihood = -63679.493
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 0:   log likelihood = -63679.493  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 1:   log likelihood = -53739.669  (not concave)
Iteration 2:   log likelihood =  -51619.98  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 3:   log likelihood = -48207.524  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 4:   log likelihood = -48048.206  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 5:   log likelihood = -48048.151  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 6:   log likelihood = -48048.103  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 7:   log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 8:   log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 9:   log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 10:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 11:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 12:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 13:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 14:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 15:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 16:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 17:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 18:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 19:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 20:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 21:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 22:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 23:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 24:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 25:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 26:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 27:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 28:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 29:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 30:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 31:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 32:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 33:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 34:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 35:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 36:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 37:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 38:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 39:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 40:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 41:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 42:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 43:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 44:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 45:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 46:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 47:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 48:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 49:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 50:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 51:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 52:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 53:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 54:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 55:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 56:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 57:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 58:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 59:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 60:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 61:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 62:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 63:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 64:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 65:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 66:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 67:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 68:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 69:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 70:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 71:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 72:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 73:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 74:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 75:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 76:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 77:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 78:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 79:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 80:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 81:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 82:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 83:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 84:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 85:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 86:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 87:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 88:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 89:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 90:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 91:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 92:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 93:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 94:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 95:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 96:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 97:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 98:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 99:  log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 100: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 101: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 102: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 103: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 104: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 105: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 106: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 107: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 108: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 109: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 110: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 111: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 112: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 113: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 114: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 115: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 116: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 117: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 118: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 119: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 120: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 121: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 122: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 123: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 124: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 125: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 126: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 127: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 128: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 129: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 130: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 131: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 132: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 133: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 134: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 135: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 136: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 137: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 138: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 139: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 140: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 141: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 142: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 143: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 144: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 145: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 146: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 147: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 148: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 149: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 150: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 151: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 152: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 153: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 154: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 155: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 156: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 157: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 158: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 159: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 160: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 161: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 162: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 163: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 164: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 165: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 166: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 167: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 168: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 169: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 170: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 171: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 172: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 173: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 174: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 175: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 176: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 177: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 178: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 179: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 180: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 181: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 182: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 183: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 184: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 185: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 186: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 187: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 188: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 189: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 190: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 191: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 192: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 193: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 194: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 195: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 196: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 197: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 198: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 199: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 200: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 201: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 202: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 203: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 204: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 205: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 206: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 207: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 208: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 209: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 210: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 211: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 212: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 213: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 214: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 215: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 216: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 217: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 218: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 219: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 220: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 221: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 222: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 223: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 224: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 225: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 226: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 227: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 228: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 229: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 230: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 231: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 232: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 233: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 234: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 235: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 236: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 237: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 238: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 239: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 240: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 241: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 242: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 243: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 244: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 245: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 246: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 247: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 248: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 249: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 250: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 251: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 252: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 253: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 254: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 255: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 256: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 257: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 258: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 259: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 260: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 261: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 262: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 263: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 264: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 265: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 266: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 267: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 268: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 269: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 270: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 271: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 272: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 273: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 274: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 275: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 276: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 277: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 278: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 279: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 280: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 281: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 282: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 283: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 284: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 285: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 286: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 287: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 288: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 289: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 290: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 291: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 292: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 293: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 294: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 295: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 296: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 297: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 298: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 299: log likelihood = -48048.015  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 300: log likelihood = -48048.015  (not concave)
convergence not achieved

                                                Number of obs     =      5,831
                                                Wald chi2(0)      =          .
Log likelihood = -48048.015                     Prob > chi2       =          .

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
detected     |
       _cons |   6.633394   .0197777   335.40   0.000      6.59463    6.672157
-------------+----------------------------------------------------------------
time         |
    state_id |
          2  |  -210.6473          .        .       .            .           .
          3  |   -779.057          .        .       .            .           .
          4  |  -435.0632          .        .       .            .           .
          5  |   67.86609   1.275342    53.21   0.000     65.36647    70.36572
          6  |  -1055.243          .        .       .            .           .
          7  |  -216.4604          .        .       .            .           .
          8  |  -213.0158          .        .       .            .           .
          9  |   66.38452   1.325674    50.08   0.000     63.78625    68.98279
         10  |   130.5016          .        .       .            .           .
         11  |  -221.1498          .        .       .            .           .
         12  |  -227.4131          .        .       .            .           .
         13  |   69.06599    1.63513    42.24   0.000      65.8612    72.27079
         14  |  -261.6417          .        .       .            .           .
         15  |  -362.8004          .        .       .            .           .
         16  |  -289.7131          .        .       .            .           .
         17  |   -1047.28          .        .       .            .           .
         18  |  -1017.642          .        .       .            .           .
         19  |  -226.8188          .        .       .            .           .
         20  |  -946.2677          .        .       .            .           .
         21  |   108.8931          .        .       .            .           .
         22  |   69.04661    1.69074    40.84   0.000     65.73282    72.36041
         23  |  -1045.465          .        .       .            .           .
         24  |  -527.7959          .        .       .            .           .
         25  |  -813.0508          .        .       .            .           .
         26  |  -217.8029          .        .       .            .           .
         27  |  -232.4226          .        .       .            .           .
         28  |  -288.8644          .        .       .            .           .
         29  |  -223.1141          .        .       .            .           .
         30  |   68.17553   1.626484    41.92   0.000     64.98768    71.36338
         31  |  -236.8828          .        .       .            .           .
         32  |   65.70522   1.298694    50.59   0.000     63.15982    68.25061
         33  |  -212.6364          .        .       .            .           .
         34  |   69.22491          .        .       .            .           .
         35  |  -10409.12          .        .       .            .           .
         36  |  -3511.191          .        .       .            .           .
         37  |   68.56714   1.578964    43.43   0.000     65.47243    71.66185
         38  |  -218.1497          .        .       .            .           .
         39  |  -996.7721          .        .       .            .           .
         40  |  -214.8584          .        .       .            .           .
         41  |   404.9821          .        .       .            .           .
         42  |   67.98117   1.345967    50.51   0.000     65.34312    70.61921
         43  |  -246.7311          .        .       .            .           .
         44  |  -212.2868          .        .       .            .           .
         45  |  -265.5632          .        .       .            .           .
         46  |  -966.4332          .        .       .            .           .
         47  |  -241.1489          .        .       .            .           .
         48  |  -964.1508          .        .       .            .           .
         49  |  -210.7941          .        .       .            .           .
             |
       _cons |  -51.02876   1.290566   -39.54   0.000    -53.55823    -48.4993
-------------+----------------------------------------------------------------
alpha        |
  population |   .0000852   2.90e-06    29.35   0.000     .0000795    .0000909
       _cons |   1509.851   46.96377    32.15   0.000     1417.803    1601.898
------------------------------------------------------------------------------
convergence not achieved
r(430);

end of do-file

r(430);

. do "C:\Users\favero\AppData\Local\Temp\STD7174_000000.tmp"

. ml model lf reporting_delays ///
>         (detected: total_deaths = ) ///
>         (time: days_to_report =  state_delay) ///
>         (alpha: population) ///
>          if end_week < date("20200515","YMD")

. ml maximize

initial:       log likelihood =     -<inf>  (could not be evaluated)
feasible:      log likelihood = -63687.689
rescale:       log likelihood = -63687.689
rescale eq:    log likelihood = -63679.493
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 0:   log likelihood = -63679.493  (not concave)
Iteration 1:   log likelihood = -53626.282  (not concave)
Iteration 2:   log likelihood = -47128.401  (not concave)
Iteration 3:   log likelihood = -46311.021  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 4:   log likelihood = -45875.691  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 5:   log likelihood = -45873.688  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 6:   log likelihood = -45873.528  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 7:   log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 8:   log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 9:   log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 10:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 11:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 12:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 13:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 14:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 15:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 16:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 17:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 18:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 19:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 20:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 21:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 22:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 23:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 24:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 25:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 26:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 27:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 28:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 29:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 30:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 31:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 32:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 33:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 34:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 35:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 36:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 37:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 38:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 39:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 40:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 41:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 42:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 43:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 44:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 45:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 46:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 47:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 48:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 49:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 50:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 51:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 52:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 53:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 54:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 55:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 56:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 57:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 58:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 59:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 60:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 61:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 62:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 63:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 64:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 65:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 66:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 67:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 68:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 69:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 70:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 71:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 72:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 73:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 74:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 75:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 76:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 77:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 78:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 79:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 80:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 81:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 82:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 83:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 84:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 85:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 86:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 87:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 88:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 89:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 90:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 91:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 92:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 93:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 94:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 95:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 96:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 97:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 98:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 99:  log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 100: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 101: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 102: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 103: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 104: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 105: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 106: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 107: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 108: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 109: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 110: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 111: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 112: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 113: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 114: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 115: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 116: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 117: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 118: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 119: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 120: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 121: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 122: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 123: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 124: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 125: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 126: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 127: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 128: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 129: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 130: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 131: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 132: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 133: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 134: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 135: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 136: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 137: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 138: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 139: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 140: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 141: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 142: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 143: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 144: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 145: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 146: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 147: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 148: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 149: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 150: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 151: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 152: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 153: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 154: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 155: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 156: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 157: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 158: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 159: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 160: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 161: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 162: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 163: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 164: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 165: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 166: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 167: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 168: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 169: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 170: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 171: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 172: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 173: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 174: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 175: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 176: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 177: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 178: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 179: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 180: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 181: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 182: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 183: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 184: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 185: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 186: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 187: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 188: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 189: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 190: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 191: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 192: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 193: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 194: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 195: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 196: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 197: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 198: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 199: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 200: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 201: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 202: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 203: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 204: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 205: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 206: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 207: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 208: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 209: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 210: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 211: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 212: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 213: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 214: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 215: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 216: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 217: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 218: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 219: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 220: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 221: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 222: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 223: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 224: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 225: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 226: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 227: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 228: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 229: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 230: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 231: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 232: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 233: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 234: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 235: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 236: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 237: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 238: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 239: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 240: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 241: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 242: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 243: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 244: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 245: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 246: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 247: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 248: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 249: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 250: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 251: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 252: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 253: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 254: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 255: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 256: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 257: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 258: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 259: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 260: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 261: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 262: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 263: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 264: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 265: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 266: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 267: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 268: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 269: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 270: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 271: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 272: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 273: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 274: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 275: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 276: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 277: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 278: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 279: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 280: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 281: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 282: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 283: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 284: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 285: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 286: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 287: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 288: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 289: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 290: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 291: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 292: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 293: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 294: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 295: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 296: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 297: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 298: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 299: log likelihood = -45873.518  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 300: log likelihood = -45873.518  (not concave)
convergence not achieved

                                                Number of obs     =      5,831
                                                Wald chi2(0)      =          .
Log likelihood = -45873.518                     Prob > chi2       =          .

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
detected     |
       _cons |   6.434828   .0109485   587.73   0.000      6.41337    6.456287
-------------+----------------------------------------------------------------
time         |
 state_delay |    29.6551   5.755526     5.15   0.000     18.37448    40.93573
       _cons |   97.77632          .        .       .            .           .
-------------+----------------------------------------------------------------
alpha        |
  population |   .0001745   1.13e-06   155.01   0.000     .0001723    .0001767
       _cons |    52.5157   10.93153     4.80   0.000     31.09029    73.94111
------------------------------------------------------------------------------
convergence not achieved
r(430);

end of do-file

r(430);

. do "C:\Users\favero\AppData\Local\Temp\STD7174_000000.tmp"

. capture program drop reporting_delays

. program reporting_delays
  1.         args lnf detected time missed_realdeaths lnsigma
  2.         quietly replace `lnf' = ///
>                 ln(normalden( $ML_y1,  ($ML_y3 + exp(`missed_realdeaths')) - ($ML_y3 + exp(`missed_
> realdeaths'))*exp(-(exp(`time') * $ML_y2 )), exp(`lnsigma'+`detected'*$ML_y2 )))
  3. end

. 
. ml model lf reporting_delays ///
>         (detected: total_deaths = ) ///
>         (time: days_to_report = state_delay) ///
>         (missed_realdeaths: min_realdeaths = population) ///
>         (lnsigma: population) if end_week < date("20200401","YMD")

. ml maximize

initial:       log likelihood =     -<inf>  (could not be evaluated)
feasible:      log likelihood = -150977.02
rescale:       log likelihood = -17243.603
rescale eq:    log likelihood = -15880.168
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 0:   log likelihood = -15880.168  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 1:   log likelihood = -15801.049  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 2:   log likelihood = -15706.173  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 3:   log likelihood = -15619.861  (not concave)
could not calculate numerical derivatives -- discontinuous region with missing values encountered
r(430);

end of do-file

r(430);

. tab state_delay

state_delay |      Freq.     Percent        Cum.
------------+-----------------------------------
  -.4983472 |        129        2.04        2.04
  -.4642131 |        129        2.04        4.08
  -.3792015 |        129        2.04        6.12
  -.3773314 |        129        2.04        8.16
   -.368547 |        129        2.04       10.20
  -.3503861 |        129        2.04       12.24
  -.3350586 |        129        2.04       14.29
  -.3238973 |        129        2.04       16.33
  -.2478634 |        129        2.04       18.37
  -.2421004 |        129        2.04       20.41
  -.2401903 |        129        2.04       22.45
  -.2387094 |        129        2.04       24.49
   -.237129 |        129        2.04       26.53
  -.2188302 |        129        2.04       28.57
  -.2188018 |        129        2.04       30.61
  -.2151785 |        129        2.04       32.65
  -.2124014 |        129        2.04       34.69
  -.2113268 |        129        2.04       36.73
  -.2026122 |        129        2.04       38.78
  -.1821507 |        129        2.04       40.82
  -.1585695 |        129        2.04       42.86
  -.1483256 |        129        2.04       44.90
  -.1481519 |        129        2.04       46.94
  -.1194655 |        129        2.04       48.98
  -.1168032 |        129        2.04       51.02
   -.115613 |        129        2.04       53.06
  -.0954314 |        129        2.04       55.10
  -.0871174 |        129        2.04       57.14
  -.0683881 |        129        2.04       59.18
  -.0673223 |        129        2.04       61.22
  -.0643423 |        129        2.04       63.27
  -.0613897 |        129        2.04       65.31
  -.0475989 |        129        2.04       67.35
  -.0396457 |        129        2.04       69.39
  -.0372288 |        129        2.04       71.43
  -.0309309 |        129        2.04       73.47
  -.0293399 |        129        2.04       75.51
  -.0267636 |        129        2.04       77.55
   -.013897 |        129        2.04       79.59
          0 |        129        2.04       81.63
   .0280022 |        129        2.04       83.67
   .0820775 |        129        2.04       85.71
   .0990392 |        129        2.04       87.76
   .1105673 |        129        2.04       89.80
   .1381347 |        129        2.04       91.84
   .1686232 |        129        2.04       93.88
    .272442 |        129        2.04       95.92
   .3054319 |        129        2.04       97.96
    .363459 |        129        2.04      100.00
------------+-----------------------------------
      Total |      6,321      100.00

. do "C:\Users\favero\AppData\Local\Temp\STD7174_000000.tmp"

. capture program drop reporting_delays

. program reporting_delays
  1.         args lnf detected time alpha 
  2.         quietly replace `lnf' = ///
>                 ln(normalden( $ML_y1,  `alpha' - `alpha'*exp(-(exp(`time') * $ML_y2 )), exp(`detect
> ed' )))
  3. end

. 
. ml model lf reporting_delays ///
>         (detected: total_deaths = ) ///
>         (time: days_to_report =  state_delay) ///
>         (alpha: i.state_id) ///
>          if end_week < date("20200515","YMD")

. ml maximize

initial:       log likelihood =     -<inf>  (could not be evaluated)
feasible:      log likelihood = -63687.689
rescale:       log likelihood = -63687.689
rescale eq:    log likelihood = -63679.493
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 0:   log likelihood = -63679.493  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 1:   log likelihood = -45183.028  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 2:   log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 3:   log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 4:   log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 5:   log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 6:   log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 7:   log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 8:   log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 9:   log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 10:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 11:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 12:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 13:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 14:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 15:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 16:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 17:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 18:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 19:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 20:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 21:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 22:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 23:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 24:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 25:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 26:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 27:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 28:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 29:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 30:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 31:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 32:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 33:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 34:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 35:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 36:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 37:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 38:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 39:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 40:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 41:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 42:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 43:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 44:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 45:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 46:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 47:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 48:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 49:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 50:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 51:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 52:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 53:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 54:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 55:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 56:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 57:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 58:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 59:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 60:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 61:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 62:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 63:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 64:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 65:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 66:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 67:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 68:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 69:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 70:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 71:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 72:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 73:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 74:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 75:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 76:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 77:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 78:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 79:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 80:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 81:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 82:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 83:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 84:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 85:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 86:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 87:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 88:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 89:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 90:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 91:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 92:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 93:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 94:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 95:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 96:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 97:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 98:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 99:  log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 100: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 101: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 102: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 103: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 104: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 105: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 106: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 107: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 108: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 109: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 110: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 111: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 112: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 113: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 114: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 115: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 116: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 117: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 118: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 119: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 120: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 121: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 122: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 123: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 124: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 125: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 126: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 127: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 128: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 129: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 130: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 131: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 132: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 133: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 134: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 135: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 136: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 137: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 138: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 139: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 140: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 141: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 142: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 143: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 144: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 145: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 146: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 147: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 148: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 149: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 150: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 151: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 152: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 153: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 154: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 155: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 156: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 157: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 158: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 159: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 160: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 161: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 162: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 163: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 164: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 165: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 166: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 167: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 168: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 169: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 170: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 171: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 172: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 173: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 174: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 175: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 176: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 177: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 178: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 179: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 180: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 181: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 182: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 183: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 184: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 185: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 186: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 187: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 188: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 189: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 190: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 191: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 192: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 193: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 194: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 195: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 196: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 197: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 198: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 199: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 200: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 201: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 202: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 203: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 204: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 205: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 206: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 207: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 208: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 209: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 210: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 211: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 212: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 213: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 214: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 215: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 216: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 217: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 218: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 219: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 220: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 221: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 222: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 223: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 224: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 225: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 226: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 227: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 228: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 229: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 230: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 231: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 232: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 233: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 234: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 235: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 236: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 237: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 238: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 239: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 240: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 241: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 242: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 243: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 244: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 245: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 246: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 247: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 248: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 249: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 250: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 251: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 252: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 253: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 254: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 255: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 256: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 257: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 258: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 259: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 260: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 261: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 262: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 263: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 264: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 265: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 266: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 267: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 268: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 269: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 270: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 271: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 272: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 273: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 274: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 275: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 276: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 277: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 278: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 279: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 280: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 281: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 282: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 283: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 284: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 285: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 286: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 287: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 288: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 289: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 290: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 291: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 292: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 293: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 294: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 295: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 296: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 297: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 298: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 299: log likelihood = -44582.557  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 300: log likelihood = -44582.557  (not concave)
convergence not achieved

                                                Number of obs     =      5,831
                                                Wald chi2(0)      =          .
Log likelihood = -44582.557                     Prob > chi2       =          .

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
detected     |
       _cons |   6.115663    .011827   517.09   0.000     6.092483    6.138844
-------------+----------------------------------------------------------------
time         |
 state_delay |   -59.5452   2.641033   -22.55   0.000    -64.72153   -54.36887
       _cons |   33.32537          .        .       .            .           .
-------------+----------------------------------------------------------------
alpha        |
    state_id |
          2  |  -1257.915   59.23299   -21.24   0.000     -1374.01   -1141.821
          3  |   63.17413   58.91502     1.07   0.284    -52.29718    178.6454
          4  |  -650.3087   59.03395   -11.02   0.000    -766.0131   -534.6043
          5  |   4589.482   58.74814    78.12   0.000     4474.337    4704.626
          6  |  -374.9514   58.97195    -6.36   0.000    -490.5343   -259.3685
          7  |  -1127.213   59.10357   -19.07   0.000    -1243.054   -1011.373
          8  |  -1176.688   59.10326   -19.91   0.000    -1292.529   -1060.848
          9  |   3294.909   58.71587    56.12   0.000     3179.828     3409.99
         10  |   448.6786   58.88262     7.62   0.000     333.2707    564.0864
         11  |  -1069.458   59.06286   -18.11   0.000    -1185.219   -953.6971
         12  |  -1010.992   59.06009   -17.12   0.000    -1126.747   -895.2361
         13  |   1221.505   58.80031    20.77   0.000     1106.258    1336.751
         14  |   148.1567   58.90669     2.52   0.012      32.7017    263.6117
         15  |  -686.6258   59.04577   -11.63   0.000    -802.3534   -570.8983
         16  |  -763.7801   59.05081   -12.93   0.000    -879.5175   -648.0426
         17  |  -373.9909   58.97598    -6.34   0.000    -489.5817   -258.4001
         18  |  -277.9874   58.94461    -4.72   0.000    -393.5167   -162.4581
         19  |  -1011.912   59.12881   -17.11   0.000    -1127.802   -896.0214
         20  |  -113.3079   58.95269    -1.92   0.055     -228.853    2.237267
         21  |   319.3135    58.8881     5.42   0.000      203.895    434.7321
         22  |   1037.369   58.82217    17.64   0.000     922.0797    1152.658
         23  |   -346.321   58.99187    -5.87   0.000    -461.9429   -230.6991
         24  |  -639.0591   59.07356   -10.82   0.000    -754.8412   -523.2771
         25  |   5.254484    58.9293     0.09   0.929    -110.2448    120.7538
         26  |  -1165.572   59.32653   -19.65   0.000     -1281.85   -1049.294
         27  |  -974.3112   59.08763   -16.49   0.000    -1090.121   -858.5016
         28  |  -752.1981   58.99035   -12.75   0.000    -867.8171   -636.5792
         29  |  -1057.175   59.13668   -17.88   0.000    -1173.081    -941.269
         30  |   1073.787   58.83733    18.25   0.000     958.4682    1189.106
         31  |   -950.359   59.11484   -16.08   0.000    -1066.222    -834.496
         32  |    4237.22   58.77433    72.09   0.000     4122.024    4352.416
         33  |   -1255.22   59.30669   -21.16   0.000    -1371.459   -1138.981
         34  |   1093.643   58.87159    18.58   0.000     978.2568    1209.029
         35  |  -573.0408    59.0399    -9.71   0.000    -688.7569   -457.3248
         36  |  -568.8314   58.99574    -9.64   0.000    -684.4609   -453.2018
         37  |   1304.507   58.80085    22.19   0.000     1189.259    1419.754
         38  |  -1110.583   59.13955   -18.78   0.000    -1226.494   -994.6715
         39  |  -220.6117   58.95072    -3.74   0.000     -336.153   -105.0704
         40  |  -1175.993   59.24081   -19.85   0.000    -1292.103   -1059.884
         41  |   246.2308   58.90081     4.18   0.000     130.7873    361.6742
         42  |    2886.07   58.76476    49.11   0.000     2770.893    3001.247
         43  |  -930.0465   59.15488   -15.72   0.000    -1045.988   -814.1051
         44  |  -1212.659   59.24815   -20.47   0.000    -1328.783   -1096.535
         45  |   220.7655   58.90268     3.75   0.000     105.3183    336.2126
         46  |  -106.5047   58.98591    -1.81   0.071     -222.115    9.105523
         47  |  -866.8721   58.95595   -14.70   0.000    -982.4236   -751.3206
         48  |  -143.6093   58.94454    -2.44   0.015    -259.1385   -28.08013
         49  |  -1230.555   59.16758   -20.80   0.000    -1346.521   -1114.588
             |
       _cons |   1208.835   41.74237    28.96   0.000     1127.022    1290.649
------------------------------------------------------------------------------
convergence not achieved
r(430);

end of do-file

r(430);

