-----------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\favero\Documents\GitHub\covid-underreporting\code\..\logs\pulldata.txt
  log type:  text
 opened on:  16 May 2020, 16:53:03

. 
. import delimited "https://covidtracking.com/api/v1/states/daily.csv", stringcols(1)
(27 vars, 4,049 obs)

. rename date olddate

. gen date = date(olddate, "YMD")

. format date %tdCCYYNNDD

. order date

. drop olddate

. save "..\data\covidtracking.dta", replace
file ..\data\covidtracking.dta saved

. 
. /*
> insheet using "https://data.cdc.gov/resource/xkkf-xrst.csv", clear
> gen date = date(substr(week_ending_date,1,10), "YMD")
> format date %tdCCYYNNDD
> order date
> keep date state 
> save "..\data\allcause.dta", replace
> */
. 
. insheet using "https://data.cdc.gov/resource/r8kw-7aab.csv", clear
(14 vars, 810 obs)

. gen date = date(substr(end_week,1,10), "YMD")

. format date %tdCCYYNNDD

. gen report_date = date(substr(data_as_of,1,10), "YMD")

. format report_date %tdCCYYNNDD

. order date report_date

. gen expected_deaths = total_deaths / percent_of_expected_deaths
(11 missing values generated)

. order expected_deaths, after(total_deaths)

. drop start_week group indicator percent_of_expected_deaths footnote

. replace state = "New York" if state == "New York City"
(15 real changes made)

. rename pneumonia_influenza_or_covid pneumon_influ_or_covid

. 
. foreach var of varlist covid_deaths-pneumon_influ_or_covid {
  2.         gen `var'_mis = (`var'==.)
  3. }

. collapse (sum) covid_deaths-pneumon_influ_or_covid_mis (first) report_date, by(state date)

. foreach var of varlist covid_deaths-pneumon_influ_or_covid {
  2.         replace `var' = . if `var'_mis > 0
  3. }
(136 real changes made, 136 to missing)
(6 real changes made, 6 to missing)
(11 real changes made, 11 to missing)
(69 real changes made, 69 to missing)
(168 real changes made, 168 to missing)
(414 real changes made, 414 to missing)
(54 real changes made, 54 to missing)

. drop *_mis

. 
. save "..\data\cdc_deaths.dta", replace
file ..\data\cdc_deaths.dta saved

. 
. insheet using "https://www2.census.gov/programs-surveys/popest/datasets/2010-2019/national/totals/n
> st-est2019-alldata.csv", clear
(151 vars, 57 obs)

. rename state fips

. rename name state

. rename popestimate2019 population

. keep if fips > 0 & fips < 60
(6 observations deleted)

. keep fips state population

. save "..\data\population.dta", replace
file ..\data\population.dta saved

. 
. log close
      name:  <unnamed>
       log:  C:\Users\favero\Documents\GitHub\covid-underreporting\code\..\logs\pulldata.txt
  log type:  text
 closed on:  16 May 2020, 16:53:06
-----------------------------------------------------------------------------------------------------
