-----------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\favero\Documents\GitHub\covid-underreporting\code\..\logs\pulldata.txt
  log type:  text
 opened on:  17 May 2020, 23:00:44

. 
. import delimited "https://covidtracking.com/api/v1/states/daily.csv", stringcols(1)
(27 vars, 4,105 obs)

. rename date olddate

. gen date = date(olddate, "YMD")

. format date %tdCCYYNNDD

. order date

. drop olddate

. save "..\data\covidtracking.dta", replace
file ..\data\covidtracking.dta saved

. 
. /*
> insheet using "https://data.cdc.gov/resource/xkkf-xrst.csv", clear
> gen date = date(substr(week_ending_date,1,10), "YMD")
> format date %tdCCYYNNDD
> order date
> keep date state 
> save "..\data\allcause.dta", replace
> */
. 
. insheet using "..\data\Weekly_Counts_of_Deaths_by_State_and_Select_Causes__2014-2018.csv", clear
(30 vars, 13,833 obs)

. gen date = date(weekendingdate, "MDY")

. format date %tdCCYYNNDD

. rename jurisdictionofoccurrence state

. replace state = "New York" if state == "New York City"
(261 real changes made)

. foreach var of varlist allcause-cerebrovasculardiseasesi60i69 {
  2.         replace `var' = 5 if `var' == .
  3. }
(0 real changes made)
(0 real changes made)
(6,147 real changes made)
(10 real changes made)
(3,546 real changes made)
(2,822 real changes made)
(5,006 real changes made)
(1,901 real changes made)
(6,147 real changes made)
(5,487 real changes made)
(6,886 real changes made)
(17 real changes made)
(2,144 real changes made)

. collapse (sum) allcause-cerebrovasculardiseasesi60i69 (first) mmwryear mmwrweek, by(state date)

. save "..\data\cdc_1418deaths.dta", replace
file ..\data\cdc_1418deaths.dta saved

. 
. insheet using "..\data\Weekly_Counts_of_Deaths_by_State_and_Select_Causes__2019-2020.csv", clear
(34 vars, 3,786 obs)

. gen date = date(weekendingdate, "MDY")

. format date %tdCCYYNNDD

. rename jurisdictionofoccurrence state

. replace state = "New York" if state == "New York City"
(72 real changes made)

. foreach var of varlist allcause-cerebrovasculardiseasesi60i69 {
  2.         replace `var' = 5 if `var' == .
  3. }
(24 real changes made)
(24 real changes made)
(1,686 real changes made)
(36 real changes made)
(898 real changes made)
(710 real changes made)
(1,358 real changes made)
(527 real changes made)
(1,552 real changes made)
(1,432 real changes made)
(1,532 real changes made)
(38 real changes made)
(589 real changes made)

. collapse (sum) allcause-cerebrovasculardiseasesi60i69 (first) mmwryear mmwrweek, by(state date)

. save "..\data\cdc_1920deaths.dta", replace
file ..\data\cdc_1920deaths.dta saved

. 
. insheet using "https://data.cdc.gov/resource/r8kw-7aab.csv", clear
(14 vars, 810 obs)

. gen date = date(substr(end_week,1,10), "YMD")

. format date %tdCCYYNNDD

. gen report_date = date(substr(data_as_of,1,10), "YMD")

. format report_date %tdCCYYNNDD

. order date report_date

. gen expected_deaths = total_deaths / percent_of_expected_deaths
(11 missing values generated)

. order expected_deaths, after(total_deaths)

. drop start_week group indicator percent_of_expected_deaths footnote

. replace state = "New York" if state == "New York City"
(15 real changes made)

. rename pneumonia_influenza_or_covid pneumon_influ_or_covid

. 
. foreach var of varlist covid_deaths-pneumon_influ_or_covid {
  2.         replace `var' = 5 if `var' == .
  3. }
(137 real changes made)
(6 real changes made)
(11 real changes made)
(69 real changes made)
(169 real changes made)
(416 real changes made)
(54 real changes made)

. collapse (sum) covid_deaths-pneumon_influ_or_covid (first) report_date, by(state date)

. 
. save "..\data\cdc_deaths.dta", replace
file ..\data\cdc_deaths.dta saved

. 
. insheet using "https://www2.census.gov/programs-surveys/popest/datasets/2010-2019/national/totals/n
> st-est2019-alldata.csv", clear
(151 vars, 57 obs)

. rename state fips

. rename name state

. rename popestimate2019 population

. keep if fips > 0 & fips < 60
(6 observations deleted)

. keep fips state population

. save "..\data\population.dta", replace
file ..\data\population.dta saved

. 
. log close
      name:  <unnamed>
       log:  C:\Users\favero\Documents\GitHub\covid-underreporting\code\..\logs\pulldata.txt
  log type:  text
 closed on:  17 May 2020, 23:00:56
-----------------------------------------------------------------------------------------------------
