-----------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\favero\Documents\GitHub\covid-underreporting\data\..\logs\pulldata.txt
  log type:  text
 opened on:  22 May 2020, 16:20:37

. 
. import delimited "https://covidtracking.com/api/v1/states/daily.csv", stringcols(1)
(27 vars, 4,329 obs)

. rename date olddate

. gen date = date(olddate, "YMD")

. format date %tdCCYYNNDD

. order date

. drop olddate

. save "..\data\covidtracking.dta", replace
file ..\data\covidtracking.dta saved

. 
. insheet using "..\data\source_files\State_Custom_Data.csv", clear
(10 vars, 19,968 obs)

. gen week_str = string(week,"%02.0f")

. gen yr = substr(season,3,2) if week > 39
(15,184 missing values generated)

. replace yr = substr(season,-2,2) if week <= 39
(15,184 real changes made)

. gen epi_week = "20"+yr+"w"+week_str

. epiweek2 epi_week, start(weekstartingdate) end(date) // requires userwritten package EPIWEEK

. format date %tdCCYYNNDD

. destring numinfluenzadeaths-percentcomplete, replace ignore("Insufficient Data" "," ">" "<" "%")
numinfluenzadeaths: characters I n s u f i c e t space D a removed; replaced as int
(25 missing values generated)
numpneumoniadeaths: characters I n s u f i c e t space D a , removed; replaced as int
(25 missing values generated)
totaldeaths: characters I n s u f i c e t space D a , removed; replaced as int
(25 missing values generated)
percentcomplete: characters space > < % removed; replaced as double

. drop percentpi week_str area agegroup yr weekstartingdate

. order date

. rename subarea state

. replace state = "New York" if state == "New York City"
(384 real changes made)

. collapse (sum) numinfluenzadeaths-percentcomplete (first) season epi_week, by(state date)

. save "..\data\cdc_historical_deaths.dta", replace
file ..\data\cdc_historical_deaths.dta saved

. 
. insheet using "https://data.cdc.gov/resource/r8kw-7aab.csv", clear
(14 vars, 864 obs)

. export delimited using "..\data\past_reports\unprocessed_files/$S_DATE cdc_deaths_raw", replace
(note: file ..\data\past_reports\unprocessed_files/22 May 2020 cdc_deaths_raw.csv not found)
file ..\data\past_reports\unprocessed_files/22 May 2020 cdc_deaths_raw.csv saved

. gen date = date(substr(end_week,1,10), "YMD")

. format date %tdCCYYNNDD

. gen report_date = date(substr(data_as_of,1,10), "YMD")

. format report_date %tdCCYYNNDD

. order date report_date

. gen expected_deaths = total_deaths / percent_of_expected_deaths
(8 missing values generated)

. order expected_deaths, after(total_deaths)

. drop start_week group indicator percent_of_expected_deaths footnote

. replace state = "New York" if state == "New York City"
(16 real changes made)

. rename pneumonia_influenza_or_covid pneumon_influ_or_covid

. 
. foreach var of varlist covid_deaths-pneumon_influ_or_covid {
  2.         replace `var' = 5 if `var' == .
  3. }
(139 real changes made)
(5 real changes made)
(8 real changes made)
(86 real changes made)
(181 real changes made)
(436 real changes made)
(67 real changes made)

. collapse (sum) covid_deaths-pneumon_influ_or_covid (first) report_date, by(state date)

. 
. save "..\data\cdc_deaths.dta", replace
file ..\data\cdc_deaths.dta saved

. save "..\data\past_reports/$S_DATE cdc_deaths.dta", replace
(note: file ..\data\past_reports/22 May 2020 cdc_deaths.dta not found)
file ..\data\past_reports/22 May 2020 cdc_deaths.dta saved

. 
. insheet using "https://www2.census.gov/programs-surveys/popest/datasets/2010-2019/national/totals/n
> st-est2019-alldata.csv", clear
(151 vars, 57 obs)

. rename state fips

. rename name state

. rename popestimate2019 population

. keep if fips > 0 & fips < 60
(6 observations deleted)

. keep fips state population

. save "..\data\population.dta", replace
file ..\data\population.dta saved

. 
. log close
      name:  <unnamed>
       log:  C:\Users\favero\Documents\GitHub\covid-underreporting\data\..\logs\pulldata.txt
  log type:  text
 closed on:  22 May 2020, 16:20:50
-----------------------------------------------------------------------------------------------------
