--------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\favero\Documents\GitHub\covid-underreporting\code\..\logs\pulldata.txt
  log type:  text
 opened on:   9 May 2020, 13:40:30

. 
. import delimited "https://covidtracking.com/api/v1/states/daily.csv", stringcols(1)
(27 vars, 3,601 obs)

. rename date olddate

. gen date = date(olddate, "YMD")

. format date %tdCCYYNNDD

. order date

. drop olddate

. save "..\data\covidtracking.dta", replace
file ..\data\covidtracking.dta saved

. 
. /*
> insheet using "https://data.cdc.gov/resource/xkkf-xrst.csv", clear
> gen date = date(substr(week_ending_date,1,10), "YMD")
> format date %tdCCYYNNDD
> order date
> keep date state 
> save "..\data\allcause.dta", replace
> */
. 
. insheet using "https://data.cdc.gov/resource/r8kw-7aab.csv", clear
(14 vars, 1,000 obs)

. gen date = date(substr(end_week,1,10), "YMD")

. format date %tdCCYYNNDD

. gen report_date = date(substr(data_as_of,1,10), "YMD")

. format report_date %tdCCYYNNDD

. order date report_date

. gen expected_deaths = total_deaths / percent_of_expected_deaths
(15 missing values generated)

. order expected_deaths, after(total_deaths)

. drop start_week group indicator percent_of_expected_deaths footnote

. replace state = "New York" if state == "New York City"
(14 real changes made)

. rename pneumonia_influenza_and_covid pneumon_influ_and_covid

. 
. foreach var of varlist covid_deaths-pneumon_influ_and_covid {
  2.         gen `var'_mis = (`var'==.)
  3. }

. collapse (sum) covid_deaths-pneumon_influ_and_covid_mis (first) report_date, by(state date)

. foreach var of varlist covid_deaths-pneumon_influ_and_covid {
  2.         replace `var' = . if `var'_mis > 0
  3. }
(129 real changes made, 129 to missing)
(2 real changes made, 2 to missing)
(10 real changes made, 10 to missing)
(76 real changes made, 76 to missing)
(157 real changes made, 157 to missing)
(395 real changes made, 395 to missing)
(60 real changes made, 60 to missing)

. drop *_mis

. 
. save "..\data\cdc_deaths.dta", replace
file ..\data\cdc_deaths.dta saved

. 
. insheet using "https://www2.census.gov/programs-surveys/popest/datasets/2010-2019/national/totals/nst-est2019-alldata.cs
> v", clear
(151 vars, 57 obs)

. rename state fips

. rename name state

. rename popestimate2019 population

. keep if fips > 0 & fips < 60
(6 observations deleted)

. keep fips state population

. save "..\data\population.dta", replace
(note: file ..\data\population.dta not found)
file ..\data\population.dta saved

. 
. log close
      name:  <unnamed>
       log:  C:\Users\favero\Documents\GitHub\covid-underreporting\code\..\logs\pulldata.txt
  log type:  text
 closed on:   9 May 2020, 13:40:32
--------------------------------------------------------------------------------------------------------------------------
