-----------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\favero\Documents\GitHub\covid-underreporting\code\..\logs\reporting_delays_prep
> aring_data_for_r.txt
  log type:  text
 opened on:  12 Jun 2020, 13:54:02

. 
. use "..\data\past_reports\16 May 2020 cdc_deaths.dta"

. append using "..\data\past_reports\23 May 2020 cdc_deaths.dta"

. append using "..\data\past_reports\30 May 2020 cdc_deaths.dta"

. append using "..\data\past_reports\ 6 Jun 2020 cdc_deaths.dta"

. append using "..\data\past_reports\12 Jun 2020 cdc_deaths.dta"

. 
. rename date end_week

. drop if state == "Connecticut" | state == "North Carolina" | state == "Puerto Rico"
(255 observations deleted)

. keep end_week state covid_deaths total_deaths pneumon_influ_or_covid report_date

. egen state_id = group(state)

. 
. egen state_end_week = group(state end_week)

. xtset state_end_week report_date, delta(7)
       panel variable:  state_end_week (unbalanced)
        time variable:  report_date, 20200515 to 20200612
                delta:  7 days

. gen days_to_report = report_date - end_week

. 
. foreach var of varlist covid_deaths total_deaths pneumon_influ_or_covid {
  2.         replace `var' = 5 if `var' == .
  3.         gen newreport_`var' = d.`var'
  4.         gen increase_`var' = f.`var'/`var'
  5.         egen avg_inc_`var' = mean(increase_`var'), by(state days_to_report)
  6.         replace avg_inc_`var' = 1 if avg_inc_`var' < 1
  7. }
(128 real changes made)
(950 missing values generated)
(2,374 missing values generated)
(1,436 missing values generated)
(40 real changes made)
(1 real change made)
(950 missing values generated)
(953 missing values generated)
(50 missing values generated)
(43 real changes made)
(49 real changes made)
(950 missing values generated)
(969 missing values generated)
(50 missing values generated)
(20 real changes made)

. 
. bys days_to_report: sum newreport_* increase_* avg_inc_*

-----------------------------------------------------------------------------------------------------
-> days_to_report = 6

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
new~d_deaths |          0
new~l_deaths |          0
newreport_~d |          0
increase_c~s |        167    3.895273    2.634305          1       14.2
increase_t~s |        197    2.645075    2.471059          1      18.05
-------------+---------------------------------------------------------
increase_p~d |        187    2.960712    1.462895          1        9.6
avg_inc_co~s |        225    3.757281    2.174237          1      12.15
avg_inc_to~s |        250    2.663632    1.610433    1.25903   9.575505
avg_inc_pn~d |        250    2.871265    1.184072          1       5.85

-----------------------------------------------------------------------------------------------------
-> days_to_report = 13

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
new~d_deaths |        200     130.905    478.1289          0       4453
new~l_deaths |        200      817.73    2853.076          0      22004
newreport_~d |        200     169.335    605.8593          0       5336
increase_c~s |        186    1.644255    1.279659          1       14.8
increase_t~s |        200    1.342376    .6932477   1.003676   9.555555
-------------+---------------------------------------------------------
increase_p~d |        198    1.464598    .5837383          1          5
avg_inc_co~s |        250    1.607713    .8393964          1   6.438889
avg_inc_to~s |        250    1.342376     .509889   1.019288   4.379589
avg_inc_pn~d |        250    1.459952    .4130993          1   2.798077

-----------------------------------------------------------------------------------------------------
-> days_to_report = 20

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
new~d_deaths |        200      86.265    315.1053          0       2895
new~l_deaths |        200     372.565     1300.88          1       9597
newreport_~d |        200      104.81    377.2554          0       3355
increase_c~s |        191    1.164118    .3542031          1        4.8
increase_t~s |        200    1.096044     .138138          1   2.013245
-------------+---------------------------------------------------------
increase_p~d |        200    1.126672    .1811804          1        2.2
avg_inc_co~s |        250    1.156732    .2022215          1   2.004023
avg_inc_to~s |        250    1.096044     .121509   1.003568   1.698191
avg_inc_pn~d |        250    1.126672    .1213484          1   1.525973

-----------------------------------------------------------------------------------------------------
-> days_to_report = 27

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
new~d_deaths |        200      40.965    162.0093          0       1697
new~l_deaths |        200      149.61    531.7007          0       4210
newreport_~d |        200      47.515    182.2276          0       1818
increase_c~s |        194    1.063036    .1782411          1        3.2
increase_t~s |        200     1.03708    .0453608   .9951691   1.279245
-------------+---------------------------------------------------------
increase_p~d |        200    1.044472    .0695489          1   1.730769
avg_inc_co~s |        250    1.061145    .0925062          1   1.574306
avg_inc_to~s |        250    1.037081     .037802          1   1.185881
avg_inc_pn~d |        250    1.044472    .0464713          1   1.222319

-----------------------------------------------------------------------------------------------------
-> days_to_report = 34

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
new~d_deaths |        200      26.465    118.2603          0       1234
new~l_deaths |        200      76.175    292.3682         -1       2165
newreport_~d |        200      28.135    120.9468          0       1178
increase_c~s |        196    1.025893    .0364865        .98   1.225806
increase_t~s |        200    1.017787    .0191599          1   1.089368
-------------+---------------------------------------------------------
increase_p~d |        200    1.026467    .0744961   .9967638          2
avg_inc_co~s |        250    1.025375    .0254929          1   1.108525
avg_inc_to~s |        250    1.017787    .0167049          1   1.064178
avg_inc_pn~d |        250    1.026467    .0381619          1       1.25

-----------------------------------------------------------------------------------------------------
-> days_to_report = 41

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
new~d_deaths |        200      17.955    79.06719         -2        744
new~l_deaths |        200      48.485    213.7597          0       1930
newreport_~d |        200       18.28    78.51922         -1        622
increase_c~s |        197    1.013651     .022735   .9444444    1.10687
increase_t~s |        200    1.009921    .0134921          1   1.117117
-------------+---------------------------------------------------------
increase_p~d |        200    1.011522    .0171969   .9545454   1.135135
avg_inc_co~s |        250    1.013879    .0155519          1   1.058767
avg_inc_to~s |        250    1.009921    .0117207          1   1.070936
avg_inc_pn~d |        250    1.011571    .0129353          1   1.061344

-----------------------------------------------------------------------------------------------------
-> days_to_report = 48

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
new~d_deaths |        200       9.995    41.77765         -1        322
new~l_deaths |        200       36.05    181.6383          0       1678
newreport_~d |        200      10.725    46.02085         -1        361
increase_c~s |        196    1.009592    .0222703   .9166667   1.129032
increase_t~s |        200    1.006591    .0086045   .9977778   1.055556
-------------+---------------------------------------------------------
increase_p~d |        200     1.00889    .0148604    .984127   1.076923
avg_inc_co~s |        250    1.010073    .0122232          1   1.047727
avg_inc_to~s |        250    1.006591     .007354          1   1.032482
avg_inc_pn~d |        250    1.008959     .008865          1   1.037655

-----------------------------------------------------------------------------------------------------
-> days_to_report = 55

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
new~d_deaths |        200        4.86    20.45194         -2        165
new~l_deaths |        200      28.165    154.1932         -2       1436
newreport_~d |        200       6.375    28.57705         -1        248
increase_c~s |        179    1.005393    .0157709          1      1.125
increase_t~s |        200    1.004339    .0056375    .998366   1.025974
-------------+---------------------------------------------------------
increase_p~d |        200    1.004682    .0093626          1     1.0625
avg_inc_co~s |        250    1.005003    .0088877          1   1.038014
avg_inc_to~s |        250    1.004339    .0048796          1   1.018945
avg_inc_pn~d |        250    1.004682    .0049458          1   1.020128

-----------------------------------------------------------------------------------------------------
-> days_to_report = 62

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
new~d_deaths |        200         1.8    8.982395          0        105
new~l_deaths |        200       18.29    99.26198         -1        868
newreport_~d |        200        3.17    15.34236          0        152
increase_c~s |        146     1.01097    .0832353          1          2
increase_t~s |        200    1.003759    .0059325    .991453     1.0375
-------------+---------------------------------------------------------
increase_p~d |        200    1.004642    .0112882          1        1.1
avg_inc_co~s |        245    1.008853    .0360611          1   1.252692
avg_inc_to~s |        250     1.00378    .0046463          1   1.020095
avg_inc_pn~d |        250    1.004642    .0067474          1   1.028783

-----------------------------------------------------------------------------------------------------
-> days_to_report = 69

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
new~d_deaths |        200        .705    3.954258          0         50
new~l_deaths |        200      13.295    72.32067         -4        707
newreport_~d |        200        1.77    8.459011          0         84
increase_c~s |        105    1.003687    .0125031   .9954751   1.076923
increase_t~s |        200    1.002757    .0045039    .997921   1.034483
-------------+---------------------------------------------------------
increase_p~d |        200    1.003049    .0094867   .9444444       1.05
avg_inc_co~s |        240    1.002898    .0063795          1   1.025641
avg_inc_to~s |        250    1.002757    .0032136          1   1.014619
avg_inc_pn~d |        250    1.003327    .0042345          1   1.017097

-----------------------------------------------------------------------------------------------------
-> days_to_report = 76

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
new~d_deaths |        200         .21    1.412756         -1         18
new~l_deaths |        200       9.695    52.61906         -1        559
newreport_~d |        200           1    4.951016         -1         50
increase_c~s |         61    .9631796    .1825559          0   1.019608
increase_t~s |        200    1.001944    .0039723   .9956141   1.042857
-------------+---------------------------------------------------------
increase_p~d |        200    1.003273    .0092106   .9895833   1.076923
avg_inc_co~s |        170    1.000121    .0006945          1   1.004098
avg_inc_to~s |        250    1.001945    .0021983          1   1.010714
avg_inc_pn~d |        250    1.003273    .0044248          1   1.019231

-----------------------------------------------------------------------------------------------------
-> days_to_report = 83

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
new~d_deaths |        200        -.04    .5476308         -5          2
new~l_deaths |        200        7.03    40.72631         -1        481
newreport_~d |        200        .875    4.282649         -1         41
increase_c~s |         29           1           0          1          1
increase_t~s |        200    1.001381     .002597   .9964789   1.015625
-------------+---------------------------------------------------------
increase_p~d |        200    1.001765    .0048763   .9979123   1.037037
avg_inc_co~s |         95           1           0          1          1
avg_inc_to~s |        250    1.001401    .0017872          1   1.006715
avg_inc_pn~d |        250    1.001765    .0026901          1   1.010227

-----------------------------------------------------------------------------------------------------
-> days_to_report = 90

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
new~d_deaths |        200           0           0          0          0
new~l_deaths |        200       5.465    33.21816         -1        409
newreport_~d |        200         .54    3.187349         -1         41
increase_c~s |         13           1           0          1          1
increase_t~s |        200    1.001356    .0030668   .9990403   1.025316
-------------+---------------------------------------------------------
increase_p~d |        199     1.00233    .0066429   .9907407   1.044444
avg_inc_co~s |         40           1           0          1          1
avg_inc_to~s |        250    1.001357    .0018559          1   1.007761
avg_inc_pn~d |        250    1.002335    .0032135          1   1.015575

-----------------------------------------------------------------------------------------------------
-> days_to_report = 97

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
new~d_deaths |        200           0           0          0          0
new~l_deaths |        200        3.22     15.7774         -1        174
newreport_~d |        200         .44    1.922206         -1         19
increase_c~s |          7    1.071429    .1889822          1        1.5
increase_t~s |        200    1.000647    .0013623   .9993364   1.010533
-------------+---------------------------------------------------------
increase_p~d |        199    1.001813    .0085308          1   1.076923
avg_inc_co~s |         20    1.041667    .0740436          1   1.166667
avg_inc_to~s |        250    1.000647    .0008418          1   1.004024
avg_inc_pn~d |        250    1.001804    .0041636          1   1.019231

-----------------------------------------------------------------------------------------------------
-> days_to_report = 104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
new~d_deaths |        200        .005    .0707107          0          1
new~l_deaths |        200       2.135    9.991794         -1        105
newreport_~d |        200          .3    1.341266          0         13
increase_c~s |          5    1.066667    .1490712          1   1.333333
increase_t~s |        200    1.000717    .0014151   .9995129   1.010582
-------------+---------------------------------------------------------
increase_p~d |        199    1.001345    .0048136          1    1.03125
avg_inc_co~s |         15    1.055556     .081325          1   1.166667
avg_inc_to~s |        250    1.000717     .000874          1   1.003168
avg_inc_pn~d |        250    1.001338     .002301          1   1.007813

-----------------------------------------------------------------------------------------------------
-> days_to_report = 111

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
new~d_deaths |        200         .03    .3602065          0          5
new~l_deaths |        200        1.72    6.602238         -1         54
newreport_~d |        200        .245    1.118584          0         11
increase_c~s |          2           1           0          1          1
increase_t~s |        150    1.000989    .0048454   .9992424   1.055363
-------------+---------------------------------------------------------
increase_p~d |        149    1.002458    .0120301          1   1.105263
avg_inc_co~s |          8           1           0          1          1
avg_inc_to~s |        200    1.000989    .0027204          1   1.018454
avg_inc_pn~d |        200    1.002441    .0067455          1   1.035088

-----------------------------------------------------------------------------------------------------
-> days_to_report = 118

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
new~d_deaths |        150           0           0          0          0
new~l_deaths |        150    1.573333     6.38512         -1         48
newreport_~d |        150    .2666667    1.072328          0          9
increase_c~s |          2           1           0          1          1
increase_t~s |        100     1.00127     .004374          1   1.033199
-------------+---------------------------------------------------------
increase_p~d |        100     1.00134    .0079331          1    1.07438
avg_inc_co~s |          6           1           0          1          1
avg_inc_to~s |        150     1.00127    .0034541          1   1.017364
avg_inc_pn~d |        150     1.00134    .0055243          1    1.03719

-----------------------------------------------------------------------------------------------------
-> days_to_report = 125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
new~d_deaths |        100           0           0          0          0
new~l_deaths |        100        2.35    11.33099          0         88
newreport_~d |        100          .3    1.527525          0         12
increase_c~s |          0
increase_t~s |         50    1.001099    .0051627          1   1.036514
-------------+---------------------------------------------------------
increase_p~d |         50    1.001034    .0046414          1   1.030769
avg_inc_co~s |          0
avg_inc_to~s |        100    1.001099    .0051366          1   1.036514
avg_inc_pn~d |        100    1.001034    .0046179          1   1.030769

-----------------------------------------------------------------------------------------------------
-> days_to_report = 132

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
new~d_deaths |         50         .12    .7182746          0          5
new~l_deaths |         50        3.78    16.89619          0         95
newreport_~d |         50         .28    1.143571          0          7
increase_c~s |          0
increase_t~s |          0
-------------+---------------------------------------------------------
increase_p~d |          0
avg_inc_co~s |          0
avg_inc_to~s |          0
avg_inc_pn~d |          0


. 
. keep if days_to_report > 6 & days_to_report < 118
(550 observations deleted)

. keep state state_id days_to_report avg_inc_*

. duplicates drop

Duplicates in terms of all variables

(2,950 observations deleted)

. xtset state_id days_to_report, delta(7)
       panel variable:  state_id (strongly balanced)
        time variable:  days_to_rep~t, 13 to 111
                delta:  7 units

. gen delay_multiplier = avg_inc_total_deaths

. forvalues i = 1/20 {
  2.         replace delay_multiplier = delay_multiplier * f`i'.delay_multiplier if f`i'.delay_multip
> lier != .
  3. }
(575 real changes made)
(555 real changes made)
(523 real changes made)
(477 real changes made)
(429 real changes made)
(381 real changes made)
(335 real changes made)
(289 real changes made)
(244 real changes made)
(199 real changes made)
(155 real changes made)
(111 real changes made)
(69 real changes made)
(30 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. 
. keep state days_to_report delay_multiplier

. 
. save "..\data\delay_multipliers.dta", replace
file ..\data\delay_multipliers.dta saved

. 
. log close
      name:  <unnamed>
       log:  C:\Users\favero\Documents\GitHub\covid-underreporting\code\..\logs\reporting_delays_prep
> aring_data_for_r.txt
  log type:  text
 closed on:  12 Jun 2020, 13:54:02
-----------------------------------------------------------------------------------------------------
