-----------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\favero\Documents\GitHub\covid-underreporting\code\..\logs\reporting_delays_prep
> aring_data_for_r.txt
  log type:  text
 opened on:  19 Jun 2020, 13:42:51

. 
. use "..\data\past_reports\16 May 2020 cdc_deaths.dta"

. append using "..\data\past_reports\23 May 2020 cdc_deaths.dta"

. append using "..\data\past_reports\30 May 2020 cdc_deaths.dta"

. append using "..\data\past_reports\ 6 Jun 2020 cdc_deaths.dta"

. append using "..\data\past_reports\13 Jun 2020 cdc_deaths.dta"

. append using "..\data\past_reports\19 Jun 2020 cdc_deaths.dta"

. 
. rename date end_week

. drop if state == "Connecticut" | state == "North Carolina" | state == "Puerto Rico"
(315 observations deleted)

. keep end_week state covid_deaths total_deaths pneumon_influ_or_covid report_date

. egen state_id = group(state)

. 
. egen state_end_week = group(state end_week)

. xtset state_end_week report_date, delta(7)
       panel variable:  state_end_week (unbalanced)
        time variable:  report_date, 20200515 to 20200619
                delta:  7 days

. gen days_to_report = report_date - end_week

. 
. foreach var of varlist covid_deaths total_deaths pneumon_influ_or_covid {
  2.         replace `var' = 5 if `var' == .
  3.         gen newreport_`var' = d.`var'
  4.         gen increase_`var' = f.`var'/`var'
  5.         egen avg_inc_`var' = mean(increase_`var'), by(state days_to_report)
  6.         replace avg_inc_`var' = 1 if avg_inc_`var' < 1
  7. }
(128 real changes made)
(1,000 missing values generated)
(2,786 missing values generated)
(1,570 missing values generated)
(48 real changes made)
(1 real change made)
(1,000 missing values generated)
(1,004 missing values generated)
(50 missing values generated)
(55 real changes made)
(49 real changes made)
(1,000 missing values generated)
(1,021 missing values generated)
(50 missing values generated)
(24 real changes made)

. 
. bys days_to_report: sum newreport_* increase_* avg_inc_*

-----------------------------------------------------------------------------------------------------
-> days_to_report = 6

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
new~d_deaths |          0
new~l_deaths |          0
newreport_~d |          0
increase_c~s |        208     3.85207    2.560307          1       14.2
increase_t~s |        246    2.543642    2.298147          1      18.05
-------------+---------------------------------------------------------
increase_p~d |        236    2.861724    1.370842          1        9.6
avg_inc_co~s |        270    3.727654    2.085046          1       11.6
avg_inc_to~s |        300     2.57929    1.453997   1.263925   7.976176
avg_inc_pn~d |        300    2.789001    1.030127          1       5.02

-----------------------------------------------------------------------------------------------------
-> days_to_report = 13

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
new~d_deaths |        250     122.712    450.6872          0       4453
new~l_deaths |        250      796.52    2780.867          0      22004
newreport_~d |        250     160.192     575.527          0       5336
increase_c~s |        233    1.630193    1.171947          1       14.8
increase_t~s |        250    1.323142    .6384363          1   9.555555
-------------+---------------------------------------------------------
increase_p~d |        248    1.453357    .5556299          1          5
avg_inc_co~s |        300    1.594218     .700291          1   5.395555
avg_inc_to~s |        300    1.323142    .4339923    1.01882   3.703671
avg_inc_pn~d |        300     1.44973     .374461          1   2.631279

-----------------------------------------------------------------------------------------------------
-> days_to_report = 20

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
new~d_deaths |        250      80.348    296.0258          0       2895
new~l_deaths |        250     359.108    1257.971          0       9597
newreport_~d |        250      98.252    356.3545          0       3355
increase_c~s |        237     1.15831    .3245051          1        4.8
increase_t~s |        250    1.096567    .1467096          1   2.142857
-------------+---------------------------------------------------------
increase_p~d |        250     1.12903    .1856023          1        2.2
avg_inc_co~s |        300    1.150078    .1761353          1   1.853219
avg_inc_to~s |        300    1.096567    .1309668   1.003003   1.787124
avg_inc_pn~d |        300     1.12903    .1289553          1   1.611867

-----------------------------------------------------------------------------------------------------
-> days_to_report = 27

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
new~d_deaths |        250      37.892    151.6574          0       1697
new~l_deaths |        250     145.176    517.0807          0       4210
newreport_~d |        250       44.44    171.8821          0       1818
increase_c~s |        241    1.059449      .16128          1        3.2
increase_t~s |        250    1.036976     .045934   .9951691    1.27933
-------------+---------------------------------------------------------
increase_p~d |        250    1.043257    .0646083          1   1.730769
avg_inc_co~s |        300    1.057309    .0768965          1   1.474259
avg_inc_to~s |        300    1.036976    .0392348    1.00084   1.204571
avg_inc_pn~d |        300    1.043257      .04204          1   1.193855

-----------------------------------------------------------------------------------------------------
-> days_to_report = 34

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
new~d_deaths |        250          24    109.5537          0       1234
new~l_deaths |        250      73.268    281.5843         -1       2165
newreport_~d |        250      25.804    112.8549          0       1178
increase_c~s |        243    1.025796    .0347041        .98   1.225806
increase_t~s |        250     1.01795    .0196673          1   1.092652
-------------+---------------------------------------------------------
increase_p~d |        250    1.025253    .0673997   .9967638          2
avg_inc_co~s |        300    1.025074    .0233245          1    1.10377
avg_inc_to~s |        300     1.01795    .0166239          1   1.066204
avg_inc_pn~d |        300    1.025253    .0318279          1        1.2

-----------------------------------------------------------------------------------------------------
-> days_to_report = 41

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
new~d_deaths |        250      16.412    73.65911         -2        744
new~l_deaths |        250      47.508    209.3079          0       1930
newreport_~d |        250      17.008    74.17763         -1        622
increase_c~s |        245    1.013844     .022232   .9444444    1.10687
increase_t~s |        250    1.009731    .0127648          1   1.117117
-------------+---------------------------------------------------------
increase_p~d |        250    1.011537    .0168211   .9545454   1.135135
avg_inc_co~s |        300    1.013903    .0150584          1   1.066686
avg_inc_to~s |        300    1.009731    .0105113          1   1.058672
avg_inc_pn~d |        300    1.011576    .0124264          1   1.052202

-----------------------------------------------------------------------------------------------------
-> days_to_report = 48

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
new~d_deaths |        250       9.236    39.14647         -1        322
new~l_deaths |        250       34.76     174.472          0       1678
newreport_~d |        250      10.108    43.69583         -1        361
increase_c~s |        245    1.010196    .0221688   .9166667   1.129032
increase_t~s |        250    1.006671    .0086689   .9977778   1.055556
-------------+---------------------------------------------------------
increase_p~d |        250    1.009071    .0153291    .984127   1.096386
avg_inc_co~s |        300    1.010325     .010805          1   1.038182
avg_inc_to~s |        300    1.006671     .007303          1   1.029494
avg_inc_pn~d |        300    1.009125    .0089735          1   1.049401

-----------------------------------------------------------------------------------------------------
-> days_to_report = 55

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
new~d_deaths |        250       4.804    20.02041         -2        165
new~l_deaths |        250      27.088    146.5466         -2       1436
newreport_~d |        250        6.26    27.81177         -1        248
increase_c~s |        229    1.006231    .0160033   .9967427      1.125
increase_t~s |        250    1.004367    .0055813    .998366   1.026316
-------------+---------------------------------------------------------
increase_p~d |        250    1.005089     .009288          1     1.0625
avg_inc_co~s |        300    1.005824    .0078852          1   1.032402
avg_inc_to~s |        300    1.004367    .0047709          1    1.02042
avg_inc_pn~d |        300    1.005089     .004793          1   1.021658

-----------------------------------------------------------------------------------------------------
-> days_to_report = 62

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
new~d_deaths |        250       2.204    10.35758         -1        105
new~l_deaths |        250      17.932    95.53775         -1        868
newreport_~d |        250         3.5    16.07119          0        152
increase_c~s |        195    1.009148    .0721506          1          2
increase_t~s |        250    1.003599    .0057838    .991453     1.0375
-------------+---------------------------------------------------------
increase_p~d |        250    1.005095    .0133436          1        1.1
avg_inc_co~s |        300    1.007759    .0286423          1   1.202665
avg_inc_to~s |        300    1.003599    .0044459          1   1.020454
avg_inc_pn~d |        300    1.005095    .0066687          1   1.028958

-----------------------------------------------------------------------------------------------------
-> days_to_report = 69

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
new~d_deaths |        250       1.024    5.339049          0         60
new~l_deaths |        250       12.96    69.34512         -4        707
newreport_~d |        250       2.028    9.378863          0         86
increase_c~s |        154    1.003122    .0110714   .9954751   1.076923
increase_t~s |        250    1.002556    .0041749    .997921   1.034483
-------------+---------------------------------------------------------
increase_p~d |        250    1.002775    .0087373   .9444444       1.05
avg_inc_co~s |        294    1.002778    .0055795          1    1.02381
avg_inc_to~s |        300    1.002556    .0027667          1   1.011695
avg_inc_pn~d |        300    1.002997    .0035451          1   1.015373

-----------------------------------------------------------------------------------------------------
-> days_to_report = 76

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
new~d_deaths |        250        .376    2.260767         -1         28
new~l_deaths |        250       9.528     50.5163         -1        559
newreport_~d |        250       1.112    5.290312         -1         50
increase_c~s |        109    .9793398    .1374719          0       1.02
increase_t~s |        250     1.00188    .0037314   .9956141   1.042857
-------------+---------------------------------------------------------
increase_p~d |        250    1.002966    .0085113   .9864865   1.076923
avg_inc_co~s |        288    1.000457    .0016522          1       1.01
avg_inc_to~s |        300    1.001881    .0021608          1   1.010633
avg_inc_pn~d |        300    1.002966    .0035861          1   1.015385

-----------------------------------------------------------------------------------------------------
-> days_to_report = 83

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
new~d_deaths |        250        .008    .6077941         -5          5
new~l_deaths |        250       6.488    37.27163         -1        481
newreport_~d |        250        .852    4.032759         -1         41
increase_c~s |         62    1.000414    .0030289          1    1.02381
increase_t~s |        250    1.001291     .002451   .9964789   1.015625
-------------+---------------------------------------------------------
increase_p~d |        250    1.001675    .0047692   .9873418   1.037037
avg_inc_co~s |        204    1.000186    .0010082          1   1.005952
avg_inc_to~s |        300     1.00131     .001612          1   1.006673
avg_inc_pn~d |        300    1.001675    .0023027          1   1.008182

-----------------------------------------------------------------------------------------------------
-> days_to_report = 90

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
new~d_deaths |        250        .008    .0892629          0          1
new~l_deaths |        250       4.996    30.16854         -1        409
newreport_~d |        250         .52    2.941464         -1         41
increase_c~s |         29           1           0          1          1
increase_t~s |        250    1.001266      .00287   .9986523   1.025316
-------------+---------------------------------------------------------
increase_p~d |        249    1.002108    .0066198   .9907407   1.045455
avg_inc_co~s |        114           1           0          1          1
avg_inc_to~s |        300    1.001267    .0017327          1   1.007261
avg_inc_pn~d |        300    1.002113    .0031248          1   1.014496

-----------------------------------------------------------------------------------------------------
-> days_to_report = 97

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
new~d_deaths |        250           0           0          0          0
new~l_deaths |        250       3.008     14.5707         -1        174
newreport_~d |        250        .388    1.753212         -1         19
increase_c~s |         15    1.033333    .1290994          1        1.5
increase_t~s |        250    1.000631    .0013453    .997921   1.010533
-------------+---------------------------------------------------------
increase_p~d |        249     1.00176    .0080025          1   1.076923
avg_inc_co~s |         48    1.015625    .0417773          1      1.125
avg_inc_to~s |        300    1.000642    .0008091          1   1.003451
avg_inc_pn~d |        300    1.001753    .0033784          1   1.015385

-----------------------------------------------------------------------------------------------------
-> days_to_report = 104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
new~d_deaths |        250        .004    .0632456          0          1
new~l_deaths |        250       2.056    9.372526         -2        105
newreport_~d |        250        .296     1.28647          0         13
increase_c~s |          7    1.047619    .1259882          1   1.333333
increase_t~s |        250    1.000808    .0017225   .9995129   1.012422
-------------+---------------------------------------------------------
increase_p~d |        249    1.001433    .0050281          1    1.03125
avg_inc_co~s |         24    1.027778    .0491473          1   1.111111
avg_inc_to~s |        300    1.000808    .0008601          1   1.002863
avg_inc_pn~d |        300    1.001427    .0021714          1    1.00759

-----------------------------------------------------------------------------------------------------
-> days_to_report = 111

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
new~d_deaths |        250        .024    .3222411          0          5
new~l_deaths |        250       1.696    6.442484         -1         54
newreport_~d |        250        .244    1.079409          0         11
increase_c~s |          6           1           0          1          1
increase_t~s |        200    1.000907    .0042322   .9992424   1.055363
-------------+---------------------------------------------------------
increase_p~d |        199    1.002066    .0105324          1   1.105263
avg_inc_co~s |         20           1           0          1          1
avg_inc_to~s |        250    1.000907    .0020374          1   1.013841
avg_inc_pn~d |        250    1.002055    .0050982          1   1.026316

-----------------------------------------------------------------------------------------------------
-> days_to_report = 118

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
new~d_deaths |        200           0           0          0          0
new~l_deaths |        200         1.5    5.997487         -1         48
newreport_~d |        200        .245    .9999874          0          9
increase_c~s |          2           1           0          1          1
increase_t~s |        150    1.001156    .0039452          1   1.033199
-------------+---------------------------------------------------------
increase_p~d |        149    1.001124    .0067731          1    1.07438
avg_inc_co~s |          8           1           0          1          1
avg_inc_to~s |        200    1.001156    .0029753          1   1.018105
avg_inc_pn~d |        200    1.001117    .0046827          1   1.032369

-----------------------------------------------------------------------------------------------------
-> days_to_report = 125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
new~d_deaths |        150           0           0          0          0
new~l_deaths |        150    2.353333    10.80215          0         88
newreport_~d |        150    .2666667    1.334451          0         12
increase_c~s |          2           1           0          1          1
increase_t~s |        100    1.001331    .0062824          1   1.051373
-------------+---------------------------------------------------------
increase_p~d |        100    1.001386    .0062378          1   1.047619
avg_inc_co~s |          6           1           0          1          1
avg_inc_to~s |        150    1.001331     .006154          1   1.043944
avg_inc_pn~d |        150    1.001386    .0057669          1   1.039194

-----------------------------------------------------------------------------------------------------
-> days_to_report = 132

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
new~d_deaths |        100         .06    .5089105          0          5
new~l_deaths |        100        4.37    19.69703          0        124
newreport_~d |        100         .34     1.44404          0         11
increase_c~s |          2           1           0          1          1
increase_t~s |         50    1.001672    .0089979   .9992082    1.06341
-------------+---------------------------------------------------------
increase_p~d |         50    1.002975     .013431          1   1.089552
avg_inc_co~s |          4           1           0          1          1
avg_inc_to~s |        100    1.001688    .0089486          1    1.06341
avg_inc_pn~d |        100    1.002975     .013363          1   1.089552

-----------------------------------------------------------------------------------------------------
-> days_to_report = 139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
new~d_deaths |         50           0           0          0          0
new~l_deaths |         50        5.98    28.20225         -1        150
newreport_~d |         50          .6    2.687841          0         15
increase_c~s |          0
increase_t~s |          0
-------------+---------------------------------------------------------
increase_p~d |          0
avg_inc_co~s |          0
avg_inc_to~s |          0
avg_inc_pn~d |          0


. 
. keep if days_to_report > 6 & days_to_report < 118
(800 observations deleted)

. keep state state_id days_to_report avg_inc_*

. duplicates drop

Duplicates in terms of all variables

(3,700 observations deleted)

. xtset state_id days_to_report, delta(7)
       panel variable:  state_id (strongly balanced)
        time variable:  days_to_rep~t, 13 to 111
                delta:  7 units

. gen delay_multiplier = avg_inc_total_deaths

. forvalues i = 1/20 {
  2.         replace delay_multiplier = delay_multiplier * f`i'.delay_multiplier if f`i'.delay_multip
> lier != .
  3. }
(596 real changes made)
(572 real changes made)
(534 real changes made)
(486 real changes made)
(437 real changes made)
(389 real changes made)
(342 real changes made)
(296 real changes made)
(251 real changes made)
(206 real changes made)
(162 real changes made)
(118 real changes made)
(76 real changes made)
(35 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. 
. keep state days_to_report delay_multiplier

. 
. save "..\data\delay_multipliers.dta", replace
file ..\data\delay_multipliers.dta saved

. 
. log close
      name:  <unnamed>
       log:  C:\Users\favero\Documents\GitHub\covid-underreporting\code\..\logs\reporting_delays_prep
> aring_data_for_r.txt
  log type:  text
 closed on:  19 Jun 2020, 13:42:52
-----------------------------------------------------------------------------------------------------
