-----------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\favero\Documents\GitHub\covid-underreporting\code\..\logs\simple_indicator_of_c
> ovid_severity.txt
  log type:  text
 opened on:  19 Jun 2020, 14:15:11

. 
. use "..\data\weeklydata.dta"

. 
. gen l_new_pos_pc = l.new_pos_pc
(19,194 missing values generated)

. gen l_p_pos = l.p_pos 
(19,238 missing values generated)

. 
. preserve

. keep if days_to_report > 14 & days_to_report != . & l_p_pos != . & fips != . & fips != 72
(19,388 observations deleted)

. 
. set scheme s2mono

. format end_week %tdnn/dd

. 
. la var adj_excess_respir_deaths_pc "No. of estimated excess respiratory deaths"

. la var adj_covid_deaths_pc "Deaths per 100,000 population"

. 
. *** State Analyses ***
. 
. // covid deaths
. 
. reg adj_covid_deaths_pc c.l_new_pos_pc if l_p_pos != ., cluster(fips) nocons

Linear regression                               Number of obs     =        503
                                                F(1, 48)          =     167.53
                                                Prob > F          =     0.0000
                                                R-squared         =     0.8668
                                                Root MSE          =      1.719

                                  (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
adj_covid_~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
l_new_pos_pc |   .0645726   .0049889    12.94   0.000     .0545418    .0746034
------------------------------------------------------------------------------

. margins, dydx(l_new_pos_pc)

Average marginal effects                        Number of obs     =        503
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : l_new_pos_pc

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
l_new_pos_pc |   .0645726   .0049889    12.94   0.000     .0545418    .0746034
------------------------------------------------------------------------------

. capture drop naive_case_count_pc

. predict naive_case_count_pc
(option xb assumed; fitted values)

. la var naive_case_count_pc "Prediction from naÃ¯ve case count (new cases)"

. 
. reg adj_covid_deaths_pc c.l_new_pos_pc c.l_new_pos_pc#c.l_p_pos, cluster(fips) nocons

Linear regression                               Number of obs     =        503
                                                F(2, 48)          =     226.95
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9049
                                                Root MSE          =     1.4542

                                              (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------------------
                         |               Robust
     adj_covid_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
            l_new_pos_pc |   .0416822   .0046757     8.91   0.000     .0322811    .0510833
                         |
c.l_new_pos_pc#c.l_p_pos |   .0008932   .0001658     5.39   0.000     .0005599    .0012265
------------------------------------------------------------------------------------------

. tab end_week if e(sample)==1

   end_week |      Freq.     Percent        Cum.
------------+-----------------------------------
       3/21 |         30        5.96        5.96
       3/28 |         37        7.36       13.32
        4/4 |         45        8.95       22.27
       4/11 |         49        9.74       32.01
       4/18 |         49        9.74       41.75
       4/25 |         49        9.74       51.49
        5/2 |         48        9.54       61.03
        5/9 |         49        9.74       70.78
       5/16 |         49        9.74       80.52
       5/23 |         49        9.74       90.26
       5/30 |         49        9.74      100.00
------------+-----------------------------------
      Total |        503      100.00

. margins, dydx(l_new_pos_pc) at(l_p_pos=(5 15 25 35 45))

Average marginal effects                        Number of obs     =        503
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : l_new_pos_pc

1._at        : l_p_pos         =           5

2._at        : l_p_pos         =          15

3._at        : l_p_pos         =          25

4._at        : l_p_pos         =          35

5._at        : l_p_pos         =          45

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
l_new_pos_pc |
         _at |
          1  |   .0461481   .0040692    11.34   0.000     .0379663    .0543298
          2  |   .0550798   .0031738    17.35   0.000     .0486983    .0614612
          3  |   .0640115   .0030139    21.24   0.000     .0579516    .0700714
          4  |   .0729432   .0036864    19.79   0.000     .0655312    .0803552
          5  |   .0818749   .0048571    16.86   0.000     .0721091    .0916408
------------------------------------------------------------------------------

. capture drop estimated_death_count_pc

. predict estimated_death_count_pc
(option xb assumed; fitted values)

. la var estimated_death_count_pc "Prediction from detection-adjusted cases (new cases X percent posi
> tive)"

. 
. twoway (line adj_covid_deaths_pc end_week) (line naive_case_count_pc end_week) (line estimated_deat
> h_count_pc end_week) if state=="New York", tlabel(21mar2020(7)16may2020)

. twoway (line adj_covid_deaths_pc end_week) (line naive_case_count_pc end_week) (line estimated_deat
> h_count_pc end_week) if state=="California", tlabel(21mar2020(7)16may2020)

. 
. list end_week adj_covid_deaths_pc naive_case_count_pc estimated_death_count_pc new_tests_pc p_pos n
> ew_pos_pc if state=="New York"

     +----------------------------------------------------------------------------+
     | end_week   adj_co~c   naive_~c   estima~c   new_te~c      p_pos   new_po~c |
     |----------------------------------------------------------------------------|
330. |     3/21   .8071053    .148031   .1248157   215.6051   23.33507   50.31161 |
331. |     3/28   6.098918   3.248752   3.145705   565.4274   37.97569    214.725 |
332. |      4/4   20.53169   13.86535   16.23343   653.3908   48.07537   314.1201 |
333. |     4/11   33.79381   20.28355   26.58139   805.2263   42.42147   341.5888 |
334. |     4/18   29.01367   22.05728   27.18086   795.9796   36.17697   287.9613 |
     |----------------------------------------------------------------------------|
335. |     4/25   19.87317   18.59441   21.30754   926.3845   25.08396   232.3739 |
336. |      5/2   12.42072   15.00499   14.89203   928.7742   16.98815   157.7816 |
337. |      5/9   10.31863   10.18837   8.970756   996.2896   10.34685   103.0846 |
338. |     5/16   7.233956   6.656439   5.249449   1151.093   6.717078   77.31982 |
339. |     5/23    5.09799   4.992743   3.686741   1398.736   4.278126    59.8397 |
     |----------------------------------------------------------------------------|
340. |     5/30   3.856711   3.864006   2.722904   1807.984    2.75501   49.81013 |
     +----------------------------------------------------------------------------+

. list end_week adj_covid_deaths_pc naive_case_count_pc estimated_death_count_pc new_tests_pc p_pos n
> ew_pos_pc if state=="California"

     +----------------------------------------------------------------------------+
     | end_week   adj_co~c   naive_~c   estima~c   new_te~c      p_pos   new_po~c |
     |----------------------------------------------------------------------------|
 43. |     3/21   .1192129   .0298728   .0311538   28.71802   9.040493   2.596251 |
 44. |     3/28    .344263   .1676467   .1291814   32.01453   26.56349   8.504174 |
 45. |      4/4   .7922329   .5491368   .5562407   223.7478   8.341619   18.66418 |
 46. |     4/11   1.036266   1.205195   .9170218   150.4637   14.43069   21.71295 |
 47. |     4/18   1.450599   1.402062   1.184903   218.5376   9.656784    21.1037 |
     |----------------------------------------------------------------------------|
 48. |     4/25   1.316146   1.362721   1.061672   622.8195   4.941369   30.77581 |
 49. |      5/2   1.446423   1.987274   1.418632   456.9806    6.11834   27.95962 |
 50. |      5/9   1.516497   1.805426    1.31821   570.7377   5.476442   31.25613 |
 51. |     5/16   1.407112    2.01829   1.455711   673.8522   4.588904   30.92243 |
 52. |     5/23   1.375939   1.996742   1.415656   849.8612   4.116247   34.98239 |
     |----------------------------------------------------------------------------|
 53. |     5/30   1.292436   2.258904   1.586757   943.6726   4.352392   41.07233 |
     +----------------------------------------------------------------------------+

. 
. // excess respiratory deaths
. 
. reg adj_excess_respir_deaths_pc c.l_new_pos_pc if l_p_pos != ., cluster(fips) nocons

Linear regression                               Number of obs     =        503
                                                F(1, 48)          =     142.84
                                                Prob > F          =     0.0000
                                                R-squared         =     0.8473
                                                Root MSE          =     1.9139

                                  (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
a~respir_d~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
l_new_pos_pc |   .0664002   .0055557    11.95   0.000     .0552297    .0775707
------------------------------------------------------------------------------

. margins, dydx(l_new_pos_pc)

Average marginal effects                        Number of obs     =        503
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : l_new_pos_pc

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
l_new_pos_pc |   .0664002   .0055557    11.95   0.000     .0552297    .0775707
------------------------------------------------------------------------------

. 
. reg adj_excess_respir_deaths_pc c.l_new_pos_pc c.l_new_pos_pc#c.l_p_pos, cluster(fips) nocons

Linear regression                               Number of obs     =        503
                                                F(2, 48)          =     213.31
                                                Prob > F          =     0.0000
                                                R-squared         =     0.8925
                                                Root MSE          =     1.6077

                                              (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------------------
                         |               Robust
adj_excess_respir_deat~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
            l_new_pos_pc |    .040477   .0050852     7.96   0.000     .0302524    .0507015
                         |
c.l_new_pos_pc#c.l_p_pos |   .0010115   .0001745     5.80   0.000     .0006606    .0013624
------------------------------------------------------------------------------------------

. margins, dydx(l_new_pos_pc) at(l_p_pos=(5 15 25 35 45))

Average marginal effects                        Number of obs     =        503
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : l_new_pos_pc

1._at        : l_p_pos         =           5

2._at        : l_p_pos         =          15

3._at        : l_p_pos         =          25

4._at        : l_p_pos         =          35

5._at        : l_p_pos         =          45

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
l_new_pos_pc |
         _at |
          1  |   .0455345   .0044408    10.25   0.000     .0366056    .0544634
          2  |   .0556496   .0034658    16.06   0.000     .0486812    .0626181
          3  |   .0657647   .0032238    20.40   0.000     .0592829    .0722466
          4  |   .0758798   .0038555    19.68   0.000     .0681279    .0836317
          5  |   .0859949   .0050425    17.05   0.000     .0758564    .0961335
------------------------------------------------------------------------------

. tab end_week if e(sample)==1

   end_week |      Freq.     Percent        Cum.
------------+-----------------------------------
       3/21 |         30        5.96        5.96
       3/28 |         37        7.36       13.32
        4/4 |         45        8.95       22.27
       4/11 |         49        9.74       32.01
       4/18 |         49        9.74       41.75
       4/25 |         49        9.74       51.49
        5/2 |         48        9.54       61.03
        5/9 |         49        9.74       70.78
       5/16 |         49        9.74       80.52
       5/23 |         49        9.74       90.26
       5/30 |         49        9.74      100.00
------------+-----------------------------------
      Total |        503      100.00

. 
. // excess all-cause deaths
. 
. reg adj_excess_deaths_pc c.l_new_pos_pc if l_p_pos != ., cluster(fips) nocons

Linear regression                               Number of obs     =        503
                                                F(1, 48)          =     217.88
                                                Prob > F          =     0.0000
                                                R-squared         =     0.7660
                                                Root MSE          =     3.4964

                                  (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
adj_excess.. |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
l_new_pos_pc |    .093165   .0063117    14.76   0.000     .0804746    .1058555
------------------------------------------------------------------------------

. margins, dydx(l_new_pos_pc)

Average marginal effects                        Number of obs     =        503
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : l_new_pos_pc

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
l_new_pos_pc |    .093165   .0063117    14.76   0.000     .0804746    .1058555
------------------------------------------------------------------------------

. 
. reg adj_excess_deaths_pc c.l_new_pos_pc c.l_new_pos_pc#c.l_p_pos, cluster(fips) nocons

Linear regression                               Number of obs     =        503
                                                F(2, 48)          =     228.09
                                                Prob > F          =     0.0000
                                                R-squared         =     0.7839
                                                Root MSE          =     3.3632

                                              (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------------------
                         |               Robust
    adj_excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
            l_new_pos_pc |    .069063   .0089161     7.75   0.000     .0511359      .08699
                         |
c.l_new_pos_pc#c.l_p_pos |   .0009404   .0003053     3.08   0.003     .0003267    .0015542
------------------------------------------------------------------------------------------

. margins, dydx(l_new_pos_pc) at(l_p_pos=(5 15 25 35 45))

Average marginal effects                        Number of obs     =        503
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : l_new_pos_pc

1._at        : l_p_pos         =           5

2._at        : l_p_pos         =          15

3._at        : l_p_pos         =          25

4._at        : l_p_pos         =          35

5._at        : l_p_pos         =          45

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
l_new_pos_pc |
         _at |
          1  |   .0737652   .0076257     9.67   0.000     .0584327    .0890977
          2  |   .0831697   .0054257    15.33   0.000     .0722607    .0940788
          3  |   .0925742      .0044    21.04   0.000     .0837273    .1014211
          4  |   .1019787   .0052838    19.30   0.000     .0913549    .1126025
          5  |   .1113832   .0074238    15.00   0.000     .0964566    .1263098
------------------------------------------------------------------------------

. tab end_week if e(sample)==1

   end_week |      Freq.     Percent        Cum.
------------+-----------------------------------
       3/21 |         30        5.96        5.96
       3/28 |         37        7.36       13.32
        4/4 |         45        8.95       22.27
       4/11 |         49        9.74       32.01
       4/18 |         49        9.74       41.75
       4/25 |         49        9.74       51.49
        5/2 |         48        9.54       61.03
        5/9 |         49        9.74       70.78
       5/16 |         49        9.74       80.52
       5/23 |         49        9.74       90.26
       5/30 |         49        9.74      100.00
------------+-----------------------------------
      Total |        503      100.00

. 
. // covid hospitalizations
. restore

. preserve

. keep if dayscollapsed==7 & fips != . & fips != 72
(19,189 observations deleted)

. gen hospitalizedcurrently_pc = hospitalizedcurrently * 100000 / population
(328 missing values generated)

. 
. reg hospitalizedcurrently_pc c.l_new_pos_pc if l_p_pos != ., cluster(fips) nocons

Linear regression                               Number of obs     =        390
                                                F(1, 44)          =     275.15
                                                Prob > F          =     0.0000
                                                R-squared         =     0.8945
                                                Root MSE          =      6.788

                                  (Std. Err. adjusted for 45 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
hospitaliz~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
l_new_pos_pc |   .2509257   .0151273    16.59   0.000     .2204386    .2814128
------------------------------------------------------------------------------

. margins, dydx(l_new_pos_pc)

Average marginal effects                        Number of obs     =        390
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : l_new_pos_pc

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
l_new_pos_pc |   .2509257   .0151273    16.59   0.000     .2204386    .2814128
------------------------------------------------------------------------------

. tab end_week if e(sample)==1

   end_week |      Freq.     Percent        Cum.
------------+-----------------------------------
   20200328 |          4        1.03        1.03
   20200404 |         13        3.33        4.36
   20200411 |         19        4.87        9.23
   20200418 |         29        7.44       16.67
   20200425 |         34        8.72       25.38
   20200502 |         37        9.49       34.87
   20200509 |         39       10.00       44.87
   20200516 |         42       10.77       55.64
   20200523 |         43       11.03       66.67
   20200530 |         43       11.03       77.69
   20200606 |         42       10.77       88.46
   20200613 |         45       11.54      100.00
------------+-----------------------------------
      Total |        390      100.00

. 
. reg hospitalizedcurrently_pc c.l_new_pos_pc c.l_new_pos_pc#c.l_p_pos, cluster(fips) nocons

Linear regression                               Number of obs     =        390
                                                F(2, 44)          =    2306.04
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9066
                                                Root MSE          =     6.3943

                                              (Std. Err. adjusted for 45 clusters in fips)
------------------------------------------------------------------------------------------
                         |               Robust
hospitalizedcurrently_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
            l_new_pos_pc |   .2042364   .0235582     8.67   0.000      .156758    .2517149
                         |
c.l_new_pos_pc#c.l_p_pos |   .0018848   .0005384     3.50   0.001     .0007997    .0029699
------------------------------------------------------------------------------------------

. margins, dydx(l_new_pos_pc) at(l_p_pos=(5 15 25 35 45))

Average marginal effects                        Number of obs     =        390
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : l_new_pos_pc

1._at        : l_p_pos         =           5

2._at        : l_p_pos         =          15

3._at        : l_p_pos         =          25

4._at        : l_p_pos         =          35

5._at        : l_p_pos         =          45

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
l_new_pos_pc |
         _at |
          1  |   .2136604   .0209149    10.22   0.000     .1715093    .2558115
          2  |   .2325084   .0156781    14.83   0.000     .2009113    .2641055
          3  |   .2513564   .0105904    23.73   0.000     .2300129    .2726998
          4  |   .2702043   .0060408    44.73   0.000       .25803    .2823787
          5  |   .2890523   .0043368    66.65   0.000     .2803121    .2977925
------------------------------------------------------------------------------

. gen hospitalization_sample = e(sample)

. tab state hospitalization_sample

                     | hospitalization_sampl
                     |           e
     (firstnm) state |         0          1 |     Total
---------------------+----------------------+----------
             Alabama |        14          0 |        14 
              Alaska |         6          8 |        14 
             Arizona |         6          8 |        14 
            Arkansas |         2         12 |        14 
          California |         3         11 |        14 
            Colorado |         2         12 |        14 
         Connecticut |         2         12 |        14 
            Delaware |         3         11 |        14 
District of Columbia |         9          5 |        14 
             Florida |        14          0 |        14 
             Georgia |        11          3 |        14 
              Hawaii |        14          0 |        14 
               Idaho |        14          0 |        14 
            Illinois |         5          9 |        14 
             Indiana |         7          7 |        14 
                Iowa |         3         11 |        14 
              Kansas |        14          0 |        14 
            Kentucky |         5          9 |        14 
           Louisiana |         4         10 |        14 
               Maine |         6          8 |        14 
            Maryland |         7          7 |        14 
       Massachusetts |         3         10 |        13 
            Michigan |         6          9 |        15 
           Minnesota |         3         11 |        14 
         Mississippi |         7          7 |        14 
            Missouri |         4         10 |        14 
             Montana |         5          9 |        14 
            Nebraska |        13          1 |        14 
              Nevada |         9          5 |        14 
       New Hampshire |         6          8 |        14 
          New Jersey |         3         11 |        14 
          New Mexico |         3         11 |        14 
            New York |         2         12 |        14 
      North Carolina |         3         11 |        14 
        North Dakota |         4         10 |        14 
                Ohio |         8          6 |        14 
            Oklahoma |         6          8 |        14 
              Oregon |         5          9 |        14 
        Pennsylvania |         5          9 |        14 
        Rhode Island |         4         11 |        15 
      South Carolina |        11          3 |        14 
        South Dakota |         7          7 |        14 
           Tennessee |        14          0 |        14 
               Texas |         4         10 |        14 
                Utah |         9          5 |        14 
             Vermont |         4         10 |        14 
            Virginia |         5          9 |        14 
          Washington |        10         10 |        20 
       West Virginia |         5          9 |        14 
           Wisconsin |         5          9 |        14 
             Wyoming |         7          7 |        14 
---------------------+----------------------+----------
               Total |       331        390 |       721 

. 
. restore

. 
. log close
      name:  <unnamed>
       log:  C:\Users\favero\Documents\GitHub\covid-underreporting\code\..\logs\simple_indicator_of_c
> ovid_severity.txt
  log type:  text
 closed on:  19 Jun 2020, 14:15:15
-----------------------------------------------------------------------------------------------------
