-------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\favero\Documents\GitHub\covid-underreporting\code\..\logs\simple_indicator_of_covid_severity.txt
  log type:  text
 opened on:  22 Jun 2020, 19:56:43

. 
. use "..\data\weeklydata.dta"

. 
. gen l_new_pos_pc = l.new_pos_pc
(19,215 missing values generated)

. gen l_p_pos = l.p_pos
(19,259 missing values generated)

. 
. set scheme s2mono

. format end_week %tdnn/dd

. 
. foreach var of varlist adj_covid_deaths_pc adj_excess_respir_deaths_pc adj_excess_deaths_pc {
  2.         replace `var' = . if days_to_report <= 14
  3. }
(49 real changes made, 49 to missing)
(49 real changes made, 49 to missing)
(49 real changes made, 49 to missing)

. 
. preserve

. keep if days_to_report > 14 & dayscollapsed == 7 & l_p_pos != . & fips != . & fips != 72
(19,409 observations deleted)

. 
. *** State Analyses ***
. 
. // covid deaths
. 
. reg adj_covid_deaths_pc c.l_new_pos_pc if l_p_pos != ., cluster(fips) nocons

Linear regression                               Number of obs     =        503
                                                F(1, 48)          =     167.53
                                                Prob > F          =     0.0000
                                                R-squared         =     0.8668
                                                Root MSE          =      1.719

                                  (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
adj_covid_~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
l_new_pos_pc |   .0645726   .0049889    12.94   0.000     .0545418    .0746034
------------------------------------------------------------------------------

.         local naive_coef = _b[l_new_pos_pc]

.         estimates store dv1_1, title("COVID-19 deaths")

.         margins, dydx(l_new_pos_pc)

Average marginal effects                        Number of obs     =        503
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : l_new_pos_pc

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
l_new_pos_pc |   .0645726   .0049889    12.94   0.000     .0545418    .0746034
------------------------------------------------------------------------------

. 
. reg adj_covid_deaths_pc c.l_new_pos_pc c.l_new_pos_pc#c.l_p_pos, cluster(fips) nocons

Linear regression                               Number of obs     =        503
                                                F(2, 48)          =     226.95
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9049
                                                Root MSE          =     1.4542

                                              (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------------------
                         |               Robust
     adj_covid_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
            l_new_pos_pc |   .0416822   .0046757     8.91   0.000     .0322811    .0510833
                         |
c.l_new_pos_pc#c.l_p_pos |   .0008932   .0001658     5.39   0.000     .0005599    .0012265
------------------------------------------------------------------------------------------

.         local cov_adj_coef1 = _b[l_new_pos_pc]

.         local cov_adj_coef2 = _b[l_new_pos_pc#l_p_pos]

.         estimates store dv1_2, title(" ")

.         margins, dydx(l_new_pos_pc) at(l_p_pos=(5 15 25 35 45))

Average marginal effects                        Number of obs     =        503
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : l_new_pos_pc

1._at        : l_p_pos         =           5

2._at        : l_p_pos         =          15

3._at        : l_p_pos         =          25

4._at        : l_p_pos         =          35

5._at        : l_p_pos         =          45

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
l_new_pos_pc |
         _at |
          1  |   .0461481   .0040692    11.34   0.000     .0379663    .0543298
          2  |   .0550798   .0031738    17.35   0.000     .0486983    .0614612
          3  |   .0640115   .0030139    21.24   0.000     .0579516    .0700714
          4  |   .0729432   .0036864    19.79   0.000     .0655312    .0803552
          5  |   .0818749   .0048571    16.86   0.000     .0721091    .0916408
------------------------------------------------------------------------------

.         tab end_week if e(sample)==1

   end_week |      Freq.     Percent        Cum.
------------+-----------------------------------
       3/21 |         30        5.96        5.96
       3/28 |         37        7.36       13.32
        4/4 |         45        8.95       22.27
       4/11 |         49        9.74       32.01
       4/18 |         49        9.74       41.75
       4/25 |         49        9.74       51.49
        5/2 |         48        9.54       61.03
        5/9 |         49        9.74       70.78
       5/16 |         49        9.74       80.52
       5/23 |         49        9.74       90.26
       5/30 |         49        9.74      100.00
------------+-----------------------------------
      Total |        503      100.00

.         tab dayscollapsed if e(sample)==1, missing

      (sum) |
dayscollaps |
         ed |      Freq.     Percent        Cum.
------------+-----------------------------------
          7 |        503      100.00      100.00
------------+-----------------------------------
      Total |        503      100.00

. 
. // excess respiratory deaths
. 
. reg adj_excess_respir_deaths_pc c.l_new_pos_pc if l_p_pos != ., cluster(fips) nocons

Linear regression                               Number of obs     =        503
                                                F(1, 48)          =     142.84
                                                Prob > F          =     0.0000
                                                R-squared         =     0.8473
                                                Root MSE          =     1.9139

                                  (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
a~respir_d~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
l_new_pos_pc |   .0664002   .0055557    11.95   0.000     .0552297    .0775707
------------------------------------------------------------------------------

.         estimates store dv2_1, title("Excess select respiratory illness deaths")

.         margins, dydx(l_new_pos_pc)

Average marginal effects                        Number of obs     =        503
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : l_new_pos_pc

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
l_new_pos_pc |   .0664002   .0055557    11.95   0.000     .0552297    .0775707
------------------------------------------------------------------------------

. 
. reg adj_excess_respir_deaths_pc c.l_new_pos_pc c.l_new_pos_pc#c.l_p_pos, cluster(fips) nocons

Linear regression                               Number of obs     =        503
                                                F(2, 48)          =     213.31
                                                Prob > F          =     0.0000
                                                R-squared         =     0.8925
                                                Root MSE          =     1.6077

                                              (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------------------
                         |               Robust
adj_excess_respir_deat~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
            l_new_pos_pc |    .040477   .0050852     7.96   0.000     .0302524    .0507015
                         |
c.l_new_pos_pc#c.l_p_pos |   .0010115   .0001745     5.80   0.000     .0006606    .0013624
------------------------------------------------------------------------------------------

.         estimates store dv2_2, title(" ")

.         margins, dydx(l_new_pos_pc) at(l_p_pos=(5 15 25 35 45))

Average marginal effects                        Number of obs     =        503
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : l_new_pos_pc

1._at        : l_p_pos         =           5

2._at        : l_p_pos         =          15

3._at        : l_p_pos         =          25

4._at        : l_p_pos         =          35

5._at        : l_p_pos         =          45

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
l_new_pos_pc |
         _at |
          1  |   .0455345   .0044408    10.25   0.000     .0366056    .0544634
          2  |   .0556496   .0034658    16.06   0.000     .0486812    .0626181
          3  |   .0657647   .0032238    20.40   0.000     .0592829    .0722466
          4  |   .0758798   .0038555    19.68   0.000     .0681279    .0836317
          5  |   .0859949   .0050425    17.05   0.000     .0758564    .0961335
------------------------------------------------------------------------------

.         tab end_week if e(sample)==1

   end_week |      Freq.     Percent        Cum.
------------+-----------------------------------
       3/21 |         30        5.96        5.96
       3/28 |         37        7.36       13.32
        4/4 |         45        8.95       22.27
       4/11 |         49        9.74       32.01
       4/18 |         49        9.74       41.75
       4/25 |         49        9.74       51.49
        5/2 |         48        9.54       61.03
        5/9 |         49        9.74       70.78
       5/16 |         49        9.74       80.52
       5/23 |         49        9.74       90.26
       5/30 |         49        9.74      100.00
------------+-----------------------------------
      Total |        503      100.00

.         tab dayscollapsed if e(sample)==1, missing

      (sum) |
dayscollaps |
         ed |      Freq.     Percent        Cum.
------------+-----------------------------------
          7 |        503      100.00      100.00
------------+-----------------------------------
      Total |        503      100.00

. 
. // excess all-cause deaths
. 
. reg adj_excess_deaths_pc c.l_new_pos_pc if l_p_pos != ., cluster(fips) nocons

Linear regression                               Number of obs     =        503
                                                F(1, 48)          =     217.88
                                                Prob > F          =     0.0000
                                                R-squared         =     0.7660
                                                Root MSE          =     3.4964

                                  (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
adj_excess.. |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
l_new_pos_pc |    .093165   .0063117    14.76   0.000     .0804746    .1058555
------------------------------------------------------------------------------

.         estimates store dv3_1, title("Excess all-cause deaths")

.         margins, dydx(l_new_pos_pc)

Average marginal effects                        Number of obs     =        503
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : l_new_pos_pc

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
l_new_pos_pc |    .093165   .0063117    14.76   0.000     .0804746    .1058555
------------------------------------------------------------------------------

. 
. reg adj_excess_deaths_pc c.l_new_pos_pc c.l_new_pos_pc#c.l_p_pos, cluster(fips) nocons

Linear regression                               Number of obs     =        503
                                                F(2, 48)          =     228.09
                                                Prob > F          =     0.0000
                                                R-squared         =     0.7839
                                                Root MSE          =     3.3632

                                              (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------------------
                         |               Robust
    adj_excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
            l_new_pos_pc |    .069063   .0089161     7.75   0.000     .0511359      .08699
                         |
c.l_new_pos_pc#c.l_p_pos |   .0009404   .0003053     3.08   0.003     .0003267    .0015542
------------------------------------------------------------------------------------------

.         estimates store dv3_2, title(" ")

.         margins, dydx(l_new_pos_pc) at(l_p_pos=(5 15 25 35 45))

Average marginal effects                        Number of obs     =        503
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : l_new_pos_pc

1._at        : l_p_pos         =           5

2._at        : l_p_pos         =          15

3._at        : l_p_pos         =          25

4._at        : l_p_pos         =          35

5._at        : l_p_pos         =          45

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
l_new_pos_pc |
         _at |
          1  |   .0737652   .0076257     9.67   0.000     .0584327    .0890977
          2  |   .0831697   .0054257    15.33   0.000     .0722607    .0940788
          3  |   .0925742      .0044    21.04   0.000     .0837273    .1014211
          4  |   .1019787   .0052838    19.30   0.000     .0913549    .1126025
          5  |   .1113832   .0074238    15.00   0.000     .0964566    .1263098
------------------------------------------------------------------------------

.         tab end_week if e(sample)==1

   end_week |      Freq.     Percent        Cum.
------------+-----------------------------------
       3/21 |         30        5.96        5.96
       3/28 |         37        7.36       13.32
        4/4 |         45        8.95       22.27
       4/11 |         49        9.74       32.01
       4/18 |         49        9.74       41.75
       4/25 |         49        9.74       51.49
        5/2 |         48        9.54       61.03
        5/9 |         49        9.74       70.78
       5/16 |         49        9.74       80.52
       5/23 |         49        9.74       90.26
       5/30 |         49        9.74      100.00
------------+-----------------------------------
      Total |        503      100.00

.         tab dayscollapsed if e(sample)==1, missing

      (sum) |
dayscollaps |
         ed |      Freq.     Percent        Cum.
------------+-----------------------------------
          7 |        503      100.00      100.00
------------+-----------------------------------
      Total |        503      100.00

. 
. // covid hospitalizations
. restore

. preserve

. keep if dayscollapsed==7 & fips != . & fips != 72 & l_p_pos != .
(19,310 observations deleted)

. 
. reg hospitalizedcurrently_pc c.l_new_pos_pc if l_p_pos != ., cluster(fips) nocons

Linear regression                               Number of obs     =        390
                                                F(1, 44)          =     275.15
                                                Prob > F          =     0.0000
                                                R-squared         =     0.8945
                                                Root MSE          =      6.788

                                  (Std. Err. adjusted for 45 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
hospitaliz~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
l_new_pos_pc |   .2509257   .0151273    16.59   0.000     .2204386    .2814128
------------------------------------------------------------------------------

.         estimates store dv4_1, title("Current COVID-19 hospitalizations")

.         margins, dydx(l_new_pos_pc)

Average marginal effects                        Number of obs     =        390
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : l_new_pos_pc

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
l_new_pos_pc |   .2509257   .0151273    16.59   0.000     .2204386    .2814128
------------------------------------------------------------------------------

.         tab end_week if e(sample)==1

   end_week |      Freq.     Percent        Cum.
------------+-----------------------------------
       3/28 |          4        1.03        1.03
        4/4 |         13        3.33        4.36
       4/11 |         19        4.87        9.23
       4/18 |         29        7.44       16.67
       4/25 |         34        8.72       25.38
        5/2 |         37        9.49       34.87
        5/9 |         39       10.00       44.87
       5/16 |         42       10.77       55.64
       5/23 |         43       11.03       66.67
       5/30 |         43       11.03       77.69
        6/6 |         42       10.77       88.46
       6/13 |         45       11.54      100.00
------------+-----------------------------------
      Total |        390      100.00

.         tab dayscollapsed if e(sample)==1, missing

      (sum) |
dayscollaps |
         ed |      Freq.     Percent        Cum.
------------+-----------------------------------
          7 |        390      100.00      100.00
------------+-----------------------------------
      Total |        390      100.00

. 
. reg hospitalizedcurrently_pc c.l_new_pos_pc c.l_new_pos_pc#c.l_p_pos, cluster(fips) nocons

Linear regression                               Number of obs     =        390
                                                F(2, 44)          =    2306.04
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9066
                                                Root MSE          =     6.3943

                                              (Std. Err. adjusted for 45 clusters in fips)
------------------------------------------------------------------------------------------
                         |               Robust
hospitalizedcurrently_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
            l_new_pos_pc |   .2042364   .0235582     8.67   0.000      .156758    .2517149
                         |
c.l_new_pos_pc#c.l_p_pos |   .0018848   .0005384     3.50   0.001     .0007997    .0029699
------------------------------------------------------------------------------------------

.         estimates store dv4_2, title(" ")

.         margins, dydx(l_new_pos_pc) at(l_p_pos=(5 15 25 35 45))

Average marginal effects                        Number of obs     =        390
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : l_new_pos_pc

1._at        : l_p_pos         =           5

2._at        : l_p_pos         =          15

3._at        : l_p_pos         =          25

4._at        : l_p_pos         =          35

5._at        : l_p_pos         =          45

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
l_new_pos_pc |
         _at |
          1  |   .2136604   .0209149    10.22   0.000     .1715093    .2558115
          2  |   .2325084   .0156781    14.83   0.000     .2009113    .2641055
          3  |   .2513564   .0105904    23.73   0.000     .2300129    .2726998
          4  |   .2702043   .0060408    44.73   0.000       .25803    .2823787
          5  |   .2890523   .0043368    66.65   0.000     .2803121    .2977925
------------------------------------------------------------------------------

.         gen hospitalization_sample = e(sample)

.         tab state hospitalization_sample

                     | hospitalization_sampl
                     |           e
     (firstnm) state |         0          1 |     Total
---------------------+----------------------+----------
             Alabama |        11          0 |        11 
              Alaska |         5          8 |        13 
             Arizona |         5          8 |        13 
            Arkansas |         1         12 |        13 
          California |         2         11 |        13 
            Colorado |         1         12 |        13 
         Connecticut |         0         12 |        12 
            Delaware |         2         11 |        13 
District of Columbia |         7          5 |        12 
             Florida |        12          0 |        12 
             Georgia |         6          3 |         9 
              Hawaii |         9          0 |         9 
               Idaho |        13          0 |        13 
            Illinois |         4          9 |        13 
             Indiana |         5          7 |        12 
                Iowa |         2         11 |        13 
              Kansas |        13          0 |        13 
            Kentucky |         3          9 |        12 
           Louisiana |         1         10 |        11 
               Maine |         5          8 |        13 
            Maryland |         6          7 |        13 
       Massachusetts |         1         10 |        11 
            Michigan |         3          9 |        12 
           Minnesota |         2         11 |        13 
         Mississippi |         4          7 |        11 
            Missouri |         1         10 |        11 
             Montana |         4          9 |        13 
            Nebraska |        12          1 |        13 
              Nevada |         8          5 |        13 
       New Hampshire |         4          8 |        12 
          New Jersey |         1         11 |        12 
          New Mexico |         2         11 |        13 
            New York |         1         12 |        13 
      North Carolina |         0         11 |        11 
        North Dakota |         3         10 |        13 
                Ohio |         7          6 |        13 
            Oklahoma |         4          8 |        12 
              Oregon |         4          9 |        13 
        Pennsylvania |         2          9 |        11 
        Rhode Island |         1         11 |        12 
      South Carolina |        10          3 |        13 
        South Dakota |         6          7 |        13 
           Tennessee |        11          0 |        11 
               Texas |         0         10 |        10 
                Utah |         6          5 |        11 
             Vermont |         3         10 |        13 
            Virginia |         4          9 |        13 
          Washington |         3         10 |        13 
       West Virginia |         4          9 |        13 
           Wisconsin |         4          9 |        13 
             Wyoming |         3          7 |        10 
---------------------+----------------------+----------
               Total |       231        390 |       621 

. 
. // figure
. restore

. preserve

. 
. replace adj_covid_deaths = . if fips!=.
(943 real changes made, 943 to missing)

. gen state_reporting = 1 if new_neg != . & new_pos != .
(19,209 missing values generated)

. collapse (firstnm) adj_covid_deaths days_to_report (sum) new_pos new_neg state_reporting, by(end_week)

. 
. tsset end_week, delta(7)
        time variable:  end_week, 1/5 to 6/20
                delta:  7 days

. gen l_new_pos = l.new_pos
(1 missing value generated)

. gen l_p_pos = l.new_pos/(l.new_pos+l.new_neg)*100
(373 missing values generated)

. drop if end_week<date("2020/03/21", "YMD") | days_to_report <= 14 | days_to_report == .
(379 observations deleted)

. 
. display "Adjustment factor: "+`cov_adj_coef2'/`cov_adj_coef1' 
Adjustment factor: .02142813

. gen cov_adj_case_count = l_new_pos*(1+`cov_adj_coef2'/`cov_adj_coef1'*l_p_pos)

. reg adj_covid_deaths l_new_pos

      Source |       SS           df       MS      Number of obs   =        11
-------------+----------------------------------   F(1, 9)         =     36.08
       Model |   213066588         1   213066588   Prob > F        =    0.0002
    Residual |  53149144.5         9   5905460.5   R-squared       =    0.8004
-------------+----------------------------------   Adj R-squared   =    0.7782
       Total |   266215733        10  26621573.3   Root MSE        =    2430.1

------------------------------------------------------------------------------
adj_covid_~s |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   l_new_pos |   .0639053   .0106391     6.01   0.000     .0398379    .0879727
       _cons |   667.6886   1732.928     0.39   0.709    -3252.467    4587.845
------------------------------------------------------------------------------

. predict naive_count_prediction
(option xb assumed; fitted values)

. la var naive_count_prediction "Prediction from naïve case count (new cases)"

. reg adj_covid_deaths cov_adj_case_count

      Source |       SS           df       MS      Number of obs   =        11
-------------+----------------------------------   F(1, 9)         =    106.65
       Model |   245497723         1   245497723   Prob > F        =    0.0000
    Residual |  20718009.4         9  2302001.05   R-squared       =    0.9222
-------------+----------------------------------   Adj R-squared   =    0.9135
       Total |   266215733        10  26621573.3   Root MSE        =    1517.2

------------------------------------------------------------------------------------
  adj_covid_deaths |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------+----------------------------------------------------------------
cov_adj_case_count |   .0502833   .0048691    10.33   0.000     .0392685     .061298
             _cons |   391.7497   1045.535     0.37   0.717    -1973.415    2756.914
------------------------------------------------------------------------------------

. predict cov_adj_prediction
(option xb assumed; fitted values)

. la var cov_adj_prediction "Prediction from detection-adjusted cases"

. 
. /*
> gen naive_count_prediction = `naive_coef'*l_new_pos
> la var naive_count_prediction "Prediction from naïve case count (new cases)"
> gen cov_adj_prediction = `cov_adj_coef1'*l_new_pos + `cov_adj_coef2'*l_new_pos*l_p_pos
> la var cov_adj_prediction "Prediction from detection-adjusted cases"
> */
. 
. twoway (line adj_covid_deaths end_week) (line naive_count_prediction end_week) (line cov_adj_prediction end_week), tlabel(21m
> ar2020(7)30may2020)

. 
. list end_week adj_covid_deaths naive_count_prediction cov_adj_prediction state_reporting l_p_pos

     +-----------------------------------------------------------------+
     | end_week   adj_co~s   naive_~n   cov_ad~n   state_~g    l_p_pos |
     |-----------------------------------------------------------------|
  1. |     3/21   550.6111   1039.426   815.6504         38   20.96518 |
  2. |     3/28   3067.242   2410.641   2303.177         47   18.37549 |
  3. |      4/4    9626.49   7079.178   7448.155         51   18.60841 |
  4. |     4/11   16035.31   12456.17   13719.43         51   20.38658 |
  5. |     4/18   16909.72   14349.81   15930.87         51   20.69239 |
     |-----------------------------------------------------------------|
  6. |     4/25   14835.56   13405.35   14574.51         50   19.37132 |
  7. |      5/2   12569.75   14090.87   14148.75         51   14.11752 |
  8. |      5/9   11941.94    13006.2   12560.83         51   11.82812 |
  9. |     5/16   10141.43   11841.34   10924.13         51   9.238685 |
 10. |     5/23   8180.337   10825.69   9531.943         51   6.699807 |
     |-----------------------------------------------------------------|
 11. |     5/30   7247.609   10601.32   9148.528         49   5.615985 |
     +-----------------------------------------------------------------+

. 
. 
. // make tables
. restore

. keep if dayscollapsed==7 & l_p_pos!=. & fips != . & fips != 72 & (adj_covid_deaths_pc!=. | adj_excess_respir_deaths_pc!=. | a
> dj_excess_deaths_pc!=. | hospitalizedcurrently_pc!=.)
(19,322 observations deleted)

. tab end_week

   end_week |      Freq.     Percent        Cum.
------------+-----------------------------------
       3/21 |         30        4.93        4.93
       3/28 |         38        6.24       11.17
        4/4 |         47        7.72       18.88
       4/11 |         51        8.37       27.26
       4/18 |         51        8.37       35.63
       4/25 |         51        8.37       44.01
        5/2 |         50        8.21       52.22
        5/9 |         51        8.37       60.59
       5/16 |         51        8.37       68.97
       5/23 |         51        8.37       77.34
       5/30 |         51        8.37       85.71
        6/6 |         42        6.90       92.61
       6/13 |         45        7.39      100.00
------------+-----------------------------------
      Total |        609      100.00

. 
. la var l_new_pos_pc "Newly confirmed cases"

. la var l_p_pos "Percent positive (among new tests)"

. la var adj_covid_deaths_pc "COVID-19 deaths"

. la var adj_excess_respir_deaths_pc "Excess select respiratory illness deaths"

. la var adj_excess_deaths_pc "Excess all-cause deaths"

. la var hospitalizedcurrently_pc "Current COVID-19 hospitalizations"

. 
. estpost tabstat l_new_pos_pc l_p_pos adj_covid_deaths_pc adj_excess_respir_deaths_pc adj_excess_deaths_pc hospitalizedcurrent
> ly_pc, statistics(count mean sd min max) columns(statistics)

Summary statistics: count mean sd min max
     for variables: l_new_pos_pc l_p_pos adj_covid_deaths_pc adj_excess_respir_deaths_pc adj_excess_deaths_pc hospitalizedcurre
> ntly_pc

             |  e(count)    e(mean)      e(sd)     e(min)     e(max) 
-------------+-------------------------------------------------------
l_new_pos_pc |       609   43.97226   50.04447          0   341.5888 
     l_p_pos |       609   11.35813   13.40625          0        100 
adj_covid_~c |       503   2.539958   3.964329          0   33.79381 
a~respir_d~c |       503   2.561021   4.173696  -1.003206   35.40405 
adj_excess.. |       503   3.925435   6.066725  -23.68415   49.30772 
hospitaliz~c |       390   14.27128   15.24942   .0941349   95.45492 

. 
. esttab, title(Supplemental exhibit 1. Descriptive statistics) cells("count mean(fmt(2)) sd(fmt(2)) min(fmt(2)) max(fmt(2))") 
> nomtitle nonumber label noobs addnotes("Abbreviations: sd = standard deviation; min = minimum; max = maximum"), using "tables
> .rtf", replace
(note: file tables.rtf not found)
(output written to tables.rtf)

. 
. esttab dv?_?, ///
>    title(Supplemental exhibit 2. Regression results) /// 
>    nonum mlabels(,titles) cells(b(fmt(a2) star) se(par fmt(a2))) ///
>    legend starlevels(* 0.05 ** 0.01 *** 0.001) label ///
>    stats(r2 N, fmt(3 0) label("R-sqr" N)) ///
>    coef(l_new_pos_pc "New cases" c.l_new_pos_pc#c.l_p_pos "New cases X % Pos.") ///
>    addnotes("(two-tailed). Standard errors (se), in parentheses, are robust to clustering by state.") ///
>    , using "tables.rtf", append
(output written to tables.rtf)

. 
. 
. log close
      name:  <unnamed>
       log:  C:\Users\favero\Documents\GitHub\covid-underreporting\code\..\logs\simple_indicator_of_covid_severity.txt
  log type:  text
 closed on:  22 Jun 2020, 19:56:52
-------------------------------------------------------------------------------------------------------------------------------
