-----------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\favero\Documents\GitHub\covid-underreporting\code\..\logs\simple_indicator_of_c
> ovid_severity.txt
  log type:  text
 opened on:  11 Jun 2020, 17:48:25

. 
. use "..\data\weeklydata.dta"

. 
. gen l_new_pos_pc = l.new_pos_pc
(19,171 missing values generated)

. gen l_p_pos = l.p_pos 
(19,216 missing values generated)

. 
. preserve

. keep if days_to_report > 14 & days_to_report != . & l_p_pos != .
(19,417 observations deleted)

. 
. set scheme s2mono

. format end_week %tdnn/dd

. 
. la var adj_excess_respir_deaths_pc "No. of estimated excess respiratory deaths"

. la var adj_covid_deaths_pc "Deaths per 100,000 population"

. 
. *** State Analyses ***
. 
. // covid deaths
. 
. reg adj_covid_deaths_pc c.l_new_pos_pc if l_p_pos != ., cluster(fips) nocons

Linear regression                               Number of obs     =        407
                                                F(1, 48)          =     203.62
                                                Prob > F          =     0.0000
                                                R-squared         =     0.8798
                                                Root MSE          =     1.7466

                                  (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
adj_covid_~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
l_new_pos_pc |   .0683889   .0047926    14.27   0.000     .0587527    .0780251
------------------------------------------------------------------------------

. margins, dydx(l_new_pos_pc)

Average marginal effects                        Number of obs     =        407
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : l_new_pos_pc

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
l_new_pos_pc |   .0683889   .0047926    14.27   0.000     .0587527    .0780251
------------------------------------------------------------------------------

. capture drop naive_case_count_pc

. predict naive_case_count_pc
(option xb assumed; fitted values)

. la var naive_case_count_pc "Prediction from naÃ¯ve case count (new cases)"

. 
. reg adj_covid_deaths_pc c.l_new_pos_pc c.l_new_pos_pc#c.l_p_pos, cluster(fips) nocons

Linear regression                               Number of obs     =        407
                                                F(2, 48)          =     255.61
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9111
                                                Root MSE          =      1.504

                                              (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------------------
                         |               Robust
     adj_covid_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
            l_new_pos_pc |   .0425985   .0052783     8.07   0.000     .0319858    .0532112
                         |
c.l_new_pos_pc#c.l_p_pos |   .0009013   .0001854     4.86   0.000     .0005285     .001274
------------------------------------------------------------------------------------------

. margins, dydx(l_new_pos_pc) at(l_p_pos=(5 15 25 35 45))

Average marginal effects                        Number of obs     =        407
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : l_new_pos_pc

1._at        : l_p_pos         =           5

2._at        : l_p_pos         =          15

3._at        : l_p_pos         =          25

4._at        : l_p_pos         =          35

5._at        : l_p_pos         =          45

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
l_new_pos_pc |
         _at |
          1  |   .0471049   .0045324    10.39   0.000     .0379918    .0562179
          2  |   .0561176   .0033264    16.87   0.000     .0494296    .0628057
          3  |   .0651304   .0029088    22.39   0.000     .0592819    .0709789
          4  |   .0741431   .0035682    20.78   0.000     .0669688    .0813175
          5  |   .0831559   .0048865    17.02   0.000      .073331    .0929808
------------------------------------------------------------------------------

. capture drop estimated_death_count_pc

. predict estimated_death_count_pc
(option xb assumed; fitted values)

. la var estimated_death_count_pc "Prediction from detection-adjusted cases (new cases X percent posi
> tive)"

. 
. twoway (line adj_covid_deaths_pc end_week) (line naive_case_count_pc end_week) (line estimated_deat
> h_count_pc end_week) if state=="New York", tlabel(21mar2020(7)16may2020)

. twoway (line adj_covid_deaths_pc end_week) (line naive_case_count_pc end_week) (line estimated_deat
> h_count_pc end_week) if state=="California", tlabel(21mar2020(7)16may2020)

. 
. list end_week adj_covid_deaths_pc naive_case_count_pc estimated_death_count_pc new_tests_pc p_pos n
> ew_pos_pc if state=="New York"

     +----------------------------------------------------------------------------+
     | end_week   adj_co~c   naive_~c   estima~c   new_te~c      p_pos   new_po~c |
     |----------------------------------------------------------------------------|
268. |     3/21   .8092469   .1567797   .1271818   215.6051   23.33507   50.31161 |
269. |     3/28   6.081759   3.440755   3.201319   565.4274   37.97569    214.725 |
270. |      4/4    20.4658    14.6848   16.49626   653.3908   48.07537   314.1201 |
271. |     4/11   33.76158   21.48232    26.9916   805.2263   42.42147   341.5888 |
272. |     4/18   28.97777   23.36088   27.61128   795.9796   36.17697   287.9613 |
     |----------------------------------------------------------------------------|
273. |     4/25   19.89373   19.69335   21.65582   926.3845   25.08396   232.3739 |
274. |      5/2   12.39172   15.89179   15.15219   928.7742   16.98815   157.7816 |
275. |      5/9   10.50326    10.7905   9.137052   996.2896   10.34685   103.0846 |
276. |     5/16   7.378189   7.049838   5.352548   1151.093   6.717078   77.31982 |
     +----------------------------------------------------------------------------+

. list end_week adj_covid_deaths_pc naive_case_count_pc estimated_death_count_pc new_tests_pc p_pos n
> ew_pos_pc if state=="California"

     +----------------------------------------------------------------------------+
     | end_week   adj_co~c   naive_~c   estima~c   new_te~c      p_pos   new_po~c |
     |----------------------------------------------------------------------------|
 35. |     3/21   .1168106   .0316383   .0316854   28.71802   9.040493   2.596251 |
 36. |     3/28   .3429247   .1775547   .1317506   32.01453   26.56349   8.504174 |
 37. |      4/4   .7889296    .581591   .5658637   223.7478   8.341619   18.66418 |
 38. |     4/11   1.045309   1.276423   .9353854   150.4637   14.43069   21.71295 |
 39. |     4/18   1.461025   1.484924   1.207338   218.5376   9.656784    21.1037 |
     |----------------------------------------------------------------------------|
 40. |     4/25    1.32729   1.443259    1.08266   622.8195   4.941369   30.77581 |
 41. |      5/2   1.457093   2.104723   1.448064   456.9806    6.11834   27.95962 |
 42. |      5/9   1.561303   1.912127   1.345216   570.7377   5.476442   31.25613 |
 43. |     5/16   1.397783   2.137572   1.485738   673.8522   4.588904   30.92243 |
     +----------------------------------------------------------------------------+

. 
. // excess respiratory deaths
. 
. reg adj_excess_respir_deaths_pc c.l_new_pos_pc if l_p_pos != ., cluster(fips) nocons

Linear regression                               Number of obs     =        407
                                                F(1, 48)          =     174.40
                                                Prob > F          =     0.0000
                                                R-squared         =     0.8617
                                                Root MSE          =     1.9563

                                  (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
a~respir_d~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
l_new_pos_pc |   .0706813   .0053521    13.21   0.000     .0599201    .0814424
------------------------------------------------------------------------------

. margins, dydx(l_new_pos_pc)

Average marginal effects                        Number of obs     =        407
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : l_new_pos_pc

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
l_new_pos_pc |   .0706813   .0053521    13.21   0.000     .0599201    .0814424
------------------------------------------------------------------------------

. 
. reg adj_excess_respir_deaths_pc c.l_new_pos_pc c.l_new_pos_pc#c.l_p_pos, cluster(fips) nocons

Linear regression                               Number of obs     =        407
                                                F(2, 48)          =     240.85
                                                Prob > F          =     0.0000
                                                R-squared         =     0.8989
                                                Root MSE          =     1.6747

                                              (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------------------
                         |               Robust
adj_excess_respir_deat~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
            l_new_pos_pc |    .041316   .0057132     7.23   0.000     .0298289    .0528031
                         |
c.l_new_pos_pc#c.l_p_pos |   .0010262   .0001945     5.28   0.000     .0006351    .0014173
------------------------------------------------------------------------------------------

. margins, dydx(l_new_pos_pc) at(l_p_pos=(5 15 25 35 45))

Average marginal effects                        Number of obs     =        407
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : l_new_pos_pc

1._at        : l_p_pos         =           5

2._at        : l_p_pos         =          15

3._at        : l_p_pos         =          25

4._at        : l_p_pos         =          35

5._at        : l_p_pos         =          45

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
l_new_pos_pc |
         _at |
          1  |    .046447   .0049276     9.43   0.000     .0365394    .0563547
          2  |   .0567091   .0036386    15.59   0.000     .0493932    .0640249
          3  |   .0669711   .0031249    21.43   0.000     .0606881    .0732542
          4  |   .0772332   .0037227    20.75   0.000     .0697482    .0847182
          5  |   .0874952   .0050517    17.32   0.000      .077338    .0976524
------------------------------------------------------------------------------

. 
. // excess all-cause deaths
. 
. reg adj_excess_deaths_pc c.l_new_pos_pc if l_p_pos != ., cluster(fips) nocons

Linear regression                               Number of obs     =        407
                                                F(1, 48)          =     241.00
                                                Prob > F          =     0.0000
                                                R-squared         =     0.8094
                                                Root MSE          =     3.3281

                                  (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
adj_excess.. |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
l_new_pos_pc |   .0992743   .0063948    15.52   0.000     .0864167     .112132
------------------------------------------------------------------------------

. margins, dydx(l_new_pos_pc)

Average marginal effects                        Number of obs     =        407
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : l_new_pos_pc

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
l_new_pos_pc |   .0992743   .0063948    15.52   0.000     .0864167     .112132
------------------------------------------------------------------------------

. 
. reg adj_excess_deaths_pc c.l_new_pos_pc c.l_new_pos_pc#c.l_p_pos, cluster(fips) nocons

Linear regression                               Number of obs     =        407
                                                F(2, 48)          =     261.06
                                                Prob > F          =     0.0000
                                                R-squared         =     0.8267
                                                Root MSE          =     3.1772

                                              (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------------------
                         |               Robust
    adj_excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
            l_new_pos_pc |   .0702336   .0101583     6.91   0.000      .049809    .0906583
                         |
c.l_new_pos_pc#c.l_p_pos |   .0010149   .0003207     3.16   0.003       .00037    .0016597
------------------------------------------------------------------------------------------

. margins, dydx(l_new_pos_pc) at(l_p_pos=(5 15 25 35 45))

Average marginal effects                        Number of obs     =        407
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : l_new_pos_pc

1._at        : l_p_pos         =           5

2._at        : l_p_pos         =          15

3._at        : l_p_pos         =          25

4._at        : l_p_pos         =          35

5._at        : l_p_pos         =          45

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
l_new_pos_pc |
         _at |
          1  |    .075308   .0087393     8.62   0.000     .0577364    .0928795
          2  |   .0854566   .0061783    13.83   0.000     .0730342    .0978789
          3  |   .0956052    .004532    21.10   0.000     .0864929    .1047175
          4  |   .1057538   .0048454    21.83   0.000     .0960115    .1154961
          5  |   .1159024   .0068547    16.91   0.000     .1021201    .1296847
------------------------------------------------------------------------------

. 
. // covid hospitalizations
. restore

. keep if dayscollapsed==7
(19,169 observations deleted)

. gen hospitalizedcurrently_pc = hospitalizedcurrently * 100000 / population
(322 missing values generated)

. 
. reg hospitalizedcurrently_pc c.l_new_pos_pc if l_p_pos != ., cluster(fips) nocons

Linear regression                               Number of obs     =        345
                                                F(1, 43)          =     273.12
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9000
                                                Root MSE          =     6.9259

                                  (Std. Err. adjusted for 44 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
hospitaliz~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
l_new_pos_pc |   .2542387   .0153837    16.53   0.000     .2232144    .2852629
------------------------------------------------------------------------------

. margins, dydx(l_new_pos_pc)

Average marginal effects                        Number of obs     =        345
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : l_new_pos_pc

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
l_new_pos_pc |   .2542387   .0153837    16.53   0.000     .2232144    .2852629
------------------------------------------------------------------------------

. tab end_week if e(sample)==1

   end_week |      Freq.     Percent        Cum.
------------+-----------------------------------
   20200328 |          4        1.16        1.16
   20200404 |         13        3.77        4.93
   20200411 |         19        5.51       10.43
   20200418 |         29        8.41       18.84
   20200425 |         34        9.86       28.70
   20200502 |         37       10.72       39.42
   20200509 |         39       11.30       50.72
   20200516 |         42       12.17       62.90
   20200523 |         43       12.46       75.36
   20200530 |         43       12.46       87.83
   20200606 |         42       12.17      100.00
------------+-----------------------------------
      Total |        345      100.00

. 
. reg hospitalizedcurrently_pc c.l_new_pos_pc c.l_new_pos_pc#c.l_p_pos, cluster(fips) nocons

Linear regression                               Number of obs     =        345
                                                F(2, 43)          =    2383.96
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9107
                                                Root MSE          =     6.5566

                                              (Std. Err. adjusted for 44 clusters in fips)
------------------------------------------------------------------------------------------
                         |               Robust
hospitalizedcurrently_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
            l_new_pos_pc |   .2078036   .0262854     7.91   0.000      .154794    .2608133
                         |
c.l_new_pos_pc#c.l_p_pos |   .0018047   .0006078     2.97   0.005      .000579    .0030304
------------------------------------------------------------------------------------------

. margins, dydx(l_new_pos_pc) at(l_p_pos=(5 15 25 35 45))

Average marginal effects                        Number of obs     =        345
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : l_new_pos_pc

1._at        : l_p_pos         =           5

2._at        : l_p_pos         =          15

3._at        : l_p_pos         =          25

4._at        : l_p_pos         =          35

5._at        : l_p_pos         =          45

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
l_new_pos_pc |
         _at |
          1  |    .216827   .0232891     9.31   0.000     .1698601     .263794
          2  |   .2348739    .017341    13.54   0.000     .1999023    .2698454
          3  |   .2529207   .0115292    21.94   0.000     .2296699    .2761715
          4  |   .2709675   .0062462    43.38   0.000     .2583709    .2835641
          5  |   .2890143   .0043577    66.32   0.000     .2802262    .2978025
------------------------------------------------------------------------------

. gen hospitalization_sample = e(sample)

. tab state hospitalization_sample

                     | hospitalization_sampl
                     |           e
     (firstnm) state |         0          1 |     Total
---------------------+----------------------+----------
             Alabama |        13          0 |        13 
              Alaska |         6          7 |        13 
             Arizona |         6          7 |        13 
            Arkansas |         2         11 |        13 
          California |         3         10 |        13 
            Colorado |         2         11 |        13 
         Connecticut |         2         11 |        13 
            Delaware |         3         10 |        13 
District of Columbia |         9          4 |        13 
             Florida |        13          0 |        13 
             Georgia |        11          2 |        13 
              Hawaii |        13          0 |        13 
               Idaho |        13          0 |        13 
            Illinois |         5          8 |        13 
             Indiana |         7          6 |        13 
                Iowa |         3         10 |        13 
              Kansas |        13          0 |        13 
            Kentucky |         5          8 |        13 
           Louisiana |         4          9 |        13 
               Maine |         6          7 |        13 
            Maryland |         7          6 |        13 
       Massachusetts |         3          9 |        12 
            Michigan |         6          8 |        14 
           Minnesota |         3         10 |        13 
         Mississippi |         7          6 |        13 
            Missouri |         4          9 |        13 
             Montana |         5          8 |        13 
            Nebraska |        13          0 |        13 
              Nevada |         9          4 |        13 
       New Hampshire |         6          7 |        13 
          New Jersey |         3         10 |        13 
          New Mexico |         3         10 |        13 
            New York |         2         11 |        13 
      North Carolina |         3         10 |        13 
        North Dakota |         4          9 |        13 
                Ohio |         8          5 |        13 
            Oklahoma |         6          7 |        13 
              Oregon |         5          8 |        13 
        Pennsylvania |         5          8 |        13 
        Rhode Island |         4         10 |        14 
      South Carolina |        11          2 |        13 
        South Dakota |         7          6 |        13 
           Tennessee |        13          0 |        13 
               Texas |         4          9 |        13 
                Utah |         9          4 |        13 
             Vermont |         4          9 |        13 
            Virginia |         5          8 |        13 
          Washington |        10          9 |        19 
       West Virginia |         5          8 |        13 
           Wisconsin |         5          8 |        13 
             Wyoming |         7          6 |        13 
---------------------+----------------------+----------
               Total |       325        345 |       670 

. 
. 
. log close
      name:  <unnamed>
       log:  C:\Users\favero\Documents\GitHub\covid-underreporting\code\..\logs\simple_indicator_of_c
> ovid_severity.txt
  log type:  text
 closed on:  11 Jun 2020, 17:48:28
-----------------------------------------------------------------------------------------------------
