-----------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\favero\Documents\GitHub\covid-underreporting\data\..\logs\simple_indicator_of_c
> ovid_severity.txt
  log type:  text
 opened on:  26 May 2020, 14:34:27

. 
. use "..\data\weeklydata.dta"

. 
. 
. *** Nationwide Analysis ***
. 
. //note: treats missing as 0, and a handful of states aren't yet reporting cases (or more aren't rep
> orting negative test results) in early years
. foreach var of varlist covid_deaths adj_covid_deaths adj_total_deaths expected_deaths adj_pneumon_i
> nflu_or_covid expected_influ_pneu_deaths new_pos new_neg deathincrease {
  2.         egen us_`var' = total(`var'), by(end_week) missing
  3. }
(18,130 missing values generated)
(18,130 missing values generated)
(18,130 missing values generated)
(18,130 missing values generated)
(18,130 missing values generated)
(147 missing values generated)
(18,081 missing values generated)
(18,375 missing values generated)
(18,032 missing values generated)

. 
. gen us_p_pos = us_new_pos/(us_new_pos+us_new_neg)*100
(18,375 missing values generated)

. gen us_p_posXnew_pos = us_p_pos*us_new_pos
(18,375 missing values generated)

. gen us_adj_excess_deaths = (us_adj_total_deaths-us_expected_deaths)
(18,130 missing values generated)

. gen us_adj_excess_respir_deaths = (us_adj_pneumon_influ_or_covid-us_expected_influ_pneu_deaths)
(18,228 missing values generated)

. 
. egen us_tag = tag(end_week)

. 
. set scheme s2mono

. format end_week %tdnn/dd

. 
. twoway (line us_adj_excess_respir_deaths end_week, yaxis(1)) (line us_p_posXnew_pos end_week, yaxis
> (2)) (line us_new_pos end_week, yaxis(3)) if us_p_posXnew_pos != . & us_tag==1 & days_to_report > 1
> 4 & days_to_report!=.

. 
. 
. reg us_adj_covid_deaths us_new_pos l.us_new_pos if days_to_report > 14 & us_tag==1, cluster(fips) n
> ocons

Linear regression                               Number of obs     =         14
                                                F(0, 0)           =          .
                                                Prob > F          =          .
                                                R-squared         =     0.9755
                                                Root MSE          =     1376.3

                                   (Std. Err. adjusted for 1 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
us_adj_cov~s |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  us_new_pos |
         --. |   .0364415          .        .       .            .           .
         L1. |   .0296624          .        .       .            .           .
------------------------------------------------------------------------------

. predict us_naive_case_count
(option xb assumed; fitted values)
(18,130 missing values generated)

. la var us_naive_case_count "us_naive_case_count"

. 
. reg us_adj_covid_deaths c.us_new_pos#c.us_p_pos c.l.us_new_pos#c.l.us_p_pos if days_to_report > 14 
> & us_tag==1, cluster(fips) nocons

Linear regression                               Number of obs     =          8
                                                F(0, 0)           =          .
                                                Prob > F          =          .
                                                R-squared         =     0.9975
                                                Root MSE          =      623.2

                                                (Std. Err. adjusted for 1 clusters in fips)
-------------------------------------------------------------------------------------------
                          |               Robust
      us_adj_covid_deaths |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------------+----------------------------------------------------------------
  c.us_new_pos#c.us_p_pos |   .0011049          .        .       .            .           .
                          |
cL.us_new_pos#cL.us_p_pos |   .0027933          .        .       .            .           .
-------------------------------------------------------------------------------------------

. predict us_estimated_death_count
(option xb assumed; fitted values)
(18,424 missing values generated)

. la var us_estimated_death_count "us_estimated_death_count"

. 
. twoway (line us_estimated_death_count end_week) (line us_adj_covid_deaths end_week) (line us_naive_
> case_count end_week) if us_estimated_death_count != . & us_tag==1 & days_to_report > 14 & days_to_r
> eport!=.

. 
. twoway (line us_estimated_death_count end_week) (line us_covid_deaths end_week) (line us_naive_case
> _count end_week) if us_estimated_death_count != . & us_tag==1 & days_to_report > 14 & days_to_repor
> t!=.

. 
. 
. reg us_adj_excess_respir_deaths us_new_pos l.us_new_pos if days_to_report > 14 & us_tag==1, cluster
> (fips) nocons

Linear regression                               Number of obs     =         14
                                                F(0, 0)           =          .
                                                Prob > F          =          .
                                                R-squared         =     0.9733
                                                Root MSE          =     1514.5

                                   (Std. Err. adjusted for 1 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
us_~r_deaths |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  us_new_pos |
         --. |   .0529445          .        .       .            .           .
         L1. |   .0154915          .        .       .            .           .
------------------------------------------------------------------------------

. predict us_naive_case_count2
(option xb assumed; fitted values)
(18,130 missing values generated)

. la var us_naive_case_count2 "us_naive_case_count2"

. 
. reg us_adj_excess_respir_deaths c.us_new_pos#c.us_p_pos c.l.us_new_pos#c.l.us_p_pos if days_to_repo
> rt > 14 & us_tag==1, cluster(fips) nocons

Linear regression                               Number of obs     =          8
                                                F(0, 0)           =          .
                                                Prob > F          =          .
                                                R-squared         =     0.9982
                                                Root MSE          =      550.7

                                                (Std. Err. adjusted for 1 clusters in fips)
-------------------------------------------------------------------------------------------
                          |               Robust
us_adj_excess_respir_de~s |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------------+----------------------------------------------------------------
  c.us_new_pos#c.us_p_pos |   .0017516          .        .       .            .           .
                          |
cL.us_new_pos#cL.us_p_pos |   .0023596          .        .       .            .           .
-------------------------------------------------------------------------------------------

. predict us_estimated_death_count2
(option xb assumed; fitted values)
(18,424 missing values generated)

. la var us_estimated_death_count2 "us_estimated_death_count2"

. 
. twoway (line us_estimated_death_count2 end_week) (line us_adj_excess_respir_deaths end_week) (line 
> us_naive_case_count2 end_week) if us_estimated_death_count != . & us_tag==1 & days_to_report > 14 &
>  days_to_report!=.

. 
. 
. reg us_adj_excess_deaths us_new_pos l.us_new_pos if days_to_report > 14 & us_tag==1, cluster(fips) 
> nocons

Linear regression                               Number of obs     =         14
                                                F(0, 0)           =          .
                                                Prob > F          =          .
                                                R-squared         =     0.9590
                                                Root MSE          =     2401.7

                                   (Std. Err. adjusted for 1 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
us_~s_deaths |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  us_new_pos |
         --. |     .07938          .        .       .            .           .
         L1. |    .006425          .        .       .            .           .
------------------------------------------------------------------------------

. predict us_naive_case_count3
(option xb assumed; fitted values)
(18,130 missing values generated)

. la var us_naive_case_count3 "us_naive_case_count3"

. 
. reg us_adj_excess_deaths c.us_new_pos#c.us_p_pos c.l.us_new_pos#c.l.us_p_pos if days_to_report > 14
>  & us_tag==1, cluster(fips) nocons

Linear regression                               Number of obs     =          8
                                                F(0, 0)           =          .
                                                Prob > F          =          .
                                                R-squared         =     0.9993
                                                Root MSE          =     430.79

                                                (Std. Err. adjusted for 1 clusters in fips)
-------------------------------------------------------------------------------------------
                          |               Robust
     us_adj_excess_deaths |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------------+----------------------------------------------------------------
  c.us_new_pos#c.us_p_pos |   .0027724          .        .       .            .           .
                          |
cL.us_new_pos#cL.us_p_pos |   .0024773          .        .       .            .           .
-------------------------------------------------------------------------------------------

. predict us_estimated_death_count3
(option xb assumed; fitted values)
(18,424 missing values generated)

. la var us_estimated_death_count3 "us_estimated_death_count3"

. 
. twoway (line us_estimated_death_count3 end_week) (line us_adj_excess_deaths end_week) (line us_naiv
> e_case_count3 end_week) if us_estimated_death_count != . & us_tag==1 & days_to_report > 14 & days_t
> o_report!=.

. 
. 
. *** State Analyses ***
. 
. reg adj_excess_respir_deaths_pc c.new_pos_pc c.l.new_pos_pc  if days_to_report > 14, nocons

      Source |       SS           df       MS      Number of obs   =       397
-------------+----------------------------------   F(2, 395)       =   1015.17
       Model |  787888.371         2  393944.185   Prob > F        =    0.0000
    Residual |  153282.785       395  388.057685   R-squared       =    0.8371
-------------+----------------------------------   Adj R-squared   =    0.8363
       Total |  941171.156       397   2370.7082   Root MSE        =    19.699

------------------------------------------------------------------------------
a~respir_d~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  new_pos_pc |
         --. |   .0290218   .0041795     6.94   0.000      .020805    .0372386
         L1. |   .0382591   .0044949     8.51   0.000     .0294222     .047096
------------------------------------------------------------------------------

. capture drop naive_case_count_pc

. predict naive_case_count_pc
(option xb assumed; fitted values)
(18,419 missing values generated)

. la var naive_case_count_pc "naive_case_count_pc"

. 
. reg adj_excess_respir_deaths_pc c.new_pos_pc#c.p_pos c.l.new_pos_pc#c.l.p_pos  if days_to_report > 
> 14, nocons

      Source |       SS           df       MS      Number of obs   =       357
-------------+----------------------------------   F(2, 355)       =   1346.45
       Model |   826100.03         2  413050.015   Prob > F        =    0.0000
    Residual |  108903.356       355  306.770018   R-squared       =    0.8835
-------------+----------------------------------   Adj R-squared   =    0.8829
       Total |  935003.386       357   2619.0571   Root MSE        =    17.515

----------------------------------------------------------------------------------------
adj_excess_respir_de~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------+----------------------------------------------------------------
  c.new_pos_pc#c.p_pos |   .0009347   .0000887    10.54   0.000     .0007602    .0011092
                       |
cL.new_pos_pc#cL.p_pos |   .0011834   .0000906    13.06   0.000     .0010052    .0013616
----------------------------------------------------------------------------------------

. capture drop estimated_death_count_pc

. predict estimated_death_count_pc
(option xb assumed; fitted values)
(18,461 missing values generated)

. la var estimated_death_count_pc "estimated_death_count_pc"

. 
. // ten states w most covid cases_pc
. twoway (line adj_excess_respir_deaths_pc end_week) (line estimated_death_count_pc end_week) (line n
> aive_case_count_pc end_week) if estimated_death_count_pc != . & (fips==10 | fips==11 | fips==22 | f
> ips==24 | fips==25 | fips==26 | fips==34 | fips==36 | fips==42 | fips==44) & days_to_report > 14 & 
> days_to_report!=., by(state)

. //drop Louisiana b/c reported number of negative cases drops half way through series
. twoway (line adj_excess_respir_deaths_pc end_week) (line estimated_death_count_pc end_week) (line n
> aive_case_count_pc end_week) if estimated_death_count_pc != . & (fips==10 | fips==11 | fips==24 | f
> ips==25 | fips==26 | fips==34 | fips==36 | fips==42 | fips==44) & days_to_report > 14 & days_to_rep
> ort!=., by(state)

. 
. 
. 
. 
. 
. log close
      name:  <unnamed>
       log:  C:\Users\favero\Documents\GitHub\covid-underreporting\data\..\logs\simple_indicator_of_c
> ovid_severity.txt
  log type:  text
 closed on:  26 May 2020, 14:34:46
-----------------------------------------------------------------------------------------------------
