-----------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\favero\Documents\GitHub\covid-underreporting\code\..\logs\simple_indicator_of_c
> ovid_severity.txt
  log type:  text
 opened on:  12 Jun 2020, 14:07:20

. 
. use "..\data\weeklydata.dta"

. 
. gen l_new_pos_pc = l.new_pos_pc
(19,174 missing values generated)

. gen l_p_pos = l.p_pos 
(19,218 missing values generated)

. 
. preserve

. keep if days_to_report > 14 & days_to_report != . & l_p_pos != .
(19,368 observations deleted)

. 
. set scheme s2mono

. format end_week %tdnn/dd

. 
. la var adj_excess_respir_deaths_pc "No. of estimated excess respiratory deaths"

. la var adj_covid_deaths_pc "Deaths per 100,000 population"

. 
. *** State Analyses ***
. 
. // covid deaths
. 
. reg adj_covid_deaths_pc c.l_new_pos_pc if l_p_pos != ., cluster(fips) nocons

Linear regression                               Number of obs     =        454
                                                F(1, 48)          =     181.62
                                                Prob > F          =     0.0000
                                                R-squared         =     0.8749
                                                Root MSE          =     1.7386

                                  (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
adj_covid_~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
l_new_pos_pc |     .06707   .0049767    13.48   0.000     .0570637    .0770764
------------------------------------------------------------------------------

. margins, dydx(l_new_pos_pc)

Average marginal effects                        Number of obs     =        454
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : l_new_pos_pc

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
l_new_pos_pc |     .06707   .0049767    13.48   0.000     .0570637    .0770764
------------------------------------------------------------------------------

. capture drop naive_case_count_pc

. predict naive_case_count_pc
(option xb assumed; fitted values)

. la var naive_case_count_pc "Prediction from naÃ¯ve case count (new cases)"

. 
. reg adj_covid_deaths_pc c.l_new_pos_pc c.l_new_pos_pc#c.l_p_pos, cluster(fips) nocons

Linear regression                               Number of obs     =        454
                                                F(2, 48)          =     214.48
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9060
                                                Root MSE          =     1.5086

                                              (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------------------
                         |               Robust
     adj_covid_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
            l_new_pos_pc |   .0440012   .0051848     8.49   0.000     .0335765    .0544259
                         |
c.l_new_pos_pc#c.l_p_pos |   .0008508   .0001841     4.62   0.000     .0004807    .0012209
------------------------------------------------------------------------------------------

. tab end_week if e(sample)==1

   end_week |      Freq.     Percent        Cum.
------------+-----------------------------------
       3/21 |         30        6.61        6.61
       3/28 |         37        8.15       14.76
        4/4 |         45        9.91       24.67
       4/11 |         49       10.79       35.46
       4/18 |         49       10.79       46.26
       4/25 |         49       10.79       57.05
        5/2 |         48       10.57       67.62
        5/9 |         49       10.79       78.41
       5/16 |         49       10.79       89.21
       5/23 |         49       10.79      100.00
------------+-----------------------------------
      Total |        454      100.00

. margins, dydx(l_new_pos_pc) at(l_p_pos=(5 15 25 35 45))

Average marginal effects                        Number of obs     =        454
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : l_new_pos_pc

1._at        : l_p_pos         =           5

2._at        : l_p_pos         =          15

3._at        : l_p_pos         =          25

4._at        : l_p_pos         =          35

5._at        : l_p_pos         =          45

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
l_new_pos_pc |
         _at |
          1  |   .0482552   .0044851    10.76   0.000     .0392373    .0572732
          2  |   .0567633   .0034156    16.62   0.000     .0498958    .0636309
          3  |   .0652714   .0031609    20.65   0.000      .058916    .0716269
          4  |   .0737795   .0038848    18.99   0.000     .0659686    .0815904
          5  |   .0822876    .005193    15.85   0.000     .0718465    .0927288
------------------------------------------------------------------------------

. capture drop estimated_death_count_pc

. predict estimated_death_count_pc
(option xb assumed; fitted values)

. la var estimated_death_count_pc "Prediction from detection-adjusted cases (new cases X percent posi
> tive)"

. 
. twoway (line adj_covid_deaths_pc end_week) (line naive_case_count_pc end_week) (line estimated_deat
> h_count_pc end_week) if state=="New York", tlabel(21mar2020(7)16may2020)

. twoway (line adj_covid_deaths_pc end_week) (line naive_case_count_pc end_week) (line estimated_deat
> h_count_pc end_week) if state=="California", tlabel(21mar2020(7)16may2020)

. 
. list end_week adj_covid_deaths_pc naive_case_count_pc estimated_death_count_pc new_tests_pc p_pos n
> ew_pos_pc if state=="New York"

     +----------------------------------------------------------------------------+
     | end_week   adj_co~c   naive_~c   estima~c   new_te~c      p_pos   new_po~c |
     |----------------------------------------------------------------------------|
298. |     3/21   .8115541   .1537563   .1287441   215.6051   23.33507   50.31161 |
299. |     3/28   6.152531   3.374402   3.212642   565.4274   37.97569    214.725 |
300. |      4/4   20.70547   14.40161   16.38593   653.3908   48.07537   314.1201 |
301. |     4/11   34.18383   21.06804    26.6701   805.2263   42.42147   341.5888 |
302. |     4/18   29.48256   22.91038   27.35914   795.9796   36.17697   287.9613 |
     |----------------------------------------------------------------------------|
303. |     4/25    20.3074   19.31358   21.53401   926.3845   25.08396   232.3739 |
304. |      5/2    12.7283   15.58533   15.18398   928.7742   16.98815   157.7816 |
305. |      5/9   10.72165   10.58242   9.223099   996.2896   10.34685   103.0846 |
306. |     5/16   7.600087   6.913886   5.443316   1151.093   6.717078   77.31982 |
307. |     5/23   5.422128   5.185843   3.844042   1398.736   4.278126    59.8397 |
     +----------------------------------------------------------------------------+

. list end_week adj_covid_deaths_pc naive_case_count_pc estimated_death_count_pc new_tests_pc p_pos n
> ew_pos_pc if state=="California"

     +----------------------------------------------------------------------------+
     | end_week   adj_co~c   naive_~c   estima~c   new_te~c      p_pos   new_po~c |
     |----------------------------------------------------------------------------|
 39. |     3/21    .116636   .0310281   .0316636   28.71802   9.040493   2.596251 |
 40. |     3/28   .3420084   .1741306   .1342078   32.01453   26.56349   8.504174 |
 41. |      4/4   .7886941   .5703753   .5663921   223.7478   8.341619   18.66418 |
 42. |     4/11   1.040372   1.251808   .9537082   150.4637   14.43069   21.71295 |
 43. |     4/18   1.451929   1.456288   1.221982   218.5376   9.656784    21.1037 |
     |----------------------------------------------------------------------------|
 44. |     4/25   1.318154   1.415426   1.101977   622.8195   4.941369   30.77581 |
 45. |      5/2   1.439362   2.064135   1.483558   456.9806    6.11834   27.95962 |
 46. |      5/9   1.520211   1.875253   1.375801   570.7377   5.476442   31.25613 |
 47. |     5/16   1.414231    2.09635   1.520941   673.8522   4.588904   30.92243 |
 48. |     5/23   1.271569   2.073969   1.481353   849.8612   4.116247   34.98239 |
     +----------------------------------------------------------------------------+

. 
. // excess respiratory deaths
. 
. reg adj_excess_respir_deaths_pc c.l_new_pos_pc if l_p_pos != ., cluster(fips) nocons

Linear regression                               Number of obs     =        454
                                                F(1, 48)          =     156.99
                                                Prob > F          =     0.0000
                                                R-squared         =     0.8573
                                                Root MSE          =     1.9361

                                  (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
a~respir_d~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
l_new_pos_pc |   .0692088   .0055237    12.53   0.000     .0581026    .0803149
------------------------------------------------------------------------------

. margins, dydx(l_new_pos_pc)

Average marginal effects                        Number of obs     =        454
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : l_new_pos_pc

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
l_new_pos_pc |   .0692088   .0055237    12.53   0.000     .0581026    .0803149
------------------------------------------------------------------------------

. 
. reg adj_excess_respir_deaths_pc c.l_new_pos_pc c.l_new_pos_pc#c.l_p_pos, cluster(fips) nocons

Linear regression                               Number of obs     =        454
                                                F(2, 48)          =     201.13
                                                Prob > F          =     0.0000
                                                R-squared         =     0.8944
                                                Root MSE          =     1.6669

                                              (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------------------
                         |               Robust
adj_excess_respir_deat~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
            l_new_pos_pc |   .0429279   .0055894     7.68   0.000     .0316898    .0541661
                         |
c.l_new_pos_pc#c.l_p_pos |   .0009693   .0001928     5.03   0.000     .0005817    .0013569
------------------------------------------------------------------------------------------

. margins, dydx(l_new_pos_pc) at(l_p_pos=(5 15 25 35 45))

Average marginal effects                        Number of obs     =        454
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : l_new_pos_pc

1._at        : l_p_pos         =           5

2._at        : l_p_pos         =          15

3._at        : l_p_pos         =          25

4._at        : l_p_pos         =          35

5._at        : l_p_pos         =          45

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
l_new_pos_pc |
         _at |
          1  |   .0477743   .0048547     9.84   0.000     .0380132    .0575354
          2  |    .057467   .0037146    15.47   0.000     .0499983    .0649357
          3  |   .0671597   .0033853    19.84   0.000     .0603531    .0739664
          4  |   .0768525   .0040689    18.89   0.000     .0686714    .0850335
          5  |   .0865452   .0053929    16.05   0.000     .0757019    .0973884
------------------------------------------------------------------------------

. tab end_week if e(sample)==1

   end_week |      Freq.     Percent        Cum.
------------+-----------------------------------
       3/21 |         30        6.61        6.61
       3/28 |         37        8.15       14.76
        4/4 |         45        9.91       24.67
       4/11 |         49       10.79       35.46
       4/18 |         49       10.79       46.26
       4/25 |         49       10.79       57.05
        5/2 |         48       10.57       67.62
        5/9 |         49       10.79       78.41
       5/16 |         49       10.79       89.21
       5/23 |         49       10.79      100.00
------------+-----------------------------------
      Total |        454      100.00

. 
. // excess all-cause deaths
. 
. reg adj_excess_deaths_pc c.l_new_pos_pc if l_p_pos != ., cluster(fips) nocons

Linear regression                               Number of obs     =        454
                                                F(1, 48)          =     235.82
                                                Prob > F          =     0.0000
                                                R-squared         =     0.7955
                                                Root MSE          =     3.4118

                                  (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
adj_excess.. |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
l_new_pos_pc |   .0981558   .0063918    15.36   0.000     .0853042    .1110075
------------------------------------------------------------------------------

. margins, dydx(l_new_pos_pc)

Average marginal effects                        Number of obs     =        454
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : l_new_pos_pc

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
l_new_pos_pc |   .0981558   .0063918    15.36   0.000     .0853042    .1110075
------------------------------------------------------------------------------

. 
. reg adj_excess_deaths_pc c.l_new_pos_pc c.l_new_pos_pc#c.l_p_pos, cluster(fips) nocons

Linear regression                               Number of obs     =        454
                                                F(2, 48)          =     210.49
                                                Prob > F          =     0.0000
                                                R-squared         =     0.8094
                                                Root MSE          =     3.2971

                                              (Std. Err. adjusted for 49 clusters in fips)
------------------------------------------------------------------------------------------
                         |               Robust
    adj_excess_deaths_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
            l_new_pos_pc |   .0744582   .0094961     7.84   0.000     .0553651    .0935514
                         |
c.l_new_pos_pc#c.l_p_pos |    .000874   .0003191     2.74   0.009     .0002324    .0015156
------------------------------------------------------------------------------------------

. margins, dydx(l_new_pos_pc) at(l_p_pos=(5 15 25 35 45))

Average marginal effects                        Number of obs     =        454
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : l_new_pos_pc

1._at        : l_p_pos         =           5

2._at        : l_p_pos         =          15

3._at        : l_p_pos         =          25

4._at        : l_p_pos         =          35

5._at        : l_p_pos         =          45

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
l_new_pos_pc |
         _at |
          1  |   .0788282   .0081557     9.67   0.000     .0624301    .0952264
          2  |   .0875682    .005871    14.92   0.000     .0757637    .0993727
          3  |   .0963082   .0047737    20.17   0.000       .08671    .1059063
          4  |   .1050481     .00561    18.73   0.000     .0937684    .1163279
          5  |   .1137881   .0077796    14.63   0.000     .0981462    .1294301
------------------------------------------------------------------------------

. tab end_week if e(sample)==1

   end_week |      Freq.     Percent        Cum.
------------+-----------------------------------
       3/21 |         30        6.61        6.61
       3/28 |         37        8.15       14.76
        4/4 |         45        9.91       24.67
       4/11 |         49       10.79       35.46
       4/18 |         49       10.79       46.26
       4/25 |         49       10.79       57.05
        5/2 |         48       10.57       67.62
        5/9 |         49       10.79       78.41
       5/16 |         49       10.79       89.21
       5/23 |         49       10.79      100.00
------------+-----------------------------------
      Total |        454      100.00

. 
. // covid hospitalizations
. restore

. keep if dayscollapsed==7
(19,169 observations deleted)

. gen hospitalizedcurrently_pc = hospitalizedcurrently * 100000 / population
(322 missing values generated)

. 
. reg hospitalizedcurrently_pc c.l_new_pos_pc if l_p_pos != ., cluster(fips) nocons

Linear regression                               Number of obs     =        345
                                                F(1, 43)          =     272.85
                                                Prob > F          =     0.0000
                                                R-squared         =     0.8995
                                                Root MSE          =     6.9434

                                  (Std. Err. adjusted for 44 clusters in fips)
------------------------------------------------------------------------------
             |               Robust
hospitaliz~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
l_new_pos_pc |   .2542242   .0153905    16.52   0.000     .2231863    .2852621
------------------------------------------------------------------------------

. margins, dydx(l_new_pos_pc)

Average marginal effects                        Number of obs     =        345
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : l_new_pos_pc

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
l_new_pos_pc |   .2542242   .0153905    16.52   0.000     .2231863    .2852621
------------------------------------------------------------------------------

. tab end_week if e(sample)==1

   end_week |      Freq.     Percent        Cum.
------------+-----------------------------------
   20200328 |          4        1.16        1.16
   20200404 |         13        3.77        4.93
   20200411 |         19        5.51       10.43
   20200418 |         29        8.41       18.84
   20200425 |         34        9.86       28.70
   20200502 |         37       10.72       39.42
   20200509 |         39       11.30       50.72
   20200516 |         42       12.17       62.90
   20200523 |         43       12.46       75.36
   20200530 |         43       12.46       87.83
   20200606 |         42       12.17      100.00
------------+-----------------------------------
      Total |        345      100.00

. 
. reg hospitalizedcurrently_pc c.l_new_pos_pc c.l_new_pos_pc#c.l_p_pos, cluster(fips) nocons

Linear regression                               Number of obs     =        345
                                                F(2, 43)          =    2741.81
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9098
                                                Root MSE          =     6.5886

                                              (Std. Err. adjusted for 44 clusters in fips)
------------------------------------------------------------------------------------------
                         |               Robust
hospitalizedcurrently_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
            l_new_pos_pc |   .2086919   .0263114     7.93   0.000       .15563    .2617538
                         |
c.l_new_pos_pc#c.l_p_pos |   .0017727    .000605     2.93   0.005     .0005525    .0029929
------------------------------------------------------------------------------------------

. margins, dydx(l_new_pos_pc) at(l_p_pos=(5 15 25 35 45))

Average marginal effects                        Number of obs     =        345
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : l_new_pos_pc

1._at        : l_p_pos         =           5

2._at        : l_p_pos         =          15

3._at        : l_p_pos         =          25

4._at        : l_p_pos         =          35

5._at        : l_p_pos         =          45

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
l_new_pos_pc |
         _at |
          1  |   .2175555   .0233229     9.33   0.000     .1705203    .2645907
          2  |   .2352828   .0173843    13.53   0.000      .200224    .2703416
          3  |   .2530101   .0115622    21.88   0.000     .2296927    .2763274
          4  |   .2707374   .0061942    43.71   0.000     .2582455    .2832292
          5  |   .2884646   .0040333    71.52   0.000     .2803306    .2965986
------------------------------------------------------------------------------

. gen hospitalization_sample = e(sample)

. tab state hospitalization_sample

                     | hospitalization_sampl
                     |           e
     (firstnm) state |         0          1 |     Total
---------------------+----------------------+----------
             Alabama |        13          0 |        13 
              Alaska |         6          7 |        13 
             Arizona |         6          7 |        13 
            Arkansas |         2         11 |        13 
          California |         3         10 |        13 
            Colorado |         2         11 |        13 
         Connecticut |         2         11 |        13 
            Delaware |         3         10 |        13 
District of Columbia |         9          4 |        13 
             Florida |        13          0 |        13 
             Georgia |        11          2 |        13 
              Hawaii |        13          0 |        13 
               Idaho |        13          0 |        13 
            Illinois |         5          8 |        13 
             Indiana |         7          6 |        13 
                Iowa |         3         10 |        13 
              Kansas |        13          0 |        13 
            Kentucky |         5          8 |        13 
           Louisiana |         4          9 |        13 
               Maine |         6          7 |        13 
            Maryland |         7          6 |        13 
       Massachusetts |         3          9 |        12 
            Michigan |         6          8 |        14 
           Minnesota |         3         10 |        13 
         Mississippi |         7          6 |        13 
            Missouri |         4          9 |        13 
             Montana |         5          8 |        13 
            Nebraska |        13          0 |        13 
              Nevada |         9          4 |        13 
       New Hampshire |         6          7 |        13 
          New Jersey |         3         10 |        13 
          New Mexico |         3         10 |        13 
            New York |         2         11 |        13 
      North Carolina |         3         10 |        13 
        North Dakota |         4          9 |        13 
                Ohio |         8          5 |        13 
            Oklahoma |         6          7 |        13 
              Oregon |         5          8 |        13 
        Pennsylvania |         5          8 |        13 
        Rhode Island |         4         10 |        14 
      South Carolina |        11          2 |        13 
        South Dakota |         7          6 |        13 
           Tennessee |        13          0 |        13 
               Texas |         4          9 |        13 
                Utah |         9          4 |        13 
             Vermont |         4          9 |        13 
            Virginia |         5          8 |        13 
          Washington |        10          9 |        19 
       West Virginia |         5          8 |        13 
           Wisconsin |         5          8 |        13 
             Wyoming |         7          6 |        13 
---------------------+----------------------+----------
               Total |       325        345 |       670 

. 
. 
. log close
      name:  <unnamed>
       log:  C:\Users\favero\Documents\GitHub\covid-underreporting\code\..\logs\simple_indicator_of_c
> ovid_severity.txt
  log type:  text
 closed on:  12 Jun 2020, 14:07:25
-----------------------------------------------------------------------------------------------------
